[
  {
    "body_html": "I’m seeing more commercial breaks and flags than football bro",
    "created_utc": 1759009329.0
  },
  {
    "body_html": "Who’s gonna tell Arnold that holding onto the ball so you don’t throw a pick is actually worse than throwing a pick",
    "created_utc": 1759009325.0
  },
  {
    "body_html": "went to grab more beers. what happened?",
    "created_utc": 1759009324.0
  },
  {
    "body_html": "Stinger?",
    "created_utc": 1759009284.0
  },
  {
    "body_html": "Watched replay and didn’t see anything on 24, just engaged with 2 blockers   Weird, hopefully just a wind knocker",
    "created_utc": 1759009257.0
  },
  {
    "body_html": "Can we just call the game now",
    "created_utc": 1759009237.0
  },
  {
    "body_html": "Man, I hate to see that. Hope he is ok.",
    "created_utc": 1759009233.0
  },
  {
    "body_html": "Arkansas has a brighter future  Florida has a brighter future  Clemson has a brighter future even if they keep Dabo for another 20 years  Oklahoma State had a brighter future if they kept Gundy",
    "created_utc": 1759009229.0
  },
  {
    "body_html": "I love how quite it gets at A&amp;M when there is an injury. Dont like the injuries but love the respect.",
    "created_utc": 1759009207.0
  },
  {
    "body_html": "Mississippi State starting to look overmatched by UT.",
    "created_utc": 1759009187.0
  },
  {
    "body_html": "Fuck, I hope Crawford is okay",
    "created_utc": 1759009179.0
  },
  {
    "body_html": "Daniels hits the hole so slowly",
    "created_utc": 1759009172.0
  },
  {
    "body_html": "The fact that we are 2/7 on third down and we are still more efficient than auburn is interesting.",
    "created_utc": 1759009140.0
  },
  {
    "body_html": "I'm sorry but having a guy named Bussy makes it hard to comment seriously",
    "created_utc": 1759009137.0
  },
  {
    "body_html": "Miss St. looking kind of scary.",
    "created_utc": 1759009109.0
  },
  {
    "body_html": "Never seen a 3 button suit with a button hole in the fold, weird fashion choice by Tessitore",
    "created_utc": 1759009100.0
  },
  {
    "body_html": "Over/under 27.5 penalties.",
    "created_utc": 1759009086.0
  },
  {
    "body_html": "Can we name Bruce pearl as the new hc",
    "created_utc": 1759009071.0
  },
  {
    "body_html": "How much time before 3Q?",
    "created_utc": 1759009063.0
  },
  {
    "body_html": "I have the option of going inside to pee, but as a property owner I choose to pee in the yard.",
    "created_utc": 1759009054.0
  },
  {
    "body_html": "While missing that FG hurts, with our without it, a TD here makes it 3 scores  Someone check my math, Poli Sci degree holder here",
    "created_utc": 1759009045.0
  },
  {
    "body_html": "I hope the refs got the call from the sec at half and were told to let the boys play",
    "created_utc": 1759008955.0
  },
  {
    "body_html": "In the McDonalds ad they place the chicken filet onto an upside down top bun.  This bothers me tremendously.",
    "created_utc": 1759008909.0
  },
  {
    "body_html": "Haven’t watched, has Arnold been sacked a billion times yet",
    "created_utc": 1759008907.0
  },
  {
    "body_html": "Love seeing Brian Kelly’s arrogant ass handed to him",
    "created_utc": 1759008902.0
  },
  {
    "body_html": "Who’s a bigger 5* bust than Jackson Arnold?",
    "created_utc": 1759008882.0
  },
  {
    "body_html": "At least I have Wingstop and beer to get me through these troubling times.  Cheers, fellas.  [raises drumstick]",
    "created_utc": 1759008853.0
  },
  {
    "body_html": "Is it even fair that Ole Miss has an entire Island Nation playing on their offense?",
    "created_utc": 1759008837.0
  },
  {
    "body_html": "Time to crack the second half body armor.  Also LSU officially on fraud watch",
    "created_utc": 1759008835.0
  },
  {
    "body_html": "Lane rocking that Salt Life fishing hoodie while his team just went up on LSU.",
    "created_utc": 1759008787.0
  },
  {
    "body_html": "I can’t wait for after the game where Freeze says we couldn’t run the ball cause they were stopping us after running it four times in the first half with two of those runs coming on 3rd and long.",
    "created_utc": 1759008782.0
  },
  {
    "body_html": "Imagine being a parent and your son is Jackson Arnold. I wouldn’t show my face.",
    "created_utc": 1759008781.0
  },
  {
    "body_html": "I’m at a bachelor party and am almost assuredly over the limit. Could someone recap the first half for me? I will give you a virtual high five.",
    "created_utc": 1759008771.0
  },
  {
    "body_html": "So who do yall want when we fire Freeze? I’d love to see if Lashlee would be willing to come back",
    "created_utc": 1759008747.0
  },
  {
    "body_html": "How much money did auburn pay Arnold?",
    "created_utc": 1759008699.0
  },
  {
    "body_html": "Has Vandy ever started a season 5-0?",
    "created_utc": 1759008654.0
  },
  {
    "body_html": "Even ESPN has its own short form content board? We as a society are doomed",
    "created_utc": 1759008649.0
  },
  {
    "body_html": "Whose excited for another half of refball?",
    "created_utc": 1759008647.0
  },
  {
    "body_html": "oooo keith david whisper sweet nothings about overpriced cars and products into my ears",
    "created_utc": 1759008645.0
  },
  {
    "body_html": "I hate this game",
    "created_utc": 1759008626.0
  },
  {
    "body_html": "aight opened my first beer, wife went into the other room. time to degenerate into madness.",
    "created_utc": 1759008590.0
  },
  {
    "body_html": "In the height of the saban era we had 4 wins against alabama and only had a losing season once in 2012. Something needs to change. I defended Hugh before the season started and I thought he had us on the right track after the Baylor game but we've regressed back to the same old shit. Lose this game and theres no chance in hell we beat UGA. Going 0-3 in this stretch means hugh has to go. These are his guys.",
    "created_utc": 1759008586.0
  },
  {
    "body_html": "When you have more fourth down conversions than third down conversions, things aren't going well.",
    "created_utc": 1759008579.0
  },
  {
    "body_html": "The Noble Men of Kyle improve to 3-0 at halftimes on the season!",
    "created_utc": 1759008549.0
  },
  {
    "body_html": "Auburn needs a new commercial.  Pretty sure we don't play basketball anymore....",
    "created_utc": 1759008513.0
  },
  {
    "body_html": "I can’t believe I’m saying this. Thorne&gt;Arnold. I’m gonna throw up. I would rather Arnold throw some picks then play like a fucking bitch all game",
    "created_utc": 1759008486.0
  },
  {
    "body_html": "It’s actually insane how every big offensive play has been called back. Refs trying to bring back old school SEC by themselves.",
    "created_utc": 1759008467.0
  },
  {
    "body_html": "FIRE FREEZE. Make Durkin interim.",
    "created_utc": 1759008441.0
  },
  {
    "body_html": "Miss st 👀",
    "created_utc": 1759008435.0
  },
  {
    "body_html": "The head ref looks like the Hutchback of Notre Dame",
    "created_utc": 1759008416.0
  },
  {
    "body_html": "I flipped over to the MSU - UT game just in time for a flag",
    "created_utc": 1759008414.0
  },
  {
    "body_html": "Auburn is flatter than a possum laying on a county road for the last four days.",
    "created_utc": 1759008409.0
  },
  {
    "body_html": "Why did I get cursed with being an Auburn fan?",
    "created_utc": 1759008402.0
  },
  {
    "body_html": "Auburn seems like they're in a no win situation.   They need to make explosive plays, but that requires the QB being able to make the big throw, and to make the big throw the QB needs time in the pocket, but the defense is either too good or the offensive line too bad for the QB to get enough time in the pocket. Or the QB just holds it way too long and takes the sack.",
    "created_utc": 1759008382.0
  },
  {
    "body_html": "This halftime has been flagged for holding",
    "created_utc": 1759008347.0
  },
  {
    "body_html": "I wanna die tbh",
    "created_utc": 1759008324.0
  },
  {
    "body_html": "So… Jackson Arnold isn’t at all on Payton Thorne’s level… is he?  Thorne threw for 301 and 2 TDs against this same defense and delivered a dime to KLS to seal the game.",
    "created_utc": 1759008245.0
  },
  {
    "body_html": "I’ve got an idea, let’s fire Hugh Sleaze",
    "created_utc": 1759008202.0
  },
  {
    "body_html": "[deleted]",
    "created_utc": 1759008175.0
  },
  {
    "body_html": "Burger King doesn’t support athletes",
    "created_utc": 1759008172.0
  },
  {
    "body_html": "How does auburn improve offense? EJ - \"extend drives\" . Yes that's what the host is asking how. Just play more commericals instead of this lol",
    "created_utc": 1759008165.0
  },
  {
    "body_html": "Breaking: both teams have just been flagged for holding heading into the locker room",
    "created_utc": 1759008099.0
  },
  {
    "body_html": "Sorry, Auburn, but September exists to build up Aggie hopes that will be dashed in November.",
    "created_utc": 1759008103.0
  },
  {
    "body_html": "TV: “ makes it past the first wave of would be tacklers”  My son: “Wookiee tacklers???”",
    "created_utc": 1759006327.0
  },
  {
    "body_html": "A TEXTBOOK TWO MIN DRILL?!?!?!?!? WHAT IS THIS?!?!",
    "created_utc": 1759007715.0
  },
  {
    "body_html": "Auburn fan venting:  We are 3 years into a Hugh Freeze tenure and have consistently relied on transfer portal qbs. It is disappointing we haven’t been able to find a qb recruit to buy in early and learn the system. Hopefully Deuce stays and becomes the first.",
    "created_utc": 1759006705.0
  },
  {
    "body_html": "That loss of 30-40 seconds because of the penalty was critical. Regis is way too old to be making these mistakes. Gotta be smarter.",
    "created_utc": 1759007906.0
  },
  {
    "body_html": "I like the A&amp;M mariachi group getting some camera time. Hope they continue to grow",
    "created_utc": 1759008155.0
  },
  {
    "body_html": "\"Do you enjoy college sports?\" No. Not really.",
    "created_utc": 1759008156.0
  },
  {
    "body_html": "This penalty competition is interesting but I’d prefer to watch football.",
    "created_utc": 1759007770.0
  },
  {
    "body_html": "15 penalties for 118 yards between the two teams in one half.  How badly did the SEC hurt the refs after last week?",
    "created_utc": 1759008028.0
  },
  {
    "body_html": "Wait you guys have a QB who can make plays under duress? That’s not fair, man.",
    "created_utc": 1759006639.0
  },
  {
    "body_html": "Arnold has zero velocity on his throws. He is fucking trash and freeze’s playcalling is ass. Writing on the wall",
    "created_utc": 1759007491.0
  },
  {
    "body_html": "The Oklahoma game there was 22 total penalties.<br/> This game currently has 14.",
    "created_utc": 1759007503.0
  },
  {
    "body_html": "In my years of being an Aggie, that was the only time I've ever seen us execute a drive like that correctly",
    "created_utc": 1759007779.0
  },
  {
    "body_html": "I don’t understand why A&amp;M’s offense always looks so clunky. Always shooting ourselves in the foot with penalties. Feels like we should be ahead 24-3. That’s how it’s felt every year, that needs to change. So bad",
    "created_utc": 1759008052.0
  },
  {
    "body_html": "Let's just agree that every possession should include a holding call.",
    "created_utc": 1759006397.0
  },
  {
    "body_html": "Come on A&amp;M!",
    "created_utc": 1759006689.0
  },
  {
    "body_html": "could fit more commercials in if we do a picture in picture. -some ESPN employee somewhere",
    "created_utc": 1759006829.0
  },
  {
    "body_html": "Gotta love when the announcers even call the penalty bullshit.",
    "created_utc": 1759007339.0
  },
  {
    "body_html": "It seems like Reed really wants to be a pocket QB, which is admirable, but he does so well on the run.",
    "created_utc": 1759007709.0
  },
  {
    "body_html": "That drive was art",
    "created_utc": 1759007735.0
  },
  {
    "body_html": "Friendship ended with Auburn, now doing chores and playing video games is my best friend",
    "created_utc": 1759007883.0
  },
  {
    "body_html": "Offensive genius Hugh Freeze is putting on a clinc today.",
    "created_utc": 1759007471.0
  },
  {
    "body_html": "All we had to do was not give up 70 yards and it’s 40 fucking seconds left",
    "created_utc": 1759007725.0
  },
  {
    "body_html": "High IQ drive all around",
    "created_utc": 1759007728.0
  },
  {
    "body_html": "Randy is an anomaly in my mind. I don’t trust him in any kicking situation for some reason, even though he’s a solid college kicker. Idk what it is",
    "created_utc": 1759007822.0
  },
  {
    "body_html": "Aggies vs themselves: penalty boogaloo",
    "created_utc": 1759008035.0
  },
  {
    "body_html": "Fire Hugh man this is embarrassing",
    "created_utc": 1759006244.0
  },
  {
    "body_html": "Fucking hell KC looked like a man escaping fast movie zombies there",
    "created_utc": 1759006294.0
  },
  {
    "body_html": "Going for a blocked punt is just not worth it lol",
    "created_utc": 1759007399.0
  },
  {
    "body_html": "I never understood why Freeze wanted Arnold and why Arnold wanted freeze, aside from money, because they are not a good fit. Arnold needed to go someplace to have his confidence built back up and Freeze needed a win now QB. Just bad roster management.",
    "created_utc": 1759007431.0
  },
  {
    "body_html": "Take him out of the game right now. This is unacceptable",
    "created_utc": 1759007453.0
  },
  {
    "body_html": "I just want to see us call a run play when it's not 3rd and 20",
    "created_utc": 1759007472.0
  },
  {
    "body_html": "The Auburn coaching carousel has been really fun when I have been able to separate myself emotionally as a fan. (I’m a Malzahn apologist)",
    "created_utc": 1759007629.0
  },
  {
    "body_html": "Damn, good try though",
    "created_utc": 1759007789.0
  },
  {
    "body_html": "Let's just pretend there's only 30 seconds left for the rest of the game.",
    "created_utc": 1759007820.0
  },
  {
    "body_html": "That drive deserved better than that. Oh well",
    "created_utc": 1759007822.0
  },
  {
    "body_html": "2nd a game in a row we missed the points before half",
    "created_utc": 1759007827.0
  },
  {
    "body_html": "I wanted to be the ones to put LSU on fraud watch :(",
    "created_utc": 1759007996.0
  },
  {
    "body_html": "a&amp;m not having a kicker work at fucking NASA. are they stupid?",
    "created_utc": 1759008082.0
  },
  {
    "body_html": "TAMU has a good one in Boerkircher. Dude seems so clutch.",
    "created_utc": 1759008107.0
  },
  {
    "body_html": "Holy shit there is absolutely no consistency in these calls. So insane",
    "created_utc": 1759005814.0
  },
  {
    "body_html": "“There is no bottom” someone missed the Arky ND game.",
    "created_utc": 1759006155.0
  },
  {
    "body_html": "I'm not sure we practice during the week",
    "created_utc": 1759006300.0
  },
  {
    "body_html": "Averaging 63 penalty yards per game, already at 50 in the first half. Maybe we can beat our record of 86",
    "created_utc": 1759006809.0
  },
  {
    "body_html": "There’s the false start!",
    "created_utc": 1759007402.0
  },
  {
    "body_html": "Pls don't hit the kicker this time",
    "created_utc": 1759007458.0
  },
  {
    "body_html": "Flag fest today",
    "created_utc": 1759007508.0
  },
  {
    "body_html": "That's MY TE",
    "created_utc": 1759007719.0
  },
  {
    "body_html": "I really don’t know what to make of the SEC this year. LSU is losing to a team that barely beat Arkansas. Texas has looked like ass because Arch has been bad. Oklahoma can’t run the ball and has a massively banged up OL. Auburn can’t throw the ball with any consistency. I don’t know what to make of A&amp;M and their penalties. Georgie, Vandy, Tennessee, and Alabama may not have any kind of defense. Florida is lol Florida. Miss State has been better than advertised but I don’t know if it’s because they’ve played nothing but bad defense but still. I’m sure I’m forgetting someone but all these teams look very beatable.",
    "created_utc": 1759007787.0
  },
  {
    "body_html": "Well, cool drive goes to waste",
    "created_utc": 1759007795.0
  },
  {
    "body_html": "Ah well that would have been nice",
    "created_utc": 1759007802.0
  },
  {
    "body_html": "Incredible drive. Would’ve liked the points. But we get ball back so that’s ok. I feel like we’ve controlled the game, but need to show it in points.",
    "created_utc": 1759007978.0
  },
  {
    "body_html": "So LSU’s only touchdown was an accident and BK wonders why the media asks about his offense every post game?",
    "created_utc": 1759008005.0
  },
  {
    "body_html": "Whereas the ND game felt very chaotic, this feels much more controlled.  I'm shocked we're playing so well, honestly.",
    "created_utc": 1759008044.0
  },
  {
    "body_html": "Nice 3rd down red zone play call. Real good stuff",
    "created_utc": 1759005146.0
  },
  {
    "body_html": "<blockquote> there is no bottom in the SEC </blockquote>  My brother in Christ I have news about Arky",
    "created_utc": 1759006135.0
  },
  {
    "body_html": "Best WR group in the country and we run a tight end screen",
    "created_utc": 1759006236.0
  },
  {
    "body_html": "“3rd and California”  You know Jesse’s been sitting on that one",
    "created_utc": 1759006248.0
  },
  {
    "body_html": "Most teams run drills in practice to combat against false starts and holding, Auburn practices false starts and holding.  /s",
    "created_utc": 1759006523.0
  },
  {
    "body_html": "How did Niblack not just fucking die there? That was a hospital ball",
    "created_utc": 1759006643.0
  },
  {
    "body_html": "I don't get what's wrong with that kind of play, like surely you just keep your eyes peeled for that kind of thing?",
    "created_utc": 1759007146.0
  },
  {
    "body_html": "That was good D not a drop",
    "created_utc": 1759007171.0
  },
  {
    "body_html": "Bro are you fucking kidding me",
    "created_utc": 1759007295.0
  },
  {
    "body_html": "What a bail out lol",
    "created_utc": 1759007320.0
  },
  {
    "body_html": "we told you guys arnold is bad",
    "created_utc": 1759007358.0
  },
  {
    "body_html": "Auburn no 65 had 3 false start penalties against Oklahoma and already has 2 this game.",
    "created_utc": 1759007421.0
  },
  {
    "body_html": "Just fire him already",
    "created_utc": 1759007425.0
  },
  {
    "body_html": "I can't even enjoy this game. Like at this point I'd like auburn to have less penalties called on them so I can just watch some football...",
    "created_utc": 1759007449.0
  },
  {
    "body_html": "God I am not the strongest soldier",
    "created_utc": 1759007593.0
  },
  {
    "body_html": "That was a heck of a run by Reed.",
    "created_utc": 1759007687.0
  },
  {
    "body_html": "Reed can only execute with &lt;60 seconds",
    "created_utc": 1759007769.0
  },
  {
    "body_html": "Damn",
    "created_utc": 1759007793.0
  },
  {
    "body_html": "Damn. Love the drive",
    "created_utc": 1759007803.0
  },
  {
    "body_html": "Missed kick sucks but at least you have a little mojo on offense going into the locker room",
    "created_utc": 1759007844.0
  },
  {
    "body_html": "I feel like Reed is similar to Jalen Hurts right now.  He needs to find a rhythm, and once he does he can become lethal. But if you don't let him build into it he has some issues",
    "created_utc": 1759007845.0
  },
  {
    "body_html": "The cowbells are scaring me already, they're going to want to murder Craver",
    "created_utc": 1759007965.0
  },
  {
    "body_html": "🤷🏽  I don’t know, man. Freeze is just a dead man walking. Georgia is going to absolutely dog walk us in JHS in two weeks. This was a rough slate to open conference play, but that’s no excuse. Too much talent to be held to 105 yards against any team.",
    "created_utc": 1759007992.0
  },
  {
    "body_html": "I was hoping Arnold would be a consistent baller at Auburn, but his ceiling seems to be a really good backup QB.",
    "created_utc": 1759008032.0
  },
  {
    "body_html": "SOMEONE STOLE MY FUCKING POPEYES CHICKEN SANDWICH  I WAS HUNGRY AND HIGH  I AM SO MAD",
    "created_utc": 1759005821.0
  },
  {
    "body_html": "TE screen is the most confusing play to me. Let’s throw it behind the line of scrimmage to our slowest pass catcher.",
    "created_utc": 1759006344.0
  },
  {
    "body_html": "HERE COMES A HOOOOOOOOOOOOOOOOOOLD",
    "created_utc": 1759006511.0
  },
  {
    "body_html": "Shouldn't even be a penatly.... be aware",
    "created_utc": 1759007159.0
  },
  {
    "body_html": "Auburn offense, blink if you're still alive.",
    "created_utc": 1759007177.0
  },
  {
    "body_html": "I love Andy Griffith reruns as much as anyone but I'm over gomer pyle interrupting this game",
    "created_utc": 1759007342.0
  },
  {
    "body_html": "Playing defense is a penalty",
    "created_utc": 1759007383.0
  },
  {
    "body_html": "I love how our entire gameplan is throwing to the sidelines",
    "created_utc": 1759007420.0
  },
  {
    "body_html": "OU fans had to pretend this guy was good",
    "created_utc": 1759007430.0
  },
  {
    "body_html": "This might be the most boring Auburn TAMU game in recent memory so far. I feel like vs Auburn is always crazy, but this one is both teams just racking up penalties.",
    "created_utc": 1759007465.0
  },
  {
    "body_html": "The real 12th man is an Auburn Lineman",
    "created_utc": 1759007498.0
  },
  {
    "body_html": "Just go to half. I’m over it with these penalties",
    "created_utc": 1759007563.0
  },
  {
    "body_html": "Damn, I do not love how well Marcel Reed has developed. He’s nasty.",
    "created_utc": 1759007686.0
  },
  {
    "body_html": "I had optimism that Auburn would be much better in the 2025 season then 2024 but then I saw they picked Jackson Arnold",
    "created_utc": 1759007695.0
  },
  {
    "body_html": "[deleted]",
    "created_utc": 1759007726.0
  },
  {
    "body_html": "What an ice by Freeze",
    "created_utc": 1759007823.0
  },
  {
    "body_html": "So does anyone feel confident in their teams after the first half",
    "created_utc": 1759007875.0
  },
  {
    "body_html": "The crash from enjoying our first game to now has been extra soul crushing this season for some reason.",
    "created_utc": 1759008022.0
  },
  {
    "body_html": "Can we ban icing the kicker? Not because it's unfair, but because it's boring to watch.",
    "created_utc": 1759007772.0
  },
  {
    "body_html": "Hugh Freeze needs a lobotomy",
    "created_utc": 1759006266.0
  },
  {
    "body_html": "Please can we put together a drive again?",
    "created_utc": 1759006310.0
  },
  {
    "body_html": "But guys if Auburn stops committing so many penalties and starts executing on plays and starts taking advantage of A&amp;M’s mistakes then we would be a totally amazing team you can’t blame Freeze that all this stuff is going wrong.",
    "created_utc": 1759006346.0
  },
  {
    "body_html": "<blockquote> “Lunchables will make you a fucking badass…” </blockquote>",
    "created_utc": 1759006775.0
  },
  {
    "body_html": "BOND WITH A DIME",
    "created_utc": 1759007013.0
  },
  {
    "body_html": "Texas fans hating Lunchables is my biggest takeaway from this game so far.  Absolute psycho behavior.",
    "created_utc": 1759007086.0
  },
  {
    "body_html": "Our DBs always look a millimeter from giving up a touchdown",
    "created_utc": 1759007177.0
  },
  {
    "body_html": "Jfc lol",
    "created_utc": 1759007185.0
  },
  {
    "body_html": "Running into the kicker? Are you fucking kidding me?!",
    "created_utc": 1759007298.0
  },
  {
    "body_html": "What a flop.",
    "created_utc": 1759007317.0
  },
  {
    "body_html": "...Jackson is aware you can throw it past the line of scrimmage right?",
    "created_utc": 1759007360.0
  },
  {
    "body_html": "Drama major",
    "created_utc": 1759007366.0
  },
  {
    "body_html": "Jackson Arnold sucks. No chance he brings them back from down double digits.",
    "created_utc": 1759007385.0
  },
  {
    "body_html": "Arnold ain't it",
    "created_utc": 1759007397.0
  },
  {
    "body_html": "12TH MAN",
    "created_utc": 1759007437.0
  },
  {
    "body_html": "I’m going to practice with a sledgehammer for our OL next week",
    "created_utc": 1759007441.0
  },
  {
    "body_html": "Chaplin is about to get benched",
    "created_utc": 1759007442.0
  },
  {
    "body_html": "Time to send Chaplin back to seminary or something.",
    "created_utc": 1759007453.0
  },
  {
    "body_html": "Freeze should have 1 play, f*ck it, Cam is down there somewhere",
    "created_utc": 1759007526.0
  },
  {
    "body_html": "These refs are ridiculous",
    "created_utc": 1759007535.0
  },
  {
    "body_html": "This is possibly the worst penalty game I have ever watched, both directions",
    "created_utc": 1759007563.0
  },
  {
    "body_html": "Do they even put the flags back in their pockets or just always have them in hand",
    "created_utc": 1759007577.0
  },
  {
    "body_html": "flag fans are feasting rn",
    "created_utc": 1759007582.0
  },
  {
    "body_html": "Refs trying to be the main characters today",
    "created_utc": 1759007600.0
  },
  {
    "body_html": "<blockquote> “It’s a much different outcome muhhhh mahhhn </blockquote>",
    "created_utc": 1759007606.0
  },
  {
    "body_html": "It should have been halftime 5 penalties ago",
    "created_utc": 1759007614.0
  },
  {
    "body_html": "What a 45 second drive, I’m very impressed",
    "created_utc": 1759007696.0
  },
  {
    "body_html": "No fair, A&amp;M has a real coach",
    "created_utc": 1759007697.0
  },
  {
    "body_html": "This has been a beautiful drive honestly",
    "created_utc": 1759007701.0
  },
  {
    "body_html": "where has this been all game",
    "created_utc": 1759007702.0
  },
  {
    "body_html": "So that's how an offense executes",
    "created_utc": 1759007705.0
  },
  {
    "body_html": "lol not even gonna bother protecting the sidelines?",
    "created_utc": 1759007710.0
  },
  {
    "body_html": "Lets go RANDY!",
    "created_utc": 1759007716.0
  },
  {
    "body_html": "Boerkircher(sp?) was awesome there.",
    "created_utc": 1759007737.0
  },
  {
    "body_html": "Ah fuck, if he hits that i get to turn my PS5 back on",
    "created_utc": 1759007810.0
  },
  {
    "body_html": "I remember the last kicker from A&amp;M named Randy",
    "created_utc": 1759007816.0
  },
  {
    "body_html": "I have no idea how to feel about that first half",
    "created_utc": 1759007831.0
  },
  {
    "body_html": "Mississippi State is making me scared of next week",
    "created_utc": 1759007867.0
  },
  {
    "body_html": "Refs are trying way too hard to make up for the OU game to auburn",
    "created_utc": 1759007394.0
  },
  {
    "body_html": "I'm out of beer",
    "created_utc": 1759005804.0
  },
  {
    "body_html": "Arkansas would beg to differ",
    "created_utc": 1759006127.0
  },
  {
    "body_html": "This game is just screens and holds",
    "created_utc": 1759006242.0
  },
  {
    "body_html": "Thank you texas!",
    "created_utc": 1759006619.0
  },
  {
    "body_html": "Stop with the 3rd down runs please",
    "created_utc": 1759006946.0
  },
  {
    "body_html": "I love that Elko was so quick to admit he made a mistake on the kicker switch.  Jimbo could learn a lesson there.",
    "created_utc": 1759007078.0
  },
  {
    "body_html": "Congrats A&amp;M. A two possession deficit is insurmountable for this Auburn offense",
    "created_utc": 1759007088.0
  },
  {
    "body_html": "A&amp;M playing down to Auburn's level is just common Texas courtesy. Appreciate it.",
    "created_utc": 1759007128.0
  },
  {
    "body_html": "God dude we are so fucking bad lol",
    "created_utc": 1759007209.0
  },
  {
    "body_html": "Guy's it's fine.  Auburn offensive players just love Auburn so much that they're on strike until Hugh is fired, because they know he's an utter embarrassment to the school.  Right??",
    "created_utc": 1759007312.0
  },
  {
    "body_html": "Is Albert Regis just an idiot?",
    "created_utc": 1759007316.0
  },
  {
    "body_html": "That's bullshit.",
    "created_utc": 1759007323.0
  },
  {
    "body_html": "Nice flop my guy",
    "created_utc": 1759007324.0
  },
  {
    "body_html": "What did AU see that they liked from Arnold while he was at OU? He’s terrible.",
    "created_utc": 1759007356.0
  },
  {
    "body_html": "Coleman having to play defense because Arnold is just that damn awful.",
    "created_utc": 1759007386.0
  },
  {
    "body_html": "Someone tell Arnold that he can, in fact, throw it further than 5 yards",
    "created_utc": 1759007404.0
  },
  {
    "body_html": "Pull his stupid dumb ass.",
    "created_utc": 1759007437.0
  },
  {
    "body_html": "Penalties every play are making this unwatchable",
    "created_utc": 1759007441.0
  },
  {
    "body_html": "0-8 on third down",
    "created_utc": 1759007468.0
  },
  {
    "body_html": "Defense has been great",
    "created_utc": 1759007499.0
  },
  {
    "body_html": "This game is unwatchable with all these flags",
    "created_utc": 1759007533.0
  },
  {
    "body_html": "Yellow laundry everywhere",
    "created_utc": 1759007538.0
  },
  {
    "body_html": "The flag is on the other goddamn side of the field how is that affecting the play",
    "created_utc": 1759007544.0
  },
  {
    "body_html": "I’m so tired of penalties",
    "created_utc": 1759007553.0
  },
  {
    "body_html": "So Jackson Arnold <em>was</em> the problem. Sorry for doubting you, 0U bros",
    "created_utc": 1759007560.0
  },
  {
    "body_html": "These refs are such dweebs",
    "created_utc": 1759007586.0
  },
  {
    "body_html": "SEC sent their C team officials to this game",
    "created_utc": 1759007588.0
  },
  {
    "body_html": "Damn, we really need KC out there for this drive.",
    "created_utc": 1759007603.0
  },
  {
    "body_html": "Mother fucker... you can do that... ALL the time",
    "created_utc": 1759007659.0
  },
  {
    "body_html": "When will ESPN hire announcers that don't suck.",
    "created_utc": 1759007662.0
  },
  {
    "body_html": "I don't think it takes a lot of awareness to know where the sideline is",
    "created_utc": 1759007679.0
  },
  {
    "body_html": "That was a great catch.",
    "created_utc": 1759007724.0
  },
  {
    "body_html": "We gotta thank Kirby for spamming TO's in overtime for that rule change",
    "created_utc": 1759007748.0
  },
  {
    "body_html": "“Can he do that”?  Love it lol",
    "created_utc": 1759007752.0
  },
  {
    "body_html": "Klein's best called drive today (asside from the first, but that might be scripted)",
    "created_utc": 1759007781.0
  },
  {
    "body_html": "Big Brian TO by freeze",
    "created_utc": 1759007790.0
  },
  {
    "body_html": "We should be doing nothing but throwing go routes the rest of the season. Either sack or 40 yard gains",
    "created_utc": 1759007813.0
  },
  {
    "body_html": "I don't think Elko is gonna be thrilled",
    "created_utc": 1759007837.0
  },
  {
    "body_html": "Watching this game has been like dragging myself through broken glass",
    "created_utc": 1759007861.0
  },
  {
    "body_html": "So fucking bad",
    "created_utc": 1759007874.0
  },
  {
    "body_html": "Hey Rhett Lashlee, you up?",
    "created_utc": 1759007903.0
  },
  {
    "body_html": "Elko is heated. The jiggle in his cheeks tells the story.",
    "created_utc": 1759007903.0
  },
  {
    "body_html": "Hopefully a good confidence building drive even if we didn’t get the points it was a great efficient drive",
    "created_utc": 1759007970.0
  },
  {
    "body_html": "auburn fans want that flagged because their dumbass CB’s can’t count to 11",
    "created_utc": 1759007149.0
  },
  {
    "body_html": "That guy who flipped castellanos the bird is in trouble?? I mean, he might be a douche, but you shouldn’t get in trouble for being a douchy college kid.",
    "created_utc": 1759007781.0
  },
  {
    "body_html": "Why do you think they named it Texas Hold 'em",
    "created_utc": 1759005762.0
  },
  {
    "body_html": "Cheatin bastards, running out of bounds to stop the clock.",
    "created_utc": 1759007726.0
  },
  {
    "body_html": "Honestly that 40 second drill gave me so much hope. I'm not even mad we missed that fg 😌",
    "created_utc": 1759007916.0
  },
  {
    "body_html": "Still don't get that play - they were 11 on 10 and didn't notice it?",
    "created_utc": 1759007167.0
  },
  {
    "body_html": "<h1>FUCK HUGH FREEZE</h1>",
    "created_utc": 1759007960.0
  },
  {
    "body_html": "I’m so excited to lose this game. Then look halfway decent thru the half against Georgia at home just to lose by 10 points.   These writers are ass and need new material.",
    "created_utc": 1759008047.0
  },
  {
    "body_html": "A&amp;ms front 7 is filthy",
    "created_utc": 1759006193.0
  },
  {
    "body_html": "York has been playing like a man possessed today",
    "created_utc": 1759006238.0
  },
  {
    "body_html": "We need a 3rd down run count this game",
    "created_utc": 1759006246.0
  },
  {
    "body_html": "That run was the white flag going up",
    "created_utc": 1759006277.0
  },
  {
    "body_html": "I really thought this offense would look ready to step up on this game, just finding some consistency.  Instead I’m sitting here seeing this absolutely putrid display.",
    "created_utc": 1759006377.0
  },
  {
    "body_html": "Moss back in 📈📈",
    "created_utc": 1759006491.0
  },
  {
    "body_html": "I hate that I hear the Auburn drum major whistle after the ref whistle every play",
    "created_utc": 1759006623.0
  },
  {
    "body_html": "Whoa, a legit good throw.",
    "created_utc": 1759006636.0
  },
  {
    "body_html": "If I have to hear Jesse talk one more time about Auburn’s 4 DEs or exotic looks on 3rd down I’m gonna puke",
    "created_utc": 1759006638.0
  },
  {
    "body_html": "Glad I didn't waste money to go to this game.",
    "created_utc": 1759006824.0
  },
  {
    "body_html": "How did a handoff to the left end up going in at the right pylon on a 2pt try? Sus commercial",
    "created_utc": 1759006891.0
  },
  {
    "body_html": "The worst part of all of this is that we know the next coach is going to suck too. Even if we get Sumrall he’ll just suddenly forget how to win once he gets here. Wisconsin Fickell is every hire here.",
    "created_utc": 1759006917.0
  },
  {
    "body_html": "Yeah let’s what cheez it has to say",
    "created_utc": 1759006973.0
  },
  {
    "body_html": "once again, klein calls a run play on 3rd and not short",
    "created_utc": 1759006973.0
  },
  {
    "body_html": "There's the best band in all the land   FTAB ON TOP NON STOP",
    "created_utc": 1759006998.0
  },
  {
    "body_html": "Flipping from Bama to Auburn is wild.",
    "created_utc": 1759007201.0
  },
  {
    "body_html": "A&amp;M will take 4 yard cam receptions all day",
    "created_utc": 1759007224.0
  },
  {
    "body_html": "We ran into the kicker   You dumb fuck",
    "created_utc": 1759007277.0
  },
  {
    "body_html": "Wow that’s a bad penalty",
    "created_utc": 1759007306.0
  },
  {
    "body_html": "What a sell by the punter",
    "created_utc": 1759007329.0
  },
  {
    "body_html": "Regis is so mad. Just like when Kelly Ripa would interrupt him.",
    "created_utc": 1759007330.0
  },
  {
    "body_html": "WHY ARE WE THROWING TO OUR SLOW TES?!",
    "created_utc": 1759007342.0
  },
  {
    "body_html": "The neck on Regis, good gracious",
    "created_utc": 1759007355.0
  },
  {
    "body_html": "What are these play calls man. Worst shit I’ve ever seen. No creativity. No over the middle passes. Same 3 or 4 plays",
    "created_utc": 1759007383.0
  },
  {
    "body_html": "With the Christ was Vegas smoking with this game",
    "created_utc": 1759007387.0
  },
  {
    "body_html": "What a shit show. Get that man off the field",
    "created_utc": 1759007414.0
  },
  {
    "body_html": "Send Chaplin back to VT",
    "created_utc": 1759007480.0
  },
  {
    "body_html": "Football? More like flagball",
    "created_utc": 1759007530.0
  },
  {
    "body_html": "Flags everywhere this is annoying af",
    "created_utc": 1759007531.0
  },
  {
    "body_html": "What’s the flag per play ratio today",
    "created_utc": 1759007548.0
  },
  {
    "body_html": "Quazirefo and a thousand flags",
    "created_utc": 1759007550.0
  },
  {
    "body_html": "Flag fest",
    "created_utc": 1759007561.0
  },
  {
    "body_html": "Does this ref have a holding call hit on his parlay he needs to get?",
    "created_utc": 1759007569.0
  },
  {
    "body_html": "holy flag... I am so tired of hearing the word holding.. just knee it into half please",
    "created_utc": 1759007577.0
  },
  {
    "body_html": "This is more holding that we've seen all of last season.",
    "created_utc": 1759007590.0
  },
  {
    "body_html": "Can we just change this to a 7-on-7 game to cut down on holding calls?",
    "created_utc": 1759007594.0
  },
  {
    "body_html": "See this is the offense I expect from the team we have",
    "created_utc": 1759007653.0
  },
  {
    "body_html": "Wait are we allowed to try going into the half?",
    "created_utc": 1759007655.0
  },
  {
    "body_html": "commentator imagining what hed do if someone flipped the bird to him in the shower all night",
    "created_utc": 1759007661.0
  },
  {
    "body_html": "Marcel Reed seems to have gotten smarter over the off-season. Good news for A&amp;M.",
    "created_utc": 1759007699.0
  },
  {
    "body_html": "Reed is fantastic in 2 minute drills idk why they don’t run more tempo",
    "created_utc": 1759007704.0
  },
  {
    "body_html": "This is pathetic",
    "created_utc": 1759007734.0
  },
  {
    "body_html": "Why do our allegedly-exceptional WRs never seem to be open?  Serious question - is it poor route running or poor playcalling?",
    "created_utc": 1759007821.0
  },
  {
    "body_html": "On field  coach interviews are useless",
    "created_utc": 1759007840.0
  },
  {
    "body_html": "Knew as soon as he kicked the timeout field goal he’d miss the second",
    "created_utc": 1759007850.0
  },
  {
    "body_html": "Elko is gonna tear them a new one",
    "created_utc": 1759007865.0
  },
  {
    "body_html": "I’m amazed that Auburn fans continue to have faith in this team. The time for that faith to be gone was years ago. This is a dead program and I don’t know how it becomes a winning one again.",
    "created_utc": 1759008091.0
  },
  {
    "body_html": "That’s the biggest bullshit call I’ve seen in a LONG time",
    "created_utc": 1759007354.0
  },
  {
    "body_html": "THROW THE FUCKING BALL. Fucking moron",
    "created_utc": 1759007466.0
  },
  {
    "body_html": "This just in, Reed knows where the sideline is.",
    "created_utc": 1759007685.0
  },
  {
    "body_html": "Please for the love of God tarmac this man after the game",
    "created_utc": 1759007950.0
  },
  {
    "body_html": "If we lose this game we definitely arent beating Georgia. Hopefully that means we pull the plug on the freeze experiment",
    "created_utc": 1759007971.0
  },
  {
    "body_html": "Not the first time A&amp;M’s gone wide right",
    "created_utc": 1759007800.0
  },
  {
    "body_html": "Questionable cut",
    "created_utc": 1759005792.0
  },
  {
    "body_html": "So Collin Klien <em>isn't</em> K-State's savior? They're in waiting to fire Chris Klieman at this point, from the fan perspective",
    "created_utc": 1759005903.0
  },
  {
    "body_html": "OBVIOUS hold",
    "created_utc": 1759006187.0
  },
  {
    "body_html": "Are you fucking kidding it’s insane how many holding flags they’re throwing",
    "created_utc": 1759006542.0
  },
  {
    "body_html": "hold hold hold hold hold hold hold hold",
    "created_utc": 1759006543.0
  },
  {
    "body_html": "Huh, wonder what that flag is? Couldn't be holding.",
    "created_utc": 1759006557.0
  },
  {
    "body_html": "Fuck my team, fuck your team, fuck the refs, but Concepcion is a beeeast.  Him and Cam Coleman are both fun to watch play.",
    "created_utc": 1759006567.0
  },
  {
    "body_html": "It feels like we’ve had more than 3 holding penalties",
    "created_utc": 1759006582.0
  },
  {
    "body_html": "Niblack my goat",
    "created_utc": 1759006622.0
  },
  {
    "body_html": "Could have fit in another commercial if they didn’t wait for the clock to tick down to 2 minutes",
    "created_utc": 1759006693.0
  },
  {
    "body_html": "During the 2010s we only had one losing season in 2012.   Good chance we make it 5 losing seasons in a row this year",
    "created_utc": 1759006936.0
  },
  {
    "body_html": "Go for it! We get ball at half",
    "created_utc": 1759006966.0
  },
  {
    "body_html": "Why is Daniels in instead of Owens?",
    "created_utc": 1759006966.0
  },
  {
    "body_html": "Playcalling is very bland",
    "created_utc": 1759006968.0
  },
  {
    "body_html": "Maybe cut upfield?",
    "created_utc": 1759007002.0
  },
  {
    "body_html": "Is Bond 37 years old?",
    "created_utc": 1759007004.0
  },
  {
    "body_html": "0 for 6 on third down is because we keep getting 10 yards of penalties and end up 3rd and 11",
    "created_utc": 1759007121.0
  },
  {
    "body_html": "How tf do you not catch that? His body was in front of the ball",
    "created_utc": 1759007179.0
  },
  {
    "body_html": "This team might not make a bowl",
    "created_utc": 1759007241.0
  },
  {
    "body_html": "Dude! I love this playing to the half we are doing this year.",
    "created_utc": 1759007241.0
  },
  {
    "body_html": "I could do with Onyedim back in Ames tonight",
    "created_utc": 1759007249.0
  },
  {
    "body_html": "Arkansas got beat real, real bad",
    "created_utc": 1759007276.0
  },
  {
    "body_html": "Are you fucking kidding me",
    "created_utc": 1759007288.0
  },
  {
    "body_html": "You have got to be fucking kidding me",
    "created_utc": 1759007312.0
  },
  {
    "body_html": "Absolute bullshit",
    "created_utc": 1759007314.0
  },
  {
    "body_html": "Well, I mean Kickers and Punters gotta do that I guess?",
    "created_utc": 1759007329.0
  },
  {
    "body_html": "Don’t worry we can’t move the ball down the field",
    "created_utc": 1759007339.0
  },
  {
    "body_html": "Regis can sit on the bench the rest of the game",
    "created_utc": 1759007345.0
  },
  {
    "body_html": "Horrible call, but man Regis is lazy.",
    "created_utc": 1759007348.0
  },
  {
    "body_html": "Eric was open too",
    "created_utc": 1759007364.0
  },
  {
    "body_html": "One minute before half, throwing passes to the line of scrimmage.",
    "created_utc": 1759007374.0
  },
  {
    "body_html": "Correction it's currently 15.",
    "created_utc": 1759007528.0
  },
  {
    "body_html": "I thought there was about to be some football in my Flag game.",
    "created_utc": 1759007534.0
  },
  {
    "body_html": "What is the flag to play count? Anyone know?",
    "created_utc": 1759007535.0
  },
  {
    "body_html": "watch another holding call",
    "created_utc": 1759007541.0
  },
  {
    "body_html": "please don’t be injured kc",
    "created_utc": 1759007547.0
  },
  {
    "body_html": "This team has a penalty problem.",
    "created_utc": 1759007549.0
  },
  {
    "body_html": "BTHO AUBURN   A!   (I'm not allowed to whoop, but if I could here is where I would whoop!)  ((Someone bestowed honorary zips on me last year but I think that's run out now))",
    "created_utc": 1759007559.0
  },
  {
    "body_html": "Defense has been lights out today. Is part of it down to Auburn shooting themselves in the foot? Sure but I'll take it. It's an improvement from the first 3 games.",
    "created_utc": 1759007560.0
  },
  {
    "body_html": "This crew loves holding calls",
    "created_utc": 1759007564.0
  },
  {
    "body_html": "Most southeastern looking ref for the sec is appropriate I guess",
    "created_utc": 1759007571.0
  },
  {
    "body_html": "Hell will freeze over before our special teams players who are no where near the ball don’t commit a penalty",
    "created_utc": 1759007574.0
  },
  {
    "body_html": "HOLDINGGG",
    "created_utc": 1759007588.0
  },
  {
    "body_html": "You get a holding penalty! You get a holding penalty! Everyone gets a holding penaltyyyyyy!!!!",
    "created_utc": 1759007598.0
  },
  {
    "body_html": "It would be extremely snake bit to go to UT ranked top 10 and ahead of them. Manning will find a way to look like prime Peyton",
    "created_utc": 1759007627.0
  },
  {
    "body_html": "Does Auburn fire Freeze this season?",
    "created_utc": 1759007644.0
  },
  {
    "body_html": "Wasn't even a first down play before",
    "created_utc": 1759007670.0
  },
  {
    "body_html": "pain",
    "created_utc": 1759007718.0
  },
  {
    "body_html": "Hugh Freeze is a terrorist",
    "created_utc": 1759007744.0
  },
  {
    "body_html": "Auburn look done. Been too easy this drive",
    "created_utc": 1759007781.0
  },
  {
    "body_html": "Dammit fat Randy.",
    "created_utc": 1759007802.0
  },
  {
    "body_html": "Hugh Freeze gonna spend halftime trying to figure out who the hell he is going to throw under the bus.",
    "created_utc": 1759007814.0
  },
  {
    "body_html": "Awful",
    "created_utc": 1759007823.0
  },
  {
    "body_html": "“Lined up doing the things we need to do” if you ignore the flags.",
    "created_utc": 1759007864.0
  },
  {
    "body_html": "Elko kinda looks like brandon burlsworth",
    "created_utc": 1759007888.0
  },
  {
    "body_html": "Never a dent",
    "created_utc": 1759007901.0
  },
  {
    "body_html": "G.R.I.N.D  probably stands for something very sophisticated im sure",
    "created_utc": 1759007995.0
  },
  {
    "body_html": "High Freeze is still whining to the refs?? What a bitch.",
    "created_utc": 1759007845.0
  },
  {
    "body_html": "We've scored 40+ in every game so far so prepare for a shootout 2nd half",
    "created_utc": 1759007884.0
  },
  {
    "body_html": "The run was clearly done so the FG would stay in range, that was the opposite of a bad play call my non ball knowers.",
    "created_utc": 1759007039.0
  },
  {
    "body_html": "yo for my sanity I’m so glad this is the middle of day",
    "created_utc": 1759007370.0
  },
  {
    "body_html": "SIT HIS FAT ASS ON THE BENCH AND KEEP HIM THERE",
    "created_utc": 1759007430.0
  },
  {
    "body_html": "Take that Hugh Freeze you dirt bag",
    "created_utc": 1759007452.0
  },
  {
    "body_html": "There is not a path to a 7 win season for Auburn in the next 5 years",
    "created_utc": 1759007862.0
  },
  {
    "body_html": "The lesson from this game is that Oklahoma is terrible and that’s why they didn’t blow us out",
    "created_utc": 1759006369.0
  },
  {
    "body_html": "[ Removed by Reddit ]",
    "created_utc": 1759006818.0
  },
  {
    "body_html": "there were some auburn fans that thought getting arnold was a good thing for their team",
    "created_utc": 1759007612.0
  },
  {
    "body_html": "Longhorn Legend Amari Niblack",
    "created_utc": 1759006639.0
  },
  {
    "body_html": "Grown man reception",
    "created_utc": 1759006731.0
  },
  {
    "body_html": "Hugh Freeze always looks so angry, his lip is perpetually quivering.",
    "created_utc": 1759007189.0
  },
  {
    "body_html": "What a flop",
    "created_utc": 1759007311.0
  },
  {
    "body_html": "Thanks for the practice kick Hugh",
    "created_utc": 1759007758.0
  },
  {
    "body_html": "Oml get the fuck over it",
    "created_utc": 1759007108.0
  },
  {
    "body_html": "Every fucking timr",
    "created_utc": 1759005525.0
  },
  {
    "body_html": "That commercial is a joke.",
    "created_utc": 1759006066.0
  },
  {
    "body_html": "I told myself I would practice peaceful observation today. The kind of watching I do for every other game except A&amp;Ms.  It’s not working out.  One Saturday at a time, I’ll get there.",
    "created_utc": 1759006072.0
  },
  {
    "body_html": "We’re only down 7 in the first half, man. Why are we calling plays like we’re down multiple scores in the 4th?",
    "created_utc": 1759006109.0
  },
  {
    "body_html": "This just isn’t fun.",
    "created_utc": 1759006175.0
  },
  {
    "body_html": "loved that guy in the mummy",
    "created_utc": 1759006242.0
  },
  {
    "body_html": "I said this year was put up or shut up for hugh. He has had 3 years to get his guys in there.  Theres a real chance we go 0-3 in this stretch and thats the worst case scenario.",
    "created_utc": 1759006435.0
  },
  {
    "body_html": "Pain",
    "created_utc": 1759006456.0
  },
  {
    "body_html": "Mmmm yes give me all the holding",
    "created_utc": 1759006536.0
  },
  {
    "body_html": "I know that penalty helped us but I’m so tired of seeing yellow",
    "created_utc": 1759006552.0
  },
  {
    "body_html": "Great play from Marcel",
    "created_utc": 1759006610.0
  },
  {
    "body_html": "How many years has it been where we have a good enough to win it all defense that only needs a pedestrian offense to get 8+ wins",
    "created_utc": 1759006619.0
  },
  {
    "body_html": "Holy shit! We picked it up!",
    "created_utc": 1759006620.0
  },
  {
    "body_html": "Let Marcel get in a rhythm!!!!",
    "created_utc": 1759006640.0
  },
  {
    "body_html": "*Transfer from Texas.",
    "created_utc": 1759006666.0
  },
  {
    "body_html": "Collin wtf",
    "created_utc": 1759006966.0
  },
  {
    "body_html": "the playcalling on both sides of this game has been so fucking bizarre",
    "created_utc": 1759006980.0
  },
  {
    "body_html": "settling for a FG again.. and of course more commercials",
    "created_utc": 1759006985.0
  },
  {
    "body_html": "I want some cheezits",
    "created_utc": 1759006988.0
  },
  {
    "body_html": "Klein is so fucking bad man. The concept of a quick, easy pass is lost on this dude.",
    "created_utc": 1759007021.0
  },
  {
    "body_html": "Auburn didn't even try to block that",
    "created_utc": 1759007035.0
  },
  {
    "body_html": "Bond has been here for ages. Losing him is going to be tragic eventually",
    "created_utc": 1759007114.0
  },
  {
    "body_html": "HUGH GO FOR IT COME ON",
    "created_utc": 1759007204.0
  },
  {
    "body_html": "Thank God we know Freeze is so good halftime adjustments",
    "created_utc": 1759007243.0
  },
  {
    "body_html": "<em>Sigh</em>.   How is it that we never pick up blitzes? Arnold is not better than Payton Thorne.",
    "created_utc": 1759007247.0
  },
  {
    "body_html": "5th 3 and out in a half is not a good look.  Auburn gotta figure their shit out.",
    "created_utc": 1759007301.0
  },
  {
    "body_html": "why is it always regis?",
    "created_utc": 1759007306.0
  },
  {
    "body_html": "ALL YOU HAVE TO DO IS LET THEM PUNT IT AND YOU GET THE BALL  Why are trying to make a hero play?!",
    "created_utc": 1759007311.0
  },
  {
    "body_html": "We just can’t get out our own way",
    "created_utc": 1759007322.0
  },
  {
    "body_html": "We'll three n out and give it back quick.  Thanks for the help tho",
    "created_utc": 1759007324.0
  },
  {
    "body_html": "Oh God",
    "created_utc": 1759007324.0
  },
  {
    "body_html": "I hate when a big man runs into my Kaak",
    "created_utc": 1759007338.0
  },
  {
    "body_html": "Throw it to the slow guy YAS",
    "created_utc": 1759007348.0
  },
  {
    "body_html": "Shouldn’t that be a 5 yard running into the kicker?",
    "created_utc": 1759007363.0
  },
  {
    "body_html": "Goooood tackle York",
    "created_utc": 1759007363.0
  },
  {
    "body_html": "What the fuck are we doing man we can't score points like this",
    "created_utc": 1759007369.0
  },
  {
    "body_html": "17 again lmao",
    "created_utc": 1759007370.0
  },
  {
    "body_html": "There was no ball placement that would make that pass work",
    "created_utc": 1759007378.0
  },
  {
    "body_html": "Acting in porn &gt; punter’s acting",
    "created_utc": 1759007387.0
  },
  {
    "body_html": "Time for a draw up the middle.",
    "created_utc": 1759007391.0
  },
  {
    "body_html": "jackson arnold sounds like a very hard mathematical physics textbook not a starting qb for my alma mater. god.",
    "created_utc": 1759007415.0
  },
  {
    "body_html": "Will probably get a turnover, but not with enough time now to do anything before the half.",
    "created_utc": 1759007428.0
  },
  {
    "body_html": "can we fire players?",
    "created_utc": 1759007530.0
  },
  {
    "body_html": "so many flags. my lord.",
    "created_utc": 1759007538.0
  },
  {
    "body_html": "Jesus... were going to play a good team and get destroyed",
    "created_utc": 1759007543.0
  },
  {
    "body_html": "Oh no not KC",
    "created_utc": 1759007545.0
  },
  {
    "body_html": "Can’t wait for Freeze to be gone. Should be this year at this pace",
    "created_utc": 1759007545.0
  },
  {
    "body_html": "damn it",
    "created_utc": 1759007554.0
  },
  {
    "body_html": "New game, a shot for every flag thrown",
    "created_utc": 1759007567.0
  },
  {
    "body_html": "Could use some more flags. It’s why I tune in.",
    "created_utc": 1759007572.0
  },
  {
    "body_html": "We can beat Mercer and probably? Arkansas. If we can't beat anyone else (and Kentucky looks like the most doable) I bet we are in the carousel end of the season",
    "created_utc": 1759007581.0
  },
  {
    "body_html": "Took a hard right",
    "created_utc": 1759007656.0
  },
  {
    "body_html": "Beautiful pass",
    "created_utc": 1759007684.0
  },
  {
    "body_html": "Beautiful 2 minute drill",
    "created_utc": 1759007697.0
  },
  {
    "body_html": "The Auburn band playing so joyfully is quite funny there icl",
    "created_utc": 1759007847.0
  },
  {
    "body_html": "Hey who this blonde espn baddie talking to Elko",
    "created_utc": 1759007869.0
  },
  {
    "body_html": "Whats the halftime game y'all are throwing on? I have it on LSU-Ole Miss rn",
    "created_utc": 1759007875.0
  },
  {
    "body_html": "Barn fans. Any chance we see AU make a switch at QB?",
    "created_utc": 1759007972.0
  },
  {
    "body_html": "Listening to A&amp;M fans fret over their mental health makes me want to commit a felony",
    "created_utc": 1759007503.0
  },
  {
    "body_html": "What a ridiculously blatant hold",
    "created_utc": 1759006625.0
  },
  {
    "body_html": "It’s hard to judge JA because the receivers don’t create any separation. Routes take too long to develop.   Can definitively say he holds on to the ball too long.",
    "created_utc": 1759007472.0
  },
  {
    "body_html": "He ran backwards OB. Clock suppose to run",
    "created_utc": 1759007677.0
  },
  {
    "body_html": "Welcome to the team who can compete a crosser",
    "created_utc": 1759006688.0
  },
  {
    "body_html": "Just genius playcalling honestly. Can't wait for another half of this shit",
    "created_utc": 1759007395.0
  },
  {
    "body_html": "I like drivin in my truck 🦑",
    "created_utc": 1759007662.0
  },
  {
    "body_html": "Kinda BS they let him kick that",
    "created_utc": 1759007762.0
  },
  {
    "body_html": "Why is OU cheating being mentioned here",
    "created_utc": 1759007108.0
  },
  {
    "body_html": "That’s gotta hurt, gotta hate when your players commit brainless penalties",
    "created_utc": 1759007329.0
  },
  {
    "body_html": "DAE remember auburn fans celebrating Jackson Arnold transferring there?  Wonder what they think now?",
    "created_utc": 1759007657.0
  },
  {
    "body_html": "auburn crying to the refs again",
    "created_utc": 1759007870.0
  },
  {
    "body_html": "Can’t believe the refs held auburn to 105 yards and 0 3rd down conversions. 😔",
    "created_utc": 1759008112.0
  },
  {
    "body_html": "Pull out Regis. Zero discipline",
    "created_utc": 1759007353.0
  },
  {
    "body_html": "I dont wanna see daniels again.  Owens and moss. Thats it",
    "created_utc": 1759006953.0
  },
  {
    "body_html": "GG",
    "created_utc": 1759007723.0
  },
  {
    "body_html": "I mean that wasn’t even close but good lead anyways",
    "created_utc": 1759007843.0
  },
  {
    "body_html": "I am fascinated by the “auburn fan experience”.   I’m not tough enough to live it - yall truly are built different",
    "created_utc": 1759007863.0
  },
  {
    "body_html": "keep your hands off our kaak, aggy",
    "created_utc": 1759007334.0
  },
  {
    "body_html": "LETS GO REFBALL LETS GO CLAP CLAP",
    "created_utc": 1759006180.0
  },
  {
    "body_html": "Okay that one was a PI on us",
    "created_utc": 1759007182.0
  },
  {
    "body_html": "Ball dont lie",
    "created_utc": 1759007862.0
  }
]