[
  {
    "body_html": "Sweet Caroline, Eat Shitt Pitt! 🎵🎵",
    "created_utc": 1759002888.0
  },
  {
    "body_html": "Good times never seemed so good, EAT SHIT! EAT SHIT! EAT SHIT!",
    "created_utc": 1759003003.0
  },
  {
    "body_html": "I'm going to be so pissed off when Pitt beats Miami and Narduzzi gets another fucking extension.",
    "created_utc": 1759002856.0
  },
  {
    "body_html": "Didn’t get to watch the game, someone please give me a rundown of what happened w Holstein.",
    "created_utc": 1759002833.0
  },
  {
    "body_html": "He’s skittish, and cant read a defense fast enough. Threw a back breaker pick at the 2(!) yard line.",
    "created_utc": 1759006502.0
  },
  {
    "body_html": "Lots of ints, but had some beautiful throws",
    "created_utc": 1759002876.0
  },
  {
    "body_html": "So much to work on - offensive line play, overall discipline - but gutsy to hang in when they were down 17-0. Nice win!",
    "created_utc": 1759002768.0
  },
  {
    "body_html": "Man that was a tough one. Glad we pulled it off but we still have a lot to fix with this team. Happy to be 1-0 in the ACC and still undefeated.",
    "created_utc": 1759002536.0
  },
  {
    "body_html": "There goes my 8k",
    "created_utc": 1759002535.0
  },
  {
    "body_html": "Now that's Big East football",
    "created_utc": 1759002518.0
  },
  {
    "body_html": "A talented but one of the mentally weakest quarterbacks in college, and you bench him for a computer generated 64 ovr bronze player",
    "created_utc": 1759002507.0
  },
  {
    "body_html": "My buddy is DVR-ing this game. I’m gonna tell him there was a 2 hour lightning delay.",
    "created_utc": 1759002502.0
  },
  {
    "body_html": "Typical Cardiac Cards experience",
    "created_utc": 1759002483.0
  },
  {
    "body_html": "GG, I'm tired of this team scamming wins, Louisville offense did not deserve to win this one",
    "created_utc": 1759002482.0
  },
  {
    "body_html": "I hate the cardiac cards but we deliver!",
    "created_utc": 1759002479.0
  },
  {
    "body_html": "5 turnovers and only losing by 7 shouldn't be that embarassing",
    "created_utc": 1759002475.0
  },
  {
    "body_html": "God damn, my picks are on fire today  Can't wait to ruin it by picking Washington over OSU",
    "created_utc": 1759002471.0
  },
  {
    "body_html": "so its the refs fault right?!",
    "created_utc": 1759002469.0
  },
  {
    "body_html": "We had a lot of luck but I’d say it was a pretty decent performance as well",
    "created_utc": 1759002461.0
  },
  {
    "body_html": "Game blouses...jesus this game was nerve wracking to begin with.",
    "created_utc": 1759002460.0
  },
  {
    "body_html": "Never in doubt.",
    "created_utc": 1759002456.0
  },
  {
    "body_html": "If Satterfield was coach and we were down 17 we lose by 40 at least. Love the corrections and refusal to quit",
    "created_utc": 1759002451.0
  },
  {
    "body_html": "I think about this a lot. It's so nice to have a team that doesn't give up.",
    "created_utc": 1759002746.0
  },
  {
    "body_html": "TJ HELL YEAH",
    "created_utc": 1759002438.0
  },
  {
    "body_html": "Another brutal loss for Pitt.  who was he even throwing it to",
    "created_utc": 1759002437.0
  },
  {
    "body_html": "Last nail to put on the coffin. Go cards!",
    "created_utc": 1759002432.0
  },
  {
    "body_html": "LETS GOOOOOO PITT HOW DID YOU LOSE TO US",
    "created_utc": 1759002431.0
  },
  {
    "body_html": "And TJ Quinn closes the door. What a second half he had!",
    "created_utc": 1759002425.0
  },
  {
    "body_html": "And a near pick in the first half he just dropped. Dude stepped up when needed",
    "created_utc": 1759002458.0
  },
  {
    "body_html": "I still think we got one more turnover left in us",
    "created_utc": 1759002423.0
  },
  {
    "body_html": "lmao",
    "created_utc": 1759002626.0
  },
  {
    "body_html": "Nailed it",
    "created_utc": 1759002473.0
  },
  {
    "body_html": "Thank yiu",
    "created_utc": 1759002461.0
  },
  {
    "body_html": "Yw",
    "created_utc": 1759002482.0
  },
  {
    "body_html": "Fantastic",
    "created_utc": 1759002411.0
  },
  {
    "body_html": "That almost landed in the Pitt player’s hand fuck",
    "created_utc": 1759002373.0
  },
  {
    "body_html": "Almost landed in their hands, almost was a pick.",
    "created_utc": 1759002412.0
  },
  {
    "body_html": "Hail Mary, full of shit, blessed be Narduzzi",
    "created_utc": 1759002365.0
  },
  {
    "body_html": "In the first half I was fuming about the refs and turnovers, now I’m just completely apathetic seeing how Narduzzi runs this team",
    "created_utc": 1759002362.0
  },
  {
    "body_html": "Time to clench",
    "created_utc": 1759002347.0
  },
  {
    "body_html": "BROHM????!!!!! WHAT THE FUDGE",
    "created_utc": 1759002323.0
  },
  {
    "body_html": "I wanna blame the refs for that punt return since we're gonna lose by 7 but I ultimately can't. Narduzzi is gonna have a fit talking about them all afternoon but you're the one who has a fucking 17 point lead besides that. You can't just give that up....",
    "created_utc": 1759002285.0
  },
  {
    "body_html": "Exactly. The team takes it's cues from him. And when he loses his composure , it's not a surprise when the rest of the team follows suit.   Absolute baby move to encourage the crowd to boo the refs. As if that will get them on your side??",
    "created_utc": 1759002410.0
  },
  {
    "body_html": "Punt makes sense. Takes another 6 seconds or so off the clock",
    "created_utc": 1759002270.0
  },
  {
    "body_html": "yeah, 92 yards with a backup QB and 18 seconds is very unlikely",
    "created_utc": 1759002372.0
  },
  {
    "body_html": "The fuck are you talking about taking a 52-yarder instead of punting to pin deep with 20 seconds left",
    "created_utc": 1759002266.0
  },
  {
    "body_html": "Pitt running the clock down deciding to punt then taking a timeout after running the clock down is just so flippin funny.",
    "created_utc": 1759002258.0
  },
  {
    "body_html": "Nick Keller moment? Nah the punt here makes sense.",
    "created_utc": 1759002249.0
  },
  {
    "body_html": "Nah, get yardage and punt it",
    "created_utc": 1759002286.0
  },
  {
    "body_html": "Only one more game until I get to go to LSU to experience a real college football team",
    "created_utc": 1759002245.0
  },
  {
    "body_html": "Me and my husband are going to Oregon in a few weeks to watch them embarrass the Badgers. And I can't wait!",
    "created_utc": 1759002465.0
  },
  {
    "body_html": "I’m still not completely comfortable yet unless we get this first down.",
    "created_utc": 1759002161.0
  },
  {
    "body_html": "Fuck everyone left already.",
    "created_utc": 1759002030.0
  },
  {
    "body_html": "Why would we even stay honestly",
    "created_utc": 1759002268.0
  },
  {
    "body_html": "I can’t really fucking blame them",
    "created_utc": 1759002067.0
  },
  {
    "body_html": "Hey announcer, stop trying to jinx us",
    "created_utc": 1759002004.0
  },
  {
    "body_html": "Pitt and Stanford gonna be the shitterbowl of the ACC.",
    "created_utc": 1759002001.0
  },
  {
    "body_html": "I can’t believe I’m flying across the country to see that shit dawg I’m gonna claw my eyes out by halftime",
    "created_utc": 1759002153.0
  },
  {
    "body_html": "Please tell me you're flying to California for other reasons and just figured you should go see Pitt while you're out there",
    "created_utc": 1759002339.0
  },
  {
    "body_html": "Nope.",
    "created_utc": 1759002552.0
  },
  {
    "body_html": "Its an awesome trip regardless. You're going to have a blast. Stanford is a beautiful campus and stadium.",
    "created_utc": 1759003177.0
  },
  {
    "body_html": "Yeah I really am looking forward to it whatever happens football-wise. I’ve heard so many good things about the campus and the surrounding area and we’re checking out a Stanford volleyball game while we’re there too so at least we’ll see one watchable product lol",
    "created_utc": 1759005629.0
  },
  {
    "body_html": "You truly are your second flair!",
    "created_utc": 1759002584.0
  },
  {
    "body_html": "If it weren’t for the sickos flair I’d be extremely confused on why you thought that would be a good idea",
    "created_utc": 1759002277.0
  },
  {
    "body_html": "You just love to see it",
    "created_utc": 1759001992.0
  },
  {
    "body_html": "Pitt isn’t winning another game this season. Blow it up",
    "created_utc": 1759001944.0
  },
  {
    "body_html": "I hope we don’t. The sooner we inspire change the better",
    "created_utc": 1759002049.0
  },
  {
    "body_html": "Pitt getting smashed harder than the US in the Ryder cup foursome. I should have just kept watching that",
    "created_utc": 1759001935.0
  },
  {
    "body_html": "Do we even have screen passes or draws in the playbook? Louisville is clearly beating us up front and even this jagoff knows that's how you beat that.",
    "created_utc": 1759001916.0
  },
  {
    "body_html": "Yeah but we call those exclusively on third and long. In fact it is the only thing we call on third and long",
    "created_utc": 1759001983.0
  },
  {
    "body_html": "I drank today away pretty early. In my defense I didn't expect Louisville to start this game in a 17 point hole.",
    "created_utc": 1759001911.0
  },
  {
    "body_html": "I’m on my 5th beer",
    "created_utc": 1759001966.0
  },
  {
    "body_html": "Lightweight",
    "created_utc": 1759002404.0
  },
  {
    "body_html": "I stopped counting, but I was working early and didn't eat, so I'm in trouble",
    "created_utc": 1759002184.0
  },
  {
    "body_html": "Louisville fans were far too pessimistic earlier. They have very clearly not spent enough time watching Pitt. Not that I would recommend it",
    "created_utc": 1759001900.0
  },
  {
    "body_html": "We’re a very pessimistic bunch.",
    "created_utc": 1759001952.0
  },
  {
    "body_html": "To be fair we’re also Louisville fans used to being punched in the dick. We’re naturally drawn to depression and bourbon",
    "created_utc": 1759001951.0
  },
  {
    "body_html": "I mean, we saw last year, so I wouldn't say too pessimistic",
    "created_utc": 1759001942.0
  },
  {
    "body_html": "Ok I just saw this call from Gus Johnson from the Illinois game when they fumbled into the end zone, and this is one of the funnier calls I’ve heard in a bit lol  <a href=\"https://bsky.app/profile/marcusd.bsky.social/post/3lztpnmx3t22r\">https://bsky.app/profile/marcusd.bsky.social/post/3lztpnmx3t22r</a>",
    "created_utc": 1759001899.0
  },
  {
    "body_html": "That’s good",
    "created_utc": 1759002162.0
  },
  {
    "body_html": "Holstein genuinely starts quaking in his boots if a game is even remotely close in the 4th  He needs a therapist or transcendental meditation or something",
    "created_utc": 1759001895.0
  },
  {
    "body_html": "He needs the bench and then portal to a group of 5 team.",
    "created_utc": 1759002211.0
  },
  {
    "body_html": "I like coming back from 17 much more than I like being behind by 17",
    "created_utc": 1759001841.0
  },
  {
    "body_html": "Can we please fire everyone now",
    "created_utc": 1759001827.0
  },
  {
    "body_html": "Outscored Pitt 34-10 after going down 17-0. Still concerned about this team but that’s a great effort to stay in the game",
    "created_utc": 1759001824.0
  },
  {
    "body_html": "Fuck Satterfield team won. Fuck you Kansas! lol",
    "created_utc": 1759001819.0
  },
  {
    "body_html": "They beat Kansas doesn’t mean anything",
    "created_utc": 1759001843.0
  },
  {
    "body_html": "Watson has been a warrior this second half. I am not sure he plays next week but he has come up so big after it looked like he would be gone for multiple weeks with that ankle injury.",
    "created_utc": 1759001818.0
  },
  {
    "body_html": "Can't believe Watson came back and played much better he's a warrior for sure",
    "created_utc": 1759001948.0
  },
  {
    "body_html": "Absolute coward shit. Narduzzi was going to punt. And what's even worse? He let the crowd bully him into going for it. Such a baby and a coward. Fire him yesterday.",
    "created_utc": 1759001807.0
  },
  {
    "body_html": "Narduzzi coming into the third quarter: “wE jUsT GotTa FiNiSh!”  Also Narduzzi: “Let’s just completely implode like we always do”",
    "created_utc": 1759001796.0
  },
  {
    "body_html": "how are we in this!!!",
    "created_utc": 1759001795.0
  },
  {
    "body_html": "Bc narduzzi",
    "created_utc": 1759001995.0
  },
  {
    "body_html": "PUT THAT SHIT ON ICE",
    "created_utc": 1759001787.0
  },
  {
    "body_html": "We boo’d Narduzzi’s punt decision so hard he took it back lmao this dude sucks",
    "created_utc": 1759001784.0
  },
  {
    "body_html": "Watson on one leg getting it done!",
    "created_utc": 1759001777.0
  },
  {
    "body_html": "For an injured guy, he runs pretty well.",
    "created_utc": 1759001777.0
  },
  {
    "body_html": "Come on Louisville, put another 2 scores on so we can fire Narduzzi tomorrow",
    "created_utc": 1759001771.0
  },
  {
    "body_html": "What a team and culture Narduzzi has over there 😂. 2 10+ point leads blown and beating up ball boys.",
    "created_utc": 1759001747.0
  },
  {
    "body_html": "The rightful King of Boo City",
    "created_utc": 1759001878.0
  },
  {
    "body_html": "I forgot about that. Great meme.",
    "created_utc": 1759002170.0
  },
  {
    "body_html": "Never in doubt! Now excuse me while I drink again.",
    "created_utc": 1759001732.0
  },
  {
    "body_html": "Boo clock fixing!",
    "created_utc": 1759001732.0
  },
  {
    "body_html": "Clock management disasterclass from Pitt",
    "created_utc": 1759001731.0
  },
  {
    "body_html": "This game ain’t over yet lol",
    "created_utc": 1759001731.0
  },
  {
    "body_html": "Pat narduzzi has wasted 2 timeouts this quarter to think about shit every person watching is screaming at their tv.",
    "created_utc": 1759001717.0
  },
  {
    "body_html": "That corner blitz was EPIC",
    "created_utc": 1759001710.0
  },
  {
    "body_html": "Yeah that was just never gonna work for the QB. Super overload blitz leaving blind side guy open",
    "created_utc": 1759001693.0
  },
  {
    "body_html": "Four hundred people showing pressure  Pitt - eh, yolo",
    "created_utc": 1759001689.0
  },
  {
    "body_html": "Absolute screamer edge rush",
    "created_utc": 1759001686.0
  },
  {
    "body_html": "I genuinely think I’m cancelling my season tickets. Without WVU on the schedule there is simply no financial justification for keeping them at this point. I’ll be able to get second hand tickets to every game for cheaper if I genuinely ever feel like blowing an entire Saturday on this fraudulent team",
    "created_utc": 1759001680.0
  },
  {
    "body_html": "There's no point. I got tickets on the 50 in the lower bowl for $15. Even if there's one or two high profile game a year, you still don't break even.",
    "created_utc": 1759002108.0
  },
  {
    "body_html": "My fiancée talked me out of season tickets this season and I’m VERY glad she did",
    "created_utc": 1759001780.0
  },
  {
    "body_html": "we don’t even have a night game on the schedule this year!!",
    "created_utc": 1759001711.0
  },
  {
    "body_html": "Well you don’t know that yet. All the game times after next week are TBD.",
    "created_utc": 1759001876.0
  },
  {
    "body_html": "We don’t even deserve one",
    "created_utc": 1759001783.0
  },
  {
    "body_html": "Narduzzi shouldn’t have a job on Monday. The brawl and then this? Yeah bro you’re done.",
    "created_utc": 1759001678.0
  },
  {
    "body_html": "And last seasons collapse. I still think he'll have a job, but this is bad.",
    "created_utc": 1759001882.0
  },
  {
    "body_html": "How are you this unprepared for a game off a bye week?",
    "created_utc": 1759001676.0
  },
  {
    "body_html": "Caught the pitt coach locking in with a zyn",
    "created_utc": 1759001673.0
  },
  {
    "body_html": "Replying to TwoHeadedBoyTwo...supporting the boys down in Owensboro I see",
    "created_utc": 1759001871.0
  },
  {
    "body_html": "I can't believe we may win this game",
    "created_utc": 1759001672.0
  },
  {
    "body_html": "When is narduzzi getting fired",
    "created_utc": 1759001668.0
  },
  {
    "body_html": "Fucking tomorrow hopefully, but prolly in about 10 years after Pitt football has been thoroughly run into the ground as a perennial 3-9 team",
    "created_utc": 1759001832.0
  },
  {
    "body_html": "Hopefully yesterday",
    "created_utc": 1759001759.0
  },
  {
    "body_html": "Do we have a 3rd QB we can start next week?",
    "created_utc": 1759001663.0
  },
  {
    "body_html": "Yes. He’s actually probably the best of the three, but a true freshman.",
    "created_utc": 1759001788.0
  },
  {
    "body_html": "This stupid fucking game",
    "created_utc": 1759001662.0
  },
  {
    "body_html": "Worst of both worlds now, what a terrible sequence of plays",
    "created_utc": 1759001659.0
  },
  {
    "body_html": "Kansas-Cincy, USC-Illinois, Georgia Tech-Wake Forest, and Louisville-Pitt all coming down to the wire at the exact same time!",
    "created_utc": 1759001659.0
  },
  {
    "body_html": "I don’t necessarily dislike benching Eli, but that’s a hell of a situation to throw your backup into",
    "created_utc": 1759001659.0
  },
  {
    "body_html": "Just reallllllly bad coaching there",
    "created_utc": 1759001657.0
  },
  {
    "body_html": "Narduzzi using a timeout and then punting would be classic  Narduzzi",
    "created_utc": 1759001654.0
  },
  {
    "body_html": "LETS GOOO",
    "created_utc": 1759001653.0
  },
  {
    "body_html": "What is this game man man. I don’t care if we lose anymore  Fuck it, go hard at them boys. Play random. Salute",
    "created_utc": 1759001649.0
  },
  {
    "body_html": "TJ Quinn coming alive in the second half!",
    "created_utc": 1759001648.0
  },
  {
    "body_html": "Oh baby",
    "created_utc": 1759001648.0
  },
  {
    "body_html": "He got lit up lmao",
    "created_utc": 1759001638.0
  },
  {
    "body_html": "You can't punt here. You don't have any guarantee to get the ball back if you",
    "created_utc": 1759001628.0
  },
  {
    "body_html": "Narduzzi game management at its finest. Go for it on a random 4th and 7 at midfield when you have the lead, waste a timeout debating to punt on 4th and 7 when you are down in the late fourth quarter and haven’t been able to stop them the entire quarter.",
    "created_utc": 1759001623.0
  },
  {
    "body_html": "Jeff Brohm needs to throw Narduzzi a couple bands if we win this game. Absolutely awful management",
    "created_utc": 1759001621.0
  },
  {
    "body_html": "This game is just the classic Narduzzi experience.",
    "created_utc": 1759001615.0
  },
  {
    "body_html": "Narduzzi will keep Pitt in purgatory forever I’m afraid",
    "created_utc": 1759001611.0
  },
  {
    "body_html": "going for it up 7 and punting down 7 is quite logical",
    "created_utc": 1759001610.0
  },
  {
    "body_html": "Fire him. Now",
    "created_utc": 1759001607.0
  },
  {
    "body_html": "Punting now? Narduzzi is such a bitch",
    "created_utc": 1759001601.0
  },
  {
    "body_html": "what are we even doing here pat",
    "created_utc": 1759001597.0
  },
  {
    "body_html": "A Narduzzi masterclass in game management",
    "created_utc": 1759001596.0
  },
  {
    "body_html": "Did they really just take a timeout to save 5 yards on 4th &amp; 7 when they're punting??  Going to have to go for it now.  Edit: and they ran the clock down first",
    "created_utc": 1759001595.0
  },
  {
    "body_html": "…. Wat  A timeout  How do you not have the decision on what to do ready in this scenario",
    "created_utc": 1759001595.0
  },
  {
    "body_html": "I think it would almost piss me off more if we ended up winning throwing in a cold backup late in the 4th because that means we’ve been putting up with Holstein’s fuckery on purpose.",
    "created_utc": 1759001592.0
  },
  {
    "body_html": "What an awful showing",
    "created_utc": 1759001588.0
  },
  {
    "body_html": "Absolute disaster",
    "created_utc": 1759001585.0
  },
  {
    "body_html": "Narduzzi is a fuckin dumbass   Go for it on 4th and 7 with a qb that you don’t trust   Doesn’t know if he wants to go for it and burns another timeout",
    "created_utc": 1759001585.0
  },
  {
    "body_html": "I just want to get out here with a win and never see Pitt again for a long time.",
    "created_utc": 1759001583.0
  },
  {
    "body_html": "Same",
    "created_utc": 1759001754.0
  },
  {
    "body_html": "Narduzzi cannot be fucking serious punting on <em>this</em> 4th and 7.   And another wasted time out.",
    "created_utc": 1759001578.0
  },
  {
    "body_html": "TO usage still very suss",
    "created_utc": 1759001575.0
  },
  {
    "body_html": "What the fuck was that? I’m offended on behalf of Pitt fans at this point.",
    "created_utc": 1759001575.0
  },
  {
    "body_html": "Could definitely see that timeout go towards a better usage there.",
    "created_utc": 1759001570.0
  },
  {
    "body_html": "I see you’re not familiar with Pittsburgh football",
    "created_utc": 1759001596.0
  },
  {
    "body_html": "I am so sorry Pitt. That is atrocious coaching",
    "created_utc": 1759001567.0
  },
  {
    "body_html": "Coming off a bye week and a rivalry loss with terrible coaching the week before. Brutal",
    "created_utc": 1759001616.0
  },
  {
    "body_html": "Just so undisciplined week in and week out every season",
    "created_utc": 1759001563.0
  },
  {
    "body_html": "This coaching staff is cooked. I hope Greene cleans house",
    "created_utc": 1759001556.0
  },
  {
    "body_html": "Terrible waste of a timeout",
    "created_utc": 1759001553.0
  },
  {
    "body_html": "Insane time out wtf",
    "created_utc": 1759001551.0
  },
  {
    "body_html": "Man I miss first 5 weeks 2024 Kade Bell",
    "created_utc": 1759001548.0
  },
  {
    "body_html": "WTF was that playcall?   The whole \"pick up yards to go for it on 4th\" is so dumb.",
    "created_utc": 1759001543.0
  },
  {
    "body_html": "I cant believe they are punting",
    "created_utc": 1759001540.0
  },
  {
    "body_html": "This sequence alone is fireable",
    "created_utc": 1759001538.0
  },
  {
    "body_html": "Narduzzi has a body of fireable work, but here he is. Always talking shit with nothing to show for it",
    "created_utc": 1759001601.0
  },
  {
    "body_html": "They have to go for it. A punt is super high on the surrender index here.",
    "created_utc": 1759001535.0
  },
  {
    "body_html": "Now 4th &amp; 7 is too long for you?",
    "created_utc": 1759001528.0
  },
  {
    "body_html": "Cowards. Fire Narduzzi",
    "created_utc": 1759001516.0
  },
  {
    "body_html": "I wish Holstein was still in",
    "created_utc": 1759001434.0
  },
  {
    "body_html": "Quite a catch",
    "created_utc": 1759001429.0
  },
  {
    "body_html": "Pitt playing the backup QB trap card",
    "created_utc": 1759001424.0
  },
  {
    "body_html": "All of a sudden we can't tackle at all",
    "created_utc": 1759001373.0
  },
  {
    "body_html": "Holstein couldn’t play with a 17 point lead and a 10 Point lead   Hopefully this is permanent",
    "created_utc": 1759001369.0
  },
  {
    "body_html": "Average Louisville v pitt game",
    "created_utc": 1759001363.0
  },
  {
    "body_html": "Sucks that it takes 4 guys to tackle on person.",
    "created_utc": 1759001357.0
  },
  {
    "body_html": "Holstein deserved it",
    "created_utc": 1759001337.0
  },
  {
    "body_html": "Saw some obvious holds with Louisville on offense but they gonna call that",
    "created_utc": 1759001314.0
  },
  {
    "body_html": "Louisville has over 50 yards more of penalties. Don’t wanna hear it.",
    "created_utc": 1759001368.0
  },
  {
    "body_html": "“They have more penalty yards so don’t call The penalties” ok",
    "created_utc": 1759001397.0
  },
  {
    "body_html": "That’s not at all what they were saying and you know it. Geez",
    "created_utc": 1759001454.0
  },
  {
    "body_html": "Thats not at all what he said and you know it",
    "created_utc": 1759001440.0
  },
  {
    "body_html": "Great minds think alike!",
    "created_utc": 1759001503.0
  },
  {
    "body_html": "That skinny ref saves us again!",
    "created_utc": 1759001290.0
  },
  {
    "body_html": "Dude is a Minecraft skeleton cosplaying as a ref",
    "created_utc": 1759001360.0
  },
  {
    "body_html": "Moss has still had some bad moments but he's actually settled in kinda nicely after those first 2 or 3 drives of the game",
    "created_utc": 1759001285.0
  },
  {
    "body_html": "Wtf was that fighting with the ball boy? Lmao",
    "created_utc": 1758991503.0
  },
  {
    "body_html": "What are they doing to the ball boy lol",
    "created_utc": 1758991515.0
  },
  {
    "body_html": "This skinny, pale ref is our best player lmao",
    "created_utc": 1758993903.0
  },
  {
    "body_html": "This thread has turned into both fan bases complaining about their respective team and it feels justified in both cases.",
    "created_utc": 1758994943.0
  },
  {
    "body_html": "What the fuck was that, there was clearly a false star OR offsides, something happened there",
    "created_utc": 1758992464.0
  },
  {
    "body_html": "Wow that was an awful call",
    "created_utc": 1758993856.0
  },
  {
    "body_html": "[deleted]",
    "created_utc": 1758993196.0
  },
  {
    "body_html": "Pitt Fans; can i just say.  This yellow and blue is a million times better than the other yellow and dark blue",
    "created_utc": 1758993688.0
  },
  {
    "body_html": "what in the world are these refs looking at???",
    "created_utc": 1758993862.0
  },
  {
    "body_html": "I sure do love playing in the acc",
    "created_utc": 1758993867.0
  },
  {
    "body_html": "Down year for Clemson? Better make sure we aren’t able to take advantage",
    "created_utc": 1758995184.0
  },
  {
    "body_html": "Like there was a light shove to block the guy into the returner, but I feel like with how convoluted the whole situation was that shoulda been like a replay with inadvertent whistle or something.",
    "created_utc": 1758992615.0
  },
  {
    "body_html": "Thats not even CLOSE to PI. Clean af coverage. Pitt got screwed on that one.",
    "created_utc": 1758993882.0
  },
  {
    "body_html": "“The more Moss can scramble the better it’ll be”  No it won’t, not at all. He’s not an improv thrower at all.",
    "created_utc": 1758990652.0
  },
  {
    "body_html": "That’s not PI at all.",
    "created_utc": 1758993849.0
  },
  {
    "body_html": "Pitt coach justifiably crashing out there",
    "created_utc": 1758992399.0
  },
  {
    "body_html": "“Somehow, someway back in this”  That some way is a little help from Charlotte.",
    "created_utc": 1758992658.0
  },
  {
    "body_html": "The rare occasion that Louisville actually gets a bad call gifted to them and we still barely score, almost have another delay of game, still can’t block, and got an unsportsmanlike called after the play. Maybe the single least satisfying Louisville touchdown I’ve ever had the misfortune of watching.",
    "created_utc": 1758992709.0
  },
  {
    "body_html": "This sucks. Bring the volleyball teams out and have them play instead.",
    "created_utc": 1758999726.0
  },
  {
    "body_html": "I’m fine with the no kick catch interference call. But am I going insane? Johnson wasn’t the first to touch it",
    "created_utc": 1758992595.0
  },
  {
    "body_html": "Call me a homer but these refs are deadass giving Louisville a chance. This is so blatant",
    "created_utc": 1758993836.0
  },
  {
    "body_html": "I dont think ive ever watched a game where we've had this many helpful calls. Usually it's the other way around",
    "created_utc": 1758993838.0
  },
  {
    "body_html": "Usually Im all for just hating on the cards for the sake of hating on them. But Pitt, if you want to riot and burn that skinny ref at the stake for this game, I 100% support you.  The phantom DPI and questionable blocked into kick/catch have my full support",
    "created_utc": 1758994095.0
  },
  {
    "body_html": "That is a horrible call lmao",
    "created_utc": 1758999530.0
  },
  {
    "body_html": "Feels like Pitt has scored all of our points and we’ve scored all of Pitt’s points",
    "created_utc": 1759000469.0
  },
  {
    "body_html": "Why are we going so fast right now. Are we trying to give Louisville more time on offense?",
    "created_utc": 1758994922.0
  },
  {
    "body_html": "I was double charged for my beer at the concession stand and their solution was to just give me a second beer instead of a refund. Wasn’t my original plan but honestly the way this game is going I’m not too mad about it",
    "created_utc": 1758997133.0
  },
  {
    "body_html": "0-7 on 3rd down is so fucking terrible",
    "created_utc": 1758998073.0
  },
  {
    "body_html": "“There have been some challenges for this Louisville offensive line”  Understatement, thy name is this sentence",
    "created_utc": 1758990699.0
  },
  {
    "body_html": "Crazy how we’re getting political ads this far out from the Midterms",
    "created_utc": 1758990820.0
  },
  {
    "body_html": "Wtf was that fight with the ball boy lmao",
    "created_utc": 1758991494.0
  },
  {
    "body_html": "I’d rather watch Jack Plummer for the rest of my life than one more snap of Miller Moss",
    "created_utc": 1758991534.0
  },
  {
    "body_html": "Why is that linebacker full on assaulting that sideline guy?",
    "created_utc": 1758991565.0
  },
  {
    "body_html": "If you're going to commit a unsportsmanlike, might as well commit it directly after a touchdown since it's just enforced on the kickoff",
    "created_utc": 1758992737.0
  },
  {
    "body_html": "It benefited my team but it drives me crazy when I see a QB pass up on running for an easy 1st down to throw an awful pass.",
    "created_utc": 1758993123.0
  },
  {
    "body_html": "Refs at it again lol",
    "created_utc": 1758993816.0
  },
  {
    "body_html": "Defending a pass is interference I guess",
    "created_utc": 1758993845.0
  },
  {
    "body_html": "How are we tied? Crazy.",
    "created_utc": 1759000432.0
  },
  {
    "body_html": "There it is. Good game. Hopefully Mason gets to play now bc Holstein lost whatever he had",
    "created_utc": 1759000742.0
  },
  {
    "body_html": "Refs are gonna lose control of this game real fast",
    "created_utc": 1758992622.0
  },
  {
    "body_html": "Get this fucking bum off the field",
    "created_utc": 1758991491.0
  },
  {
    "body_html": "What were they doing to that poor ball boy.",
    "created_utc": 1758991499.0
  },
  {
    "body_html": "Of course Pitt loses to fucking WVU and then plays like this their next game",
    "created_utc": 1758991582.0
  },
  {
    "body_html": "I really respect Moss’ determination to throw a pick.",
    "created_utc": 1758991588.0
  },
  {
    "body_html": "Starting to think we should've left Miller Moss in Southern Cal",
    "created_utc": 1758991609.0
  },
  {
    "body_html": "False start and holding lmao",
    "created_utc": 1758992476.0
  },
  {
    "body_html": "These fucking referees",
    "created_utc": 1758993836.0
  },
  {
    "body_html": "Lmao",
    "created_utc": 1758993848.0
  },
  {
    "body_html": "I’ll take responsibility for this one.   Had some UK fans over. As soon as they left Louisville scored to make it 17-7, now 17-17.",
    "created_utc": 1758994484.0
  },
  {
    "body_html": "Game should come out of halftime at 2:19pm ET. The following Power 4 games are in progress &amp; not at halftime:  UCF @ Kansas State (FS1)  Cincinnati @ Kansas (TNT)  Utah State @ Vanderbilt (SECN)  Rutgers @ Minnesota (BTN)  Duke @ Syracuse (ACCN)",
    "created_utc": 1758995979.0
  },
  {
    "body_html": "This is just one of those games where both fanbases are angrier going out than going in.",
    "created_utc": 1758998745.0
  },
  {
    "body_html": "Pittsburgh stupidity is the only reason why this game is close",
    "created_utc": 1759000317.0
  },
  {
    "body_html": "That’s why you punt instead of going for it on 4th and fuckin 7",
    "created_utc": 1759000404.0
  },
  {
    "body_html": "No idea why Pitt went for it",
    "created_utc": 1759000436.0
  },
  {
    "body_html": "Nothing like completely flipping the momentum of the game with an awful call",
    "created_utc": 1758992675.0
  },
  {
    "body_html": "I just got a freaking ICE ad….  I want to die.",
    "created_utc": 1758997743.0
  },
  {
    "body_html": "Oh no…. We’re getting local political ads again.  Uuuuugh.",
    "created_utc": 1758990845.0
  },
  {
    "body_html": "Ok, this is on Miller Moss, he's missed two passes and didn't recognize the play clock WTF dude  I submit this and then he throws a pick 6. I don't give a shit who comes in but bring in someone else.",
    "created_utc": 1758991481.0
  },
  {
    "body_html": "Has moss been trying to throw an interception?",
    "created_utc": 1758991503.0
  },
  {
    "body_html": "Take him out of the fucking game. Good lord",
    "created_utc": 1758991503.0
  },
  {
    "body_html": "Why are we so undiscipline?",
    "created_utc": 1758992766.0
  },
  {
    "body_html": "Ref it’s not too late to make it our ball on their 18",
    "created_utc": 1758993054.0
  },
  {
    "body_html": "Dude…",
    "created_utc": 1758993829.0
  },
  {
    "body_html": "Why the hell didn’t you run it? You would have 1st down after the 2 min now you’re 3rd and 1. God this team will do anything but play smart football.",
    "created_utc": 1758994907.0
  },
  {
    "body_html": "Oh we can call false starts in the red zone now?",
    "created_utc": 1758995174.0
  },
  {
    "body_html": "Man I’d rather him just slide down and force the timeout lol",
    "created_utc": 1758995503.0
  },
  {
    "body_html": "This is the angriest I’ve been at a 10 point lead going into half",
    "created_utc": 1758995817.0
  },
  {
    "body_html": "Pitt how have you had multiple false starts on extra points.",
    "created_utc": 1758995837.0
  },
  {
    "body_html": "Keller is a weapon! Somehow completely turned that miserable drive into points.",
    "created_utc": 1758997668.0
  },
  {
    "body_html": "That was all on Moss. Way too high on that throw.",
    "created_utc": 1758998529.0
  },
  {
    "body_html": "This might be the most infuriating coached game I have ever witnessed",
    "created_utc": 1758998589.0
  },
  {
    "body_html": "This entire game has been just sickos personified",
    "created_utc": 1758999889.0
  },
  {
    "body_html": "Holstein doing the Klovis speedrun enjoy sexless Mormonville next year Eli",
    "created_utc": 1759000817.0
  },
  {
    "body_html": "Holstein has straight up threw Pittsburgh into the deep end with cement shoes with his play in the second half. His play and coaching is the reason why they’ll lose today",
    "created_utc": 1759000821.0
  },
  {
    "body_html": "winning 27-20 with the ball on Louisville's 5 yard line.   <ol> <li>Holstein interception</li> <li>Failed 4th down conversion when there was no reason to go for it</li> <li>Another Holstein interception</li> </ol>",
    "created_utc": 1759000948.0
  },
  {
    "body_html": "I appreciate ESPN2 letting the Make-A-Wish kids run their audio department",
    "created_utc": 1758999624.0
  },
  {
    "body_html": "This is a trap game for UofL every season.  I've seen Pitt shatter our dreams. 2023, 2020, 2015 etc.  In Issac Brown we trust.   Let's go!!!! #L1C4",
    "created_utc": 1758985838.0
  },
  {
    "body_html": "Yeah, this gonna be a beat down. We are ass on the offensive line. The defense looks shaky against this up tempo too",
    "created_utc": 1758990089.0
  },
  {
    "body_html": "Of course it's the guy who played at UL last year.",
    "created_utc": 1758990369.0
  },
  {
    "body_html": "Amazing DB play from Bell and then amazing WR play",
    "created_utc": 1758991329.0
  },
  {
    "body_html": "Moss might be the worst qb I’ve ever seen on a team of consistent espn2 caliber",
    "created_utc": 1758991531.0
  },
  {
    "body_html": "23rd most expensive roster in FBS, and we are getting bodied by decidedly average Pitt team.   I guess that 98-2017 run was just a 20 year flash in the pan.   Why did I choose to love this team but only mildly enjoy OSU?",
    "created_utc": 1758991673.0
  },
  {
    "body_html": "52 min first quarter. Bro….",
    "created_utc": 1758991926.0
  },
  {
    "body_html": "What the actual fuck",
    "created_utc": 1758992346.0
  },
  {
    "body_html": "Okay uh enjoy the free points that's some bullshit",
    "created_utc": 1758992367.0
  },
  {
    "body_html": "What an absolute gift of a call that can only come from ACC officials.",
    "created_utc": 1758992434.0
  },
  {
    "body_html": "Fuck the ACC man",
    "created_utc": 1758992547.0
  },
  {
    "body_html": "Dude just fucking run. You had the first!",
    "created_utc": 1758993010.0
  },
  {
    "body_html": "What the heck was that throw from Holstein, he had a clear path for the first and going out of bounds, and yet threw an awkward sidearm into the ground",
    "created_utc": 1758993068.0
  },
  {
    "body_html": "Bro had a first down if he just tucked it tf?",
    "created_utc": 1758993075.0
  },
  {
    "body_html": "Worst Louisville O line since Dave Ragone played here.",
    "created_utc": 1758993160.0
  },
  {
    "body_html": "Miami is going to crush us into powder then sell us through a cartel",
    "created_utc": 1758993290.0
  },
  {
    "body_html": "And the Refs make their play for the win.",
    "created_utc": 1758993834.0
  },
  {
    "body_html": "Second time they’ve cut away and then forgot to turn the announcer audio back on.",
    "created_utc": 1758994275.0
  },
  {
    "body_html": "Oh fuck me",
    "created_utc": 1758994395.0
  },
  {
    "body_html": "STOP THE STUPID LATE PENALTIES DINGUSES",
    "created_utc": 1758994625.0
  },
  {
    "body_html": "And now the play clock operators is messing up. This is everyone’s A game",
    "created_utc": 1758995161.0
  },
  {
    "body_html": "“Self inflicted wounds have been a major issue”  This is a true statement for both teams.",
    "created_utc": 1758995333.0
  },
  {
    "body_html": "Why throw it on 3rd and 2? Just run. If you dont get it the clock keeps running",
    "created_utc": 1758995523.0
  },
  {
    "body_html": "That no kick catch interference call was malarkey. Bro was not pushed",
    "created_utc": 1758995682.0
  },
  {
    "body_html": "Genuinely awful way to end the half. Totally botched all our momentum.",
    "created_utc": 1758995793.0
  },
  {
    "body_html": "Tie it up and then hand over 10 straight points to head to half. God I hate this team sometimes.",
    "created_utc": 1758995821.0
  },
  {
    "body_html": "2 hour half  False start on Pitt when Louisville has 12 men on the field  Welcome back, ACC!",
    "created_utc": 1758996906.0
  },
  {
    "body_html": "\"Fuck you cock suckers. You guys suck.\" My lip reading isn't the best, but im pretty sure I nailed that one.",
    "created_utc": 1758999153.0
  },
  {
    "body_html": "Oh god. Don’t get my hopes up.",
    "created_utc": 1759000414.0
  },
  {
    "body_html": "Pittsburgh blew it against West Virginia. Pittsburgh blew a 17 point lead today   What’s the common problem in both games?   Bad fucking coaching",
    "created_utc": 1759000744.0
  },
  {
    "body_html": "This will be a long game",
    "created_utc": 1758989985.0
  },
  {
    "body_html": "Brohm wanting to build a roster on a budget or something. Come on dude, give Deuce a chance with his legs if Moss can't throw.",
    "created_utc": 1758990744.0
  },
  {
    "body_html": "Not ideal",
    "created_utc": 1758990861.0
  },
  {
    "body_html": "Never change espn",
    "created_utc": 1758990993.0
  },
  {
    "body_html": "Please keep the techno music and mute the commentary",
    "created_utc": 1758991021.0
  },
  {
    "body_html": "Let's give Deuce a chance",
    "created_utc": 1758991502.0
  },
  {
    "body_html": "I don’t know if I will ever see a Louisville win at Pitt in my lifetime",
    "created_utc": 1758991502.0
  },
  {
    "body_html": "You can’t convince Moss isn’t trying to throw an interception",
    "created_utc": 1758991540.0
  },
  {
    "body_html": "That's why Miller Moss was benched at USC. All that talk in the offseason how he was going to be good for us.",
    "created_utc": 1758991589.0
  },
  {
    "body_html": "If only they didn’t play like absolute cheeks at WVU…",
    "created_utc": 1758991613.0
  },
  {
    "body_html": "Brohm is a good coach overall but the lack of discipline and his terrible eye for QBs is gonna hold us back for years if he doesn’t get it together",
    "created_utc": 1758991640.0
  },
  {
    "body_html": "We got into a bidding war with Mizzou for Miller Moss…..  They got Beau Pribula because of it….. who currently has 962 yards and 8 TDs and 2 picks and 150 and 3 TDs on the ground….",
    "created_utc": 1758991731.0
  },
  {
    "body_html": "Moss ain't him.  You've got Egan, Mimms, and Allen you're developing on the bench. Just try one",
    "created_utc": 1758991907.0
  },
  {
    "body_html": "Yeah the ACC should be apologizing for this tomorrow",
    "created_utc": 1758992333.0
  },
  {
    "body_html": "What the shit?",
    "created_utc": 1758992343.0
  },
  {
    "body_html": "Pitt are genuinely the multiverse Steelers man",
    "created_utc": 1758992404.0
  },
  {
    "body_html": "no hold?",
    "created_utc": 1758992424.0
  },
  {
    "body_html": "The punt call, I have no idea, but how was that not a false start or disconcerting signals. The Olineman was pointing and waiving his hand as the snap happened... It has to be some penalty.",
    "created_utc": 1758992553.0
  },
  {
    "body_html": "Put the backup qb in what kinda dumb shit is this",
    "created_utc": 1758992669.0
  },
  {
    "body_html": "Miller Moss looks like a young Rand Paul",
    "created_utc": 1758993092.0
  },
  {
    "body_html": "Watson is going to be out multiple weeks it looks like. That’s a tough break.",
    "created_utc": 1758993727.0
  },
  {
    "body_html": "The production quality is almost as bad as the game",
    "created_utc": 1758994282.0
  },
  {
    "body_html": "Experience Pitt football",
    "created_utc": 1758994395.0
  },
  {
    "body_html": "Tie game. Ffs",
    "created_utc": 1758994405.0
  },
  {
    "body_html": "Yelling at the top of your lungs at individual people on the field when you’re sitting 50 rows back should make you eligible for institutionalization",
    "created_utc": 1758994906.0
  },
  {
    "body_html": "That touchdown is on the Louisville OC. Idiotic to throw it on 3rd and 2 with just over a minute left in the half. Stopped the clock and gave them time to move down the field.",
    "created_utc": 1758995820.0
  },
  {
    "body_html": "This game got a real espn 2 quality to it",
    "created_utc": 1758995898.0
  },
  {
    "body_html": "“An entertaining and exciting first half”  Sure…. That’s what you can call it I guess….",
    "created_utc": 1758996019.0
  },
  {
    "body_html": "So giving up 17-0 leads is just in vogue this season then?",
    "created_utc": 1758996185.0
  },
  {
    "body_html": "This team does not spark joy.",
    "created_utc": 1758996310.0
  },
  {
    "body_html": "I really want to know just what happened in the bye week that left basically our entire RB room hurt. Seriously, we already can’t run the ball and now of our top 4 RBs, 2 were out, 1 went out during this game, and our top is very clearly banged up still and has nowhere near the explosiveness he normally has.  Our only next guys up are a true freshman walk on and a redshirt freshman converted WR this offseason.",
    "created_utc": 1758996488.0
  },
  {
    "body_html": "God just go back to showing clips for an ad, ACC",
    "created_utc": 1758996745.0
  },
  {
    "body_html": "I maintain Watson should not be out there.",
    "created_utc": 1758998445.0
  },
  {
    "body_html": "Moss just is not an accurate passer",
    "created_utc": 1758998565.0
  },
  {
    "body_html": "Moss is killing us man",
    "created_utc": 1758998588.0
  },
  {
    "body_html": "This game has been a long one",
    "created_utc": 1758998991.0
  },
  {
    "body_html": "This game has taken 3 hours for 3 quarters….  We still have a whole ass quarter to go.",
    "created_utc": 1758999767.0
  },
  {
    "body_html": "This is an absolutely horrific game of football. I would love it if I wasn’t so emotionally invested",
    "created_utc": 1758999842.0
  },
  {
    "body_html": "Nobody does more damage to Pitt than Pitt",
    "created_utc": 1759000179.0
  },
  {
    "body_html": "How has the more injured Duke Watson had more touches in the second half than the less injured Isaac Brown?",
    "created_utc": 1759000353.0
  },
  {
    "body_html": "That had disaster written all over it until it didn’t.",
    "created_utc": 1759000393.0
  },
  {
    "body_html": "Hard hitting analysis by Sam Acho. Lacy with a brilliant football play by… not committing a penalty. Though I suppose given how we’ve played…",
    "created_utc": 1759000456.0
  },
  {
    "body_html": "Just tuned in. Why go for 4th &amp; 7? When you’re winning? When does that ever make sense",
    "created_utc": 1759000466.0
  },
  {
    "body_html": "Daniel Jones is the only thing keeping me sane",
    "created_utc": 1759000903.0
  },
  {
    "body_html": "It gets to a point where you genuinely have to ask if season tickets are a good investment of your time and money",
    "created_utc": 1759000970.0
  },
  {
    "body_html": "Lol I think it’s time to retire being a Pitt fan. These guys aren’t worth 3 hours every Saturday",
    "created_utc": 1759000998.0
  },
  {
    "body_html": "Holstein bout to throw another pic",
    "created_utc": 1759001000.0
  },
  {
    "body_html": "Still a lot of time let.  Anything can happen.",
    "created_utc": 1759001067.0
  },
  {
    "body_html": "He got benched",
    "created_utc": 1759001280.0
  },
  {
    "body_html": "The refs suck, that should be Pitt ball",
    "created_utc": 1758992364.0
  },
  {
    "body_html": "I’m so livid",
    "created_utc": 1758992619.0
  },
  {
    "body_html": "Refs you have the opportunity to do the funniest thing ever right now",
    "created_utc": 1758993172.0
  },
  {
    "body_html": "Extremely lucky on that, the LB got jammed on the crossing route and left him wide open.  That’s one of the times where not having an All ACC level LB like Stanquan hurts the most. He just has greater instinctive play on situations like that",
    "created_utc": 1758989474.0
  },
  {
    "body_html": "Replay? What happened…",
    "created_utc": 1758989782.0
  },
  {
    "body_html": "Do we have a defense?",
    "created_utc": 1758989984.0
  },
  {
    "body_html": "Yeah this’ll be a long year",
    "created_utc": 1758989998.0
  },
  {
    "body_html": "I mean that was great D, just an insane catch",
    "created_utc": 1758990120.0
  },
  {
    "body_html": "And we’re a basketball school again",
    "created_utc": 1758990699.0
  },
  {
    "body_html": "Wish they’d turn the music off so we can hear the game.",
    "created_utc": 1758990994.0
  },
  {
    "body_html": "We’re stuck on the loading screen music",
    "created_utc": 1758990996.0
  },
  {
    "body_html": "For whatever reason this place seems to be our inescapable house of voodoo. I would like to be able to watch this game without blood pressure medication though, so can we skip all that bs just this once?",
    "created_utc": 1758991353.0
  },
  {
    "body_html": "Bench Moss this guy is trash",
    "created_utc": 1758991405.0
  },
  {
    "body_html": "Can we uhhh bench this guy?",
    "created_utc": 1758991493.0
  },
  {
    "body_html": "I hate it here",
    "created_utc": 1758991509.0
  },
  {
    "body_html": "Miller Moss is fucking terrible",
    "created_utc": 1758991528.0
  },
  {
    "body_html": "In the midst of “it’s so over”…",
    "created_utc": 1758991528.0
  },
  {
    "body_html": "NO WE ARE NOT STARTING TO MOVE THE FOOTBALL  WE DID THIS TWO TIMES BEFORE AND AS SOON AS WE CROSSED MIDFIELD WE CRAPPED THE BED",
    "created_utc": 1758991967.0
  },
  {
    "body_html": "what the actual FUCK???",
    "created_utc": 1758992378.0
  },
  {
    "body_html": "AL RIVERON IS IN THE EPSTEIN FILES",
    "created_utc": 1758992383.0
  },
  {
    "body_html": "Did the refs not blow the whistle after he ran into Kenny?",
    "created_utc": 1758992447.0
  },
  {
    "body_html": "My goodness can't even score without a stupid penalty.",
    "created_utc": 1758992808.0
  },
  {
    "body_html": "Why’d he throw that?",
    "created_utc": 1758993058.0
  },
  {
    "body_html": "“There’s been a few positive run plays”  There’s been one…. For 8 yards",
    "created_utc": 1758993943.0
  },
  {
    "body_html": "Good lord you have to catch that",
    "created_utc": 1758993954.0
  },
  {
    "body_html": "That was essentially a FG concession play with Brown not 100%",
    "created_utc": 1758994009.0
  },
  {
    "body_html": "“There must be a challenger to Miami with the FSU loss last night” -ACC marketing team to the ref’s this morning",
    "created_utc": 1758994185.0
  },
  {
    "body_html": "This whole game is just odd.",
    "created_utc": 1758994277.0
  },
  {
    "body_html": "Okay yep we’re back. WVU game was definitely the real Pitt lol",
    "created_utc": 1758994389.0
  },
  {
    "body_html": "No. No do not rank us even if we win. We do not deserve it.",
    "created_utc": 1758994552.0
  },
  {
    "body_html": "Call this game a Christmas party, because these two teams are exchanging gifts",
    "created_utc": 1758994599.0
  },
  {
    "body_html": "How was that flag so late? That was a super obvious horse collar on us",
    "created_utc": 1758994684.0
  },
  {
    "body_html": "It’d be cool if hadn’t given them 30 free yards in a dumb post play penalty and a really stupid horse collar tackle.",
    "created_utc": 1758995098.0
  },
  {
    "body_html": "They ruled that play took 8 seconds?",
    "created_utc": 1758995143.0
  },
  {
    "body_html": "This may be the most undisciplined team in the Narduzzi era. The number of penalties this season have been unacceptable",
    "created_utc": 1758995465.0
  },
  {
    "body_html": "Pitt gets it's head out of its ass for two minutes and scores 10 points",
    "created_utc": 1758995742.0
  },
  {
    "body_html": "Can we have a full field view of that? I want to see if it was the CB or S that failed the coverage.",
    "created_utc": 1758995902.0
  },
  {
    "body_html": "Isn't brown banged up? Why give him a meaningless carry there",
    "created_utc": 1758995992.0
  },
  {
    "body_html": "“Duke Watson will not return”  Duke Watson out there the very next play.",
    "created_utc": 1758997461.0
  },
  {
    "body_html": "Sure, let's waste a timeout, too",
    "created_utc": 1758997539.0
  },
  {
    "body_html": "Insane kicking range from Keller.",
    "created_utc": 1758997652.0
  },
  {
    "body_html": "Damn. I thought it was short. Dont think ive ever seen a fg hit the support AFTER being good.  That squeaked in",
    "created_utc": 1758997689.0
  },
  {
    "body_html": "Wide open and you throw it away...",
    "created_utc": 1758998533.0
  },
  {
    "body_html": "Brohm is turning into a Nick Keller merchant. You can’t always rely on hitting bombs.",
    "created_utc": 1758998606.0
  },
  {
    "body_html": "every fucking week this guy with the red zone turnovers",
    "created_utc": 1758999403.0
  },
  {
    "body_html": "Brohm is being absolutely out coached right now.",
    "created_utc": 1758999466.0
  },
  {
    "body_html": "Sick and tired of the penalties every week. Louisville is so undisciplined",
    "created_utc": 1758999529.0
  },
  {
    "body_html": "This game is so frustrating to watch.",
    "created_utc": 1758999579.0
  },
  {
    "body_html": "Everything about this game is ass. We’re gonna get murdered by UVA.",
    "created_utc": 1758999764.0
  },
  {
    "body_html": "Painful to watch.  And some of yall didn't think cal would fit right in",
    "created_utc": 1758999798.0
  },
  {
    "body_html": "lol. lmao, even",
    "created_utc": 1759000116.0
  },
  {
    "body_html": "The Nardawg special",
    "created_utc": 1759000206.0
  },
  {
    "body_html": "I’m gonna paint the underside of the 500 level",
    "created_utc": 1759000257.0
  },
  {
    "body_html": "Great call!!",
    "created_utc": 1759000409.0
  },
  {
    "body_html": "Come on Defense.",
    "created_utc": 1759000551.0
  },
  {
    "body_html": "Biles has had a killer game at LB for Pitt",
    "created_utc": 1759000880.0
  },
  {
    "body_html": "I’m so fucking tired of this shit Pat.",
    "created_utc": 1759000964.0
  },
  {
    "body_html": "Kurisky! What a grab!",
    "created_utc": 1759000968.0
  },
  {
    "body_html": "I was certain that was about to be a pick. Phew.",
    "created_utc": 1759000976.0
  },
  {
    "body_html": "For as much as we’ve all been shitting on Moss, he’s thrown 3 touchdowns today with next to zero running game to help him",
    "created_utc": 1759001041.0
  },
  {
    "body_html": "Hard to believe I yearn for a 7-5 season, Pitt football has broken me",
    "created_utc": 1759001247.0
  },
  {
    "body_html": "Fuck this shithole conference",
    "created_utc": 1758992331.0
  },
  {
    "body_html": "Nice to see the ACC Foundation doing charity work for college athletes in Louisville",
    "created_utc": 1758992625.0
  },
  {
    "body_html": "That might be the most convoluted fucking I’ve ever seen and I’ve been to TJ",
    "created_utc": 1758992481.0
  },
  {
    "body_html": "I’m here, and I’m not sure I’ve ever been more angry about a call. That whole sequence is inexcusable from the refs",
    "created_utc": 1758992762.0
  },
  {
    "body_html": "God hates Pittsburgh",
    "created_utc": 1758992803.0
  },
  {
    "body_html": "If our secondary isn’t any good, this is the game where it’ll really get picked apart. This is by far the best QB and receivers Louisville has played this year.",
    "created_utc": 1758987263.0
  },
  {
    "body_html": "If Holstein throws a pick here I’m committing",
    "created_utc": 1758989307.0
  },
  {
    "body_html": "dodged a bullet there, Defense better get there act together of  could be a ugly game.",
    "created_utc": 1758989442.0
  },
  {
    "body_html": "This should just be running into, but also they said if it was roughing it would be a first down, but would it be? Is roughing an auto first down, I forget",
    "created_utc": 1758989902.0
  },
  {
    "body_html": "I can all but guarantee that Brohm would throw hands with Moss if allowed",
    "created_utc": 1758989999.0
  },
  {
    "body_html": "Holy shit what a snag",
    "created_utc": 1758990013.0
  },
  {
    "body_html": "Woulda been nice to keep a guy like Hicks here, wouldn’t it have…..",
    "created_utc": 1758990049.0
  },
  {
    "body_html": "Bell was being strangled there but okay",
    "created_utc": 1758990728.0
  },
  {
    "body_html": "Louisville: poor predictable pitt probably gonna blitz again   Narduzzi: Good ole Blitz, nothing beats Blitz",
    "created_utc": 1758990892.0
  },
  {
    "body_html": "What the hell is going with this stream?",
    "created_utc": 1758990995.0
  },
  {
    "body_html": "I know Monroe Mills tore his ACL so is out for the year but holy cow how much better would this OL have been if we just had kept him and Austin Collins still….",
    "created_utc": 1758991278.0
  },
  {
    "body_html": "Better to be lucky than good sometimes.",
    "created_utc": 1758991294.0
  },
  {
    "body_html": "And there it is. Moss has been throwing interceptable balls all game. He was due.",
    "created_utc": 1758991465.0
  },
  {
    "body_html": "And our OL is so bad so all Pitt needs to do is just keep blitzing…. We can’t run, Moss is channeling Sam Darnold and is seeing ghosts…..",
    "created_utc": 1758991811.0
  },
  {
    "body_html": "Oof ouch, just a not great plant trying to pass rush…. That’s not fun at all",
    "created_utc": 1758991913.0
  },
  {
    "body_html": "Lol excuse me????",
    "created_utc": 1758992335.0
  },
  {
    "body_html": "Wait what",
    "created_utc": 1758992349.0
  },
  {
    "body_html": "We’re not even going to score",
    "created_utc": 1758992449.0
  },
  {
    "body_html": "Can’t even get a TD without doing something stupid on the OL  Want to remind people that our OL last year had 3-4 potential returning starters.  We have 1 playing. 2 of them left in portal, 1 of them left the portal in the Fall. Both of them left for ACC teams. 1 is coming back from injury but was also the one most likely to be replaced, but the rest was patchwork portal and people coming back from injury.  We could have had a set LT and reliable guard. And instead our OL outside our center is absolute trash.",
    "created_utc": 1758992803.0
  },
  {
    "body_html": "Kade bell hates seeing the offense on the field",
    "created_utc": 1758993041.0
  },
  {
    "body_html": "I think he probably could have scrambled there and got the first down. Maybe we would have caught him from behind but I don’t think he needed to throw there.",
    "created_utc": 1758993067.0
  },
  {
    "body_html": "I know we have an elite RB and not great QB, but we might just need to go full spread quick hitting offense, our OL is just that bad",
    "created_utc": 1758993480.0
  },
  {
    "body_html": "And Duke is hurt again. We have literally two healthy RBs now who have had carries… and it was the walk on who looked good last week in garbage time at least and the converted WR  Isaac is definitely not explosive and hurting still.   We’re going to need to just go full Big 12",
    "created_utc": 1758993691.0
  },
  {
    "body_html": "WE ARE NOT TAKING SHOTS FURTHER DOWN THE FIELD  WE CANNOT BLOCK",
    "created_utc": 1758993814.0
  },
  {
    "body_html": "We can’t catch anything",
    "created_utc": 1758993947.0
  },
  {
    "body_html": "Leave the announcers muted plz",
    "created_utc": 1758994326.0
  },
  {
    "body_html": "This whole game is just plain odd.",
    "created_utc": 1758994403.0
  },
  {
    "body_html": "For fuck sake. Make em spend a whole practice doing up downs if that’s what it takes but this lack of discipline is embarrassing.",
    "created_utc": 1758994638.0
  },
  {
    "body_html": "Jeff Brohm teams never have any discipline.",
    "created_utc": 1758994649.0
  },
  {
    "body_html": "Come on. That’s just ridiculous. On what planet would you decide to do that",
    "created_utc": 1758994688.0
  },
  {
    "body_html": "It is abundantly clear that Duzz doesn't care about time of possession because otherwise our offense would take a tad longer to go 3 and out",
    "created_utc": 1758994771.0
  },
  {
    "body_html": "How many batted balls is that? 3-4? Is that something the cards have done well so far this season?",
    "created_utc": 1758994891.0
  },
  {
    "body_html": "Why run it out there? Take the touch back to save clock, right?",
    "created_utc": 1758995325.0
  },
  {
    "body_html": "Ya know OL…. Generally you have to block someone on a screen for at least a second to set up",
    "created_utc": 1758995383.0
  },
  {
    "body_html": "Odds Louisville gets another possession this half set at -250",
    "created_utc": 1758995538.0
  },
  {
    "body_html": "Why can't we sack the qb?",
    "created_utc": 1758995616.0
  },
  {
    "body_html": "It’s amazing how cathartic a well executed play like that is  Edit: I meant the first pass but I’ll take the TD",
    "created_utc": 1758995683.0
  },
  {
    "body_html": "Absolutely pathetic.",
    "created_utc": 1758995729.0
  },
  {
    "body_html": "Okay well I’ll take that. Blown coverage if I’ve ever seen it",
    "created_utc": 1758995755.0
  },
  {
    "body_html": "Hell yeah",
    "created_utc": 1758995755.0
  },
  {
    "body_html": "NO. NO LET THIS HALF BE OVER. SHUT UP ANNOUNCERS",
    "created_utc": 1758995928.0
  },
  {
    "body_html": "How is it only halftime? I feel like a whole season of weirdness just happened.  I feel both lucky to be winning and unlucky we’re not winning by more so a normal Pitt game I guess",
    "created_utc": 1758995969.0
  },
  {
    "body_html": "You could kneel there you could throw a deep ball could do a lot of things I’m not sure that is one of them",
    "created_utc": 1758996058.0
  },
  {
    "body_html": "Really good use of a time out there guys",
    "created_utc": 1758997535.0
  },
  {
    "body_html": "What a boot on Keller",
    "created_utc": 1758997694.0
  },
  {
    "body_html": "3rd down is Pitts nightmare",
    "created_utc": 1758997996.0
  },
  {
    "body_html": "We finally got a sack!",
    "created_utc": 1758998015.0
  },
  {
    "body_html": "We ran the ball!",
    "created_utc": 1758998323.0
  },
  {
    "body_html": "Louisville most likely pulls away in the 4th. Our defense won’t have any gas left bc our offense isn’t consistent enough to keep the pressure on. We can’t even convert a 3rd down for christs sake",
    "created_utc": 1758998448.0
  },
  {
    "body_html": "Gotta hand it to USC, they know when they have subpar QBs, and they are not afraid to let them leave. Max Browne vibes.",
    "created_utc": 1758998677.0
  },
  {
    "body_html": "Our OLine is ass but Miller Moss is not him.",
    "created_utc": 1758998733.0
  },
  {
    "body_html": "I can't believe Syracuse is losing so bad at home to Duke after winning on the road at Clemson?",
    "created_utc": 1758998857.0
  },
  {
    "body_html": "That's an italian man if i've ever seen one",
    "created_utc": 1758999132.0
  },
  {
    "body_html": "If I know anything about Pitt football it’s that we’re walking away from this with 3 points - if we’re lucky  Edit: shoot me in the head",
    "created_utc": 1758999162.0
  },
  {
    "body_html": "Holstein fucking sucks",
    "created_utc": 1758999287.0
  },
  {
    "body_html": "Issac brown is a really good runner when healthy but dude cannot pass pro",
    "created_utc": 1758999495.0
  },
  {
    "body_html": "WHAT",
    "created_utc": 1758999518.0
  },
  {
    "body_html": "Lmao what a call",
    "created_utc": 1758999520.0
  },
  {
    "body_html": "Oh joy time to watch this offense fucking suck again",
    "created_utc": 1758999565.0
  },
  {
    "body_html": "The studio update with music so loud you can’t hear the guy hahaha. Someone behind the scenes hit the wrong button.",
    "created_utc": 1758999676.0
  },
  {
    "body_html": "This game is taking allll day",
    "created_utc": 1758999689.0
  },
  {
    "body_html": "We have no business still being in this game.",
    "created_utc": 1759000042.0
  },
  {
    "body_html": "Pitt not having a 3rd down conversion and winning is kinda crazy",
    "created_utc": 1759000090.0
  },
  {
    "body_html": "I hate that I’m breathing a sigh of relief when we convert instead of being excited.",
    "created_utc": 1759000294.0
  },
  {
    "body_html": "I’ve seen enough, put in Mason",
    "created_utc": 1759000786.0
  },
  {
    "body_html": "holstein = booty",
    "created_utc": 1759000798.0
  },
  {
    "body_html": "Can't go wrong throwing at Bell",
    "created_utc": 1759000884.0
  },
  {
    "body_html": "There it is",
    "created_utc": 1759000967.0
  },
  {
    "body_html": "I would be absolutely stunned if Pitt won another game this season. Maybe a nail butter against Stanford, but that's it. They're horrible and horribly coached. We can only pray this is the year our record is bad enough to pay Narduzzi his buyout",
    "created_utc": 1759001090.0
  },
  {
    "body_html": "I never said anything bad about Miller Moss. Please don’t check my post history!",
    "created_utc": 1759001241.0
  },
  {
    "body_html": "I mean he did get pushed, but that wasn't enough to warrant this call.",
    "created_utc": 1758992426.0
  },
  {
    "body_html": "Im ready to go in if you need a fat middle aged guy to get this yard.",
    "created_utc": 1758993643.0
  },
  {
    "body_html": "Trying desperately to get Louisville to cover",
    "created_utc": 1758993839.0
  },
  {
    "body_html": "lmfao did the acc call into this game to tell them they need more teams to make a playoff case?  Someone ding these refs with a can of iron city",
    "created_utc": 1758993893.0
  },
  {
    "body_html": "That was a terrible false start call. No one moved.",
    "created_utc": 1758999551.0
  },
  {
    "body_html": "Are they going to explain either of the unsportsmanlike penalties against us?",
    "created_utc": 1758992667.0
  },
  {
    "body_html": "Needs to be three scores on the board today. Pitt-17 Louisville-0 Refs-7.",
    "created_utc": 1758992708.0
  },
  {
    "body_html": "Louisville really needs the refs to keep them in this",
    "created_utc": 1758993878.0
  },
  {
    "body_html": "Omg go fuck yourselv",
    "created_utc": 1758993819.0
  },
  {
    "body_html": "Wow that is just another huge break for us. Just a total unforced error.",
    "created_utc": 1758994415.0
  },
  {
    "body_html": "We looked completely dead in the water after the first quarter and we got some big breaks and were able to take advantage. Unbelievable we managed to tie this game.",
    "created_utc": 1758994483.0
  },
  {
    "body_html": "WHAT IS THE FALSE START",
    "created_utc": 1758999538.0
  },
  {
    "body_html": "ACC refs strike again",
    "created_utc": 1758999549.0
  },
  {
    "body_html": "Last time we saw this Pitt team play they looked like absolute garbage and lost a rivalry game. Now they’ve had 2 weeks to pick their asses off the mat. So it’s now or never to prove we aren’t a disaster this year. No pressure, fellas.",
    "created_utc": 1758986384.0
  },
  {
    "body_html": "Apparently this is the game of banged up RB rooms, looking at the injury report.",
    "created_utc": 1758988565.0
  },
  {
    "body_html": "Is I Brown and D Watson playing today? I know K Brown is out.",
    "created_utc": 1758988656.0
  },
  {
    "body_html": "Bring forth the misery!",
    "created_utc": 1758989117.0
  },
  {
    "body_html": "That’s probably the 4th time this has happened this season where we have to take a timeout to get the play right when there’s plenty of time",
    "created_utc": 1758989311.0
  },
  {
    "body_html": "Bro.",
    "created_utc": 1758989380.0
  },
  {
    "body_html": "Here we go again with this shit. 6 points on a silver platter and Pitt fucks it up lol",
    "created_utc": 1758989455.0
  },
  {
    "body_html": "Out of the Furnace was a good movie and I feel like this is the only place on the internet where people would still remember it",
    "created_utc": 1758989590.0
  },
  {
    "body_html": "I have no offensive line and I must run",
    "created_utc": 1758989739.0
  },
  {
    "body_html": "YOU'RE MY BOY BLUE",
    "created_utc": 1758990016.0
  },
  {
    "body_html": "Wild catch! Hot start for Pitt.",
    "created_utc": 1758990152.0
  },
  {
    "body_html": "Is the camera quality bad for everyone else?",
    "created_utc": 1758990815.0
  },
  {
    "body_html": "C'mon dude, catch that",
    "created_utc": 1758991042.0
  },
  {
    "body_html": "Cmon Quinn, I know you’re a linebacker so don’t have hands but that’s the easiest you’re ever going to get",
    "created_utc": 1758991064.0
  },
  {
    "body_html": "Well, I'm never tossing my baby to that guy!",
    "created_utc": 1758991093.0
  },
  {
    "body_html": "Has anyone found the button where I can mute these commentators?",
    "created_utc": 1758991116.0
  },
  {
    "body_html": "Sweet lord that was almost an interception",
    "created_utc": 1758991327.0
  },
  {
    "body_html": "Wrap it up this one is over.",
    "created_utc": 1758991465.0
  },
  {
    "body_html": "Correction: Miller Moss is absolute ass.",
    "created_utc": 1758991471.0
  },
  {
    "body_html": "Pitt always got our number",
    "created_utc": 1758991473.0
  },
  {
    "body_html": "Brohm doesn't have the balls to go with our mobile QB and wreck this whole game plan for Pitt",
    "created_utc": 1758991557.0
  },
  {
    "body_html": "How was there no commentary on the ball boy scuffle?",
    "created_utc": 1758991750.0
  },
  {
    "body_html": "God damnit. Can our DEs stop getting hurt. We're so thin there and this doesn't look good.",
    "created_utc": 1758991881.0
  },
  {
    "body_html": "SAVED SAVED SAVED",
    "created_utc": 1758992375.0
  },
  {
    "body_html": "I'm actually shocked at that flag being overturned still",
    "created_utc": 1758992454.0
  },
  {
    "body_html": "This is a great game if you have no emotional investment in either team",
    "created_utc": 1758992786.0
  },
  {
    "body_html": "Can we please try and of the 2nd OL at any spot but Center? They cannot be worse than this.   Especially at Guard.",
    "created_utc": 1758993293.0
  },
  {
    "body_html": "That looks like he's gone for the rest of the season.",
    "created_utc": 1758993722.0
  },
  {
    "body_html": "For all the hype he gets, Bell sure feels like he drops an annoying amount of balls.",
    "created_utc": 1758993959.0
  },
  {
    "body_html": "Back to the bumper music",
    "created_utc": 1758994252.0
  },
  {
    "body_html": "Lmao again with the studio update cant switch audio back! Twice in 1 game.  Espn with their D tier crew",
    "created_utc": 1758994286.0
  },
  {
    "body_html": "Alright, now to start drinking",
    "created_utc": 1758994389.0
  },
  {
    "body_html": "LMAO i havent seen that in non rain in a while",
    "created_utc": 1758994407.0
  },
  {
    "body_html": "Let's go!",
    "created_utc": 1758994472.0
  },
  {
    "body_html": "We’ve been gifted by the <del>football gods</del> ACC officiating crew.",
    "created_utc": 1758994500.0
  },
  {
    "body_html": "It’s so Pitt it hurts",
    "created_utc": 1758994501.0
  },
  {
    "body_html": "Don’t let this turn of events distract you from the fact GT is down 14-3 to WF",
    "created_utc": 1758994587.0
  },
  {
    "body_html": "We are just not a serious football team",
    "created_utc": 1758994601.0
  },
  {
    "body_html": "This game has been brought to you by the concept of the White Elephant",
    "created_utc": 1758994700.0
  },
  {
    "body_html": "Running a play before the two minute warning so Louisville has as much time as possible to score before half",
    "created_utc": 1758994887.0
  },
  {
    "body_html": "And that was very nearly another deflected pick from Holstein.",
    "created_utc": 1758994887.0
  },
  {
    "body_html": "This team fucking sucks, man.",
    "created_utc": 1758995165.0
  },
  {
    "body_html": "I know he doesn’t ever do it unless it’s absolutely necessary but man, Moss sometimes you just need to run forward and try and steal a yard or two",
    "created_utc": 1758995558.0
  },
  {
    "body_html": "Yeesh. GT down 14 to Wake at half.",
    "created_utc": 1758995562.0
  },
  {
    "body_html": "LETS GOOOOOOOO",
    "created_utc": 1758995731.0
  },
  {
    "body_html": "How was he THAT wide open with the safety on that side too. 2 guys both stopped coverage?",
    "created_utc": 1758995762.0
  },
  {
    "body_html": "Could’ve managed that drive on offense more than one way to make that not happen",
    "created_utc": 1758995810.0
  },
  {
    "body_html": "OMfnG how was he so open?  After all that come back and we are going to be down by 10 at the half.",
    "created_utc": 1758995836.0
  },
  {
    "body_html": "Being a fan of this team is like being a fan of weekly trips to the orthodontist",
    "created_utc": 1758995946.0
  },
  {
    "body_html": "I need people to meet me on campus Monday morning.  We gotta find two dudes to be RB while everyone heals up.",
    "created_utc": 1758997385.0
  },
  {
    "body_html": "Man a really early wasted timeout.",
    "created_utc": 1758997550.0
  },
  {
    "body_html": "How were we not ready for the FG? Just blew a time out for zero reason.",
    "created_utc": 1758997559.0
  },
  {
    "body_html": "Feel like we’ll probably want that TO back.",
    "created_utc": 1758997612.0
  },
  {
    "body_html": "Gotta be close to a stadium record. +/- 2 yards at most",
    "created_utc": 1758997615.0
  },
  {
    "body_html": "BANNGGGGGGG",
    "created_utc": 1758997642.0
  },
  {
    "body_html": "Wrong #0 there Miller.",
    "created_utc": 1758998252.0
  },
  {
    "body_html": "Overthrows it to asia cool cool",
    "created_utc": 1758998572.0
  },
  {
    "body_html": "Well that magic went out. I knew he was going to finally miss one.",
    "created_utc": 1758998601.0
  },
  {
    "body_html": "Can we at least try Deuce out, please? Our OL doesn’t block anyway so might as well get the guy whose best attribute right now is trying to do a Mahomes impression and moving around and improvising.",
    "created_utc": 1758998803.0
  },
  {
    "body_html": "ACC is in pure chaos mode",
    "created_utc": 1758998832.0
  },
  {
    "body_html": "Oooow ow that’s not good. His leg got caught under him and with the defender making the tackle sliding into him",
    "created_utc": 1758998896.0
  },
  {
    "body_html": "How you get beat THAT bad",
    "created_utc": 1758999175.0
  },
  {
    "body_html": "Getting smoked by a former player is fun",
    "created_utc": 1758999189.0
  },
  {
    "body_html": "WOW!!!",
    "created_utc": 1758999203.0
  },
  {
    "body_html": "That one's been cooking for a while",
    "created_utc": 1758999204.0
  },
  {
    "body_html": "Lol these QBs are hilariously inconsistent",
    "created_utc": 1758999229.0
  },
  {
    "body_html": "Holstein just does some baffling shit",
    "created_utc": 1758999241.0
  },
  {
    "body_html": "We need a goal line quarterback",
    "created_utc": 1758999281.0
  },
  {
    "body_html": "Sick grab, Louisville!",
    "created_utc": 1758999292.0
  },
  {
    "body_html": "Holstein screws us over in the redzone every single time.",
    "created_utc": 1758999345.0
  },
  {
    "body_html": "So does no one want to win this game?",
    "created_utc": 1758999372.0
  },
  {
    "body_html": "What the fuck is this game",
    "created_utc": 1758999515.0
  },
  {
    "body_html": "I’m not going to blame Isaac for that, he’s banged up and already a smaller back.  Just put a damn FB in for pass pro at this rate. Please,",
    "created_utc": 1758999518.0
  },
  {
    "body_html": "Can we just do that every time?",
    "created_utc": 1759000278.0
  },
  {
    "body_html": "WHY DONT YOU BLITZ YOU IMBECILE",
    "created_utc": 1759000304.0
  },
  {
    "body_html": "Hell yeah!!!",
    "created_utc": 1759000304.0
  },
  {
    "body_html": "Dropped catch on the first drive cost us 4 points, dropped catch on fourth down there cost us at least 3, dropped punt gave them an easy 7, it’s just unforced errors really",
    "created_utc": 1759000309.0
  },
  {
    "body_html": "That was a nifty play.",
    "created_utc": 1759000392.0
  },
  {
    "body_html": "“Waves to the Pittsburgh fans” wait, we still have fans?",
    "created_utc": 1759000455.0
  },
  {
    "body_html": "Let's gooooo",
    "created_utc": 1759000466.0
  },
  {
    "body_html": "17 and 10 point leads in this game and couldn’t hold on to either lol I’m done with Bell and Holstein.",
    "created_utc": 1759000595.0
  },
  {
    "body_html": "Yup warm up the Pitt buses",
    "created_utc": 1759000717.0
  },
  {
    "body_html": "Alright man",
    "created_utc": 1759000743.0
  },
  {
    "body_html": "Ayyyy! TJ makes up for the dropped pick from earlier",
    "created_utc": 1759000772.0
  },
  {
    "body_html": "We might not win another game this season",
    "created_utc": 1759000775.0
  },
  {
    "body_html": "I don’t know if they can draw common sense for Holstein on the iPad",
    "created_utc": 1759000851.0
  },
  {
    "body_html": "That’s like the 6th 2nd and long they’ve given up in the half. The defense ain’t working",
    "created_utc": 1759000929.0
  },
  {
    "body_html": "It’s Miller time baby!",
    "created_utc": 1759000966.0
  },
  {
    "body_html": "3 17 unanswered point runs this game.",
    "created_utc": 1759001040.0
  },
  {
    "body_html": "One score game and feels like Pitt down 21. Absolutely useless in 2H and Holstein just throwing dumb ints",
    "created_utc": 1759001130.0
  },
  {
    "body_html": "A free 7 points, courtesy of the ACC. This conference is a fucking joke",
    "created_utc": 1758992639.0
  },
  {
    "body_html": "those damn refs making the punter drop the ball",
    "created_utc": 1758994453.0
  },
  {
    "body_html": "Don’t know why Pitt fans would be worried. Our offense is dead before it even gets going.",
    "created_utc": 1758999594.0
  },
  {
    "body_html": "Why is every game we play at Pitt always so freaking weird.",
    "created_utc": 1758992937.0
  },
  {
    "body_html": "Don’t worry Pitt, our undisciplined play will eventually even out the ref ball",
    "created_utc": 1758995033.0
  },
  {
    "body_html": "Why call a timeout that late lol?",
    "created_utc": 1758995420.0
  },
  {
    "body_html": "Dude wtf is Pitt doing?",
    "created_utc": 1758995425.0
  },
  {
    "body_html": "Where's the false start?",
    "created_utc": 1758999517.0
  },
  {
    "body_html": "I guess it’s fair to say…  <em>putting on sunglasses</em>  Pitt got Mossed",
    "created_utc": 1759001190.0
  },
  {
    "body_html": "༼ つ ◕_◕ ༽つPitt take my energy ༼ つ ◕_◕ ༽つ",
    "created_utc": 1758992612.0
  },
  {
    "body_html": "We can't keep using refs as an excuse. Cards marching down the field and converting on third downs by throwing into our blitz isn't the refs fault. That was a promising drive for the cards and I'm not optimistic about the rest of this game.",
    "created_utc": 1758994170.0
  },
  {
    "body_html": "Missed facemask",
    "created_utc": 1758994287.0
  },
  {
    "body_html": "Talking shit after breaking his leg. Kinda hard to feel bad for the guy",
    "created_utc": 1758999135.0
  },
  {
    "body_html": "Guess the script said Louisville is supposed to win",
    "created_utc": 1758993912.0
  },
  {
    "body_html": "Pitt 17, Refs 10",
    "created_utc": 1758994023.0
  },
  {
    "body_html": "Yep it’s over…. We’re losing this…..  Playing in Pitt is always tough and our defense is getting exposed and we have no OL",
    "created_utc": 1758989998.0
  },
  {
    "body_html": "Pitt always got our number",
    "created_utc": 1758990395.0
  },
  {
    "body_html": "Bro in b4 they say his elbow hit the dudes forearm",
    "created_utc": 1758993212.0
  },
  {
    "body_html": "tv off",
    "created_utc": 1758994414.0
  },
  {
    "body_html": "Alright. All the ref ball aside, UofL since Brohm arrived has been a team that doesn't stop playing when they get behind. Classic Schnellenberger grit.",
    "created_utc": 1758994541.0
  },
  {
    "body_html": "That’s a third of the field in a couple dumb duck penalties very nice",
    "created_utc": 1758994733.0
  },
  {
    "body_html": "Don't let them score a TD please. Also a lot of tip balls in this game.",
    "created_utc": 1758994874.0
  },
  {
    "body_html": "Show the replay cowards",
    "created_utc": 1758999534.0
  },
  {
    "body_html": "I'll be on the \"fire narduzzi\" bandwagon when A) the fans that say this can tell me who would REALISTICALLY replace him B) why kids would want to come here after saying that and C) he's on the field actually playing",
    "created_utc": 1759000461.0
  },
  {
    "body_html": "That might have been Miller’s best pass today. On the run, floated it right over the defender to where only Kurisky could get it.",
    "created_utc": 1759001014.0
  },
  {
    "body_html": "Wow look at that. We still have Narduzzi and we are still terrible. Go figure.",
    "created_utc": 1759001115.0
  },
  {
    "body_html": "Why are we gifting Louisville points they’re not even from North Carolina????",
    "created_utc": 1758992611.0
  },
  {
    "body_html": "ACC rigged game against Pitt, pretty obvious",
    "created_utc": 1758992849.0
  },
  {
    "body_html": "In the decade Louisville has been in the ACC this is probably the first game that we've had favorable officiating in. Will probably have to wait another 10 years for the next one.",
    "created_utc": 1758994128.0
  },
  {
    "body_html": "Gotta love the CARDS chant!",
    "created_utc": 1759001004.0
  },
  {
    "body_html": "OL is going to get there work cut out today.",
    "created_utc": 1758988953.0
  },
  {
    "body_html": "So bad",
    "created_utc": 1758989426.0
  },
  {
    "body_html": "Rasheed has been the worst of our OL and does something like that…. I hate how we haven’t gotten a new starting guard yet",
    "created_utc": 1758989818.0
  },
  {
    "body_html": "I think it is only running into.",
    "created_utc": 1758989848.0
  },
  {
    "body_html": "No fucking way lmao",
    "created_utc": 1758989937.0
  },
  {
    "body_html": "what a catch!!!! High octane play!",
    "created_utc": 1758989977.0
  },
  {
    "body_html": "As a Cincinnati fan:  Go Meteor!",
    "created_utc": 1758990183.0
  },
  {
    "body_html": "That was a great catch",
    "created_utc": 1758990188.0
  },
  {
    "body_html": "I realize I’m late because I had to scroll forever to find this thread but that incredible td is definitely a catch of the year candidate. Wow.",
    "created_utc": 1758990340.0
  },
  {
    "body_html": "We're so back",
    "created_utc": 1758990346.0
  },
  {
    "body_html": "Bruh",
    "created_utc": 1758991039.0
  },
  {
    "body_html": "Man we just don’t have it this game. That has to be a turnover.",
    "created_utc": 1758991051.0
  },
  {
    "body_html": "CATCH THAT FUCKING BALL",
    "created_utc": 1758991056.0
  },
  {
    "body_html": "Oh linebackers are used to tackling not catching",
    "created_utc": 1758991068.0
  },
  {
    "body_html": "I miss when old spice commercials where these avant-garde surrealist pieces with deodorant sticks multiplying out of men’s’ armpits and flying into the noises on screen and the only audio is a deep male voice saying “OOOOOOOOOOLD SPIIIIIIIIIIIIIICEEEEE…”",
    "created_utc": 1758991114.0
  },
  {
    "body_html": "Is the broadcast camera someone's android phone from 2010?",
    "created_utc": 1758991310.0
  },
  {
    "body_html": "Missouri you’re welcome that we outbid you for Moss and you could get Beau…..",
    "created_utc": 1758991446.0
  },
  {
    "body_html": "The hell is the  Qb doin out there",
    "created_utc": 1758991451.0
  },
  {
    "body_html": "Bench Moss",
    "created_utc": 1758991454.0
  },
  {
    "body_html": "WHAT A FUCKING RUN LETS GO",
    "created_utc": 1758991480.0
  },
  {
    "body_html": "He almost certainly stepped out right? Lol",
    "created_utc": 1758991490.0
  },
  {
    "body_html": "Why did we throw three plays in a row, we have an elite run game and its still only the first quarter, why force our shitty qb to throw the ball",
    "created_utc": 1758991529.0
  },
  {
    "body_html": "Oh no, we suck again..",
    "created_utc": 1758992072.0
  },
  {
    "body_html": "This is where Keyjuan being out hits the most. He’s our best pass pro RB, and Isaac who is also hobbled is not doing it well",
    "created_utc": 1758992305.0
  },
  {
    "body_html": "What",
    "created_utc": 1758992326.0
  },
  {
    "body_html": "WHAAAAAAAAT",
    "created_utc": 1758992335.0
  },
  {
    "body_html": "Hahah what",
    "created_utc": 1758992336.0
  },
  {
    "body_html": "Oh wow",
    "created_utc": 1758992337.0
  },
  {
    "body_html": "What we stopped them? Holy shit!",
    "created_utc": 1758993034.0
  },
  {
    "body_html": "Why did he throw that? Looks like he had a first with his legs? Ill take it",
    "created_utc": 1758993047.0
  },
  {
    "body_html": "And now Watson is out",
    "created_utc": 1758993611.0
  },
  {
    "body_html": "Man we’ve got so many bailouts",
    "created_utc": 1758994472.0
  },
  {
    "body_html": "Well call this the classic “Pitting”",
    "created_utc": 1758994479.0
  },
  {
    "body_html": "<a href=\"https://reddit.com/r/CFB/comments/1nrxdy2/_/ngi7o3s/?context=1\">In the midst of we’re so back…</a>",
    "created_utc": 1758994529.0
  },
  {
    "body_html": "Why does this keep happening",
    "created_utc": 1758994538.0
  },
  {
    "body_html": "Im gonna say it. Kade Bell and Holstein fucking suck. 0-4 on 3rd downs through 2 quarters, our best rusher is Holstein, and our offense can't hold the longer then 2 minutes.",
    "created_utc": 1758994642.0
  },
  {
    "body_html": "Narduzzi going for it on 4th? tv on",
    "created_utc": 1758994876.0
  },
  {
    "body_html": "Speed it up for one more play before the two minute warning. Why? You’re on the 20 with two timeouts…",
    "created_utc": 1758994885.0
  },
  {
    "body_html": "Well that was a fun play!",
    "created_utc": 1758995720.0
  },
  {
    "body_html": "DAMN",
    "created_utc": 1758995747.0
  },
  {
    "body_html": "That was a great throw",
    "created_utc": 1758995827.0
  },
  {
    "body_html": "Fun would not be the word I would pick to describe the second half.",
    "created_utc": 1758997091.0
  },
  {
    "body_html": "ACC Commercial is freaking cringed dudes.",
    "created_utc": 1758997138.0
  },
  {
    "body_html": "Hey bell, catch your td pass and get ahead in the game before you talk trash to the sideline.",
    "created_utc": 1758997379.0
  },
  {
    "body_html": "And it only took like three plays for another dumb penalty.",
    "created_utc": 1758997400.0
  },
  {
    "body_html": "Why is Watson out there?",
    "created_utc": 1758997460.0
  },
  {
    "body_html": "Wow what a kick",
    "created_utc": 1758997658.0
  },
  {
    "body_html": "tfw more 4th down conversions than 3rd down conversions",
    "created_utc": 1758998396.0
  },
  {
    "body_html": "Damn. Just shy",
    "created_utc": 1758998566.0
  },
  {
    "body_html": "He's got such a boot on him, can't fault him for trying to hit 50+ FGs back to back",
    "created_utc": 1758998585.0
  },
  {
    "body_html": "I can’t decide who is good and who is stinky in the ACC",
    "created_utc": 1758998857.0
  },
  {
    "body_html": "Hope he's alright but looks bad. Injuries are killing this program. Terrible luck for the program and athletes.",
    "created_utc": 1758998970.0
  },
  {
    "body_html": "Can we trade QBs lol",
    "created_utc": 1758999165.0
  },
  {
    "body_html": "Holstein did not appreciate my slander",
    "created_utc": 1758999185.0
  },
  {
    "body_html": "LMAO",
    "created_utc": 1758999200.0
  },
  {
    "body_html": "What a pick!",
    "created_utc": 1758999210.0
  },
  {
    "body_html": "This fucking team man",
    "created_utc": 1758999218.0
  },
  {
    "body_html": "OH MY WATTS",
    "created_utc": 1758999219.0
  },
  {
    "body_html": "This game is just insane",
    "created_utc": 1758999221.0
  },
  {
    "body_html": "What a beautiful catch! Unbelievable!",
    "created_utc": 1758999225.0
  },
  {
    "body_html": "That was a hell of a play.",
    "created_utc": 1758999230.0
  },
  {
    "body_html": "Watts my man, what a play.",
    "created_utc": 1758999245.0
  },
  {
    "body_html": "He shot a free throw ffs",
    "created_utc": 1758999245.0
  },
  {
    "body_html": "LETS FUCKING GOOOOO",
    "created_utc": 1758999247.0
  },
  {
    "body_html": "Sickos eating good!",
    "created_utc": 1758999259.0
  },
  {
    "body_html": "Damn. What a catch",
    "created_utc": 1758999347.0
  },
  {
    "body_html": "That’s a good way to switch up the running attack.",
    "created_utc": 1758999402.0
  },
  {
    "body_html": "This game sucks man",
    "created_utc": 1758999449.0
  },
  {
    "body_html": "Fucking garbage",
    "created_utc": 1758999554.0
  },
  {
    "body_html": "Did you really think you’d get 22 yards on a WR screen to the sideline?",
    "created_utc": 1758999573.0
  },
  {
    "body_html": "TO usage in this game is pretty bad",
    "created_utc": 1759000084.0
  },
  {
    "body_html": "Drop 8 and still have a man running wide open 30 yards down the field.",
    "created_utc": 1759000307.0
  },
  {
    "body_html": "Wooo volleyball",
    "created_utc": 1759000623.0
  },
  {
    "body_html": "Wish we had pro volleyball in this country I’d watch the shit out of that",
    "created_utc": 1759000738.0
  },
  {
    "body_html": "That was practically Miller Mossian.",
    "created_utc": 1759000739.0
  },
  {
    "body_html": "Huge!",
    "created_utc": 1759000739.0
  },
  {
    "body_html": "Feels like they’ve only talked about the Pitt linebackers and Louisville’s RB room all game. Talk about something else",
    "created_utc": 1759000871.0
  },
  {
    "body_html": "It’s over",
    "created_utc": 1759000913.0
  },
  {
    "body_html": "Can you even defense pitt???",
    "created_utc": 1759000919.0
  },
  {
    "body_html": "Moss’ arm is gonna be sore tomorrow lol",
    "created_utc": 1759001043.0
  },
  {
    "body_html": "What a game we have on our hands",
    "created_utc": 1759001069.0
  },
  {
    "body_html": "No clue how to feel about the defense. The offense continues to put them in terrible situations. But also they just can’t make a play when needed.",
    "created_utc": 1759001114.0
  },
  {
    "body_html": "Lets make sure we blow it again!",
    "created_utc": 1759001237.0
  },
  {
    "body_html": "Welp gg Pitt. Looks like my team didn't come to play today.",
    "created_utc": 1758989977.0
  },
  {
    "body_html": "That was some grade a bullshit",
    "created_utc": 1758992567.0
  },
  {
    "body_html": "Louisville football is awful this year.",
    "created_utc": 1758989974.0
  },
  {
    "body_html": "Question and I mean no insult but how are Louisville 3-0? Were the first 3 games against like Cobb County Cole Mining Institute or something?",
    "created_utc": 1758991795.0
  },
  {
    "body_html": "Alright let’s go lmao",
    "created_utc": 1758992386.0
  },
  {
    "body_html": "Yeah we’re cooked. Negative momentum after the bullshit",
    "created_utc": 1758994356.0
  },
  {
    "body_html": "Seriously why are all of our games up here at Pitt so damn weird.",
    "created_utc": 1758994432.0
  },
  {
    "body_html": "Pitt why did you call that timeout so late. If you were going to take the timeout, why not take it right when play end",
    "created_utc": 1758995455.0
  },
  {
    "body_html": "Pitt receivers playing a bit loose with the ball. Both those receptions had pretty wide carries that if we had a guy to punch could have come out",
    "created_utc": 1758995660.0
  },
  {
    "body_html": "I hate miller moss so much",
    "created_utc": 1758995767.0
  },
  {
    "body_html": "And now we’re back to being trash.  Any Pitt fans who thought they were depressed, no it was an illusion, we were trash still.",
    "created_utc": 1758995789.0
  },
  {
    "body_html": "Someone on the 24/7 forum posted something that really stuck with me:  We have Steve Kragathorpe's OC and Steve Kragsthorpe's DC and we expected this team to not look like a Steve Kragathorpe team?",
    "created_utc": 1758996434.0
  },
  {
    "body_html": "Why is there no one at the stadium ?",
    "created_utc": 1758997649.0
  },
  {
    "body_html": "Definitely going to want that timeout later. Should have a play ready if we’re doing a bubble screen on 3rd and 5",
    "created_utc": 1759000096.0
  },
  {
    "body_html": "Our TE going off!!!",
    "created_utc": 1759001010.0
  },
  {
    "body_html": "The 2021 season was the worst thing to ever happen to Pitt’s medium term future",
    "created_utc": 1759001173.0
  },
  {
    "body_html": "Stop the count!",
    "created_utc": 1759001272.0
  },
  {
    "body_html": "Pitt 17 - Refs 17  Did I do it right?",
    "created_utc": 1758994483.0
  },
  {
    "body_html": "Wheels completely feel the fuck off after the shit ass punt return call. Goodnight yall final score 80-17 Louisville",
    "created_utc": 1758994413.0
  },
  {
    "body_html": "I don't think holstiens very good :(",
    "created_utc": 1758998010.0
  },
  {
    "body_html": "This is cheating, there isn’t another way to describe it",
    "created_utc": 1758993913.0
  },
  {
    "body_html": "Wow that was lucky.",
    "created_utc": 1758989370.0
  },
  {
    "body_html": "That PI call was weak but I'll take our offense finally moving down field",
    "created_utc": 1758994090.0
  },
  {
    "body_html": "This has been a weird half, an oddly almost 2 hour long weird half of football.",
    "created_utc": 1758994476.0
  },
  {
    "body_html": "Another dumb penalty. Basically giving them points here.",
    "created_utc": 1758994698.0
  },
  {
    "body_html": "That was just a good play from Holstein.",
    "created_utc": 1758994853.0
  },
  {
    "body_html": "BALL DONT LIE",
    "created_utc": 1758995719.0
  },
  {
    "body_html": "I’m not saying fire Brohm but we should be way better than we are",
    "created_utc": 1758995978.0
  },
  {
    "body_html": "Hell yeah. Get Babcock out there. Throw her a jump ball. Let's make this fun.",
    "created_utc": 1759000659.0
  },
  {
    "body_html": "Was that a defense chant?",
    "created_utc": 1759000747.0
  },
  {
    "body_html": "We’re not any good, so thank you Pitt for keeping us in this game",
    "created_utc": 1758994372.0
  },
  {
    "body_html": "Should have been 17-0 and Pitt ball at midfield and they just completely flipped momentum… now it’s going to be tied at half.",
    "created_utc": 1758994421.0
  },
  {
    "body_html": "Refs made the punter drop the ball.",
    "created_utc": 1758994369.0
  },
  {
    "body_html": "Don't worry shit eaters. Even if you blow this lead you can watch Utah take a dump on the Mountaineers here in a bit.",
    "created_utc": 1759000224.0
  },
  {
    "body_html": "Run straight smh",
    "created_utc": 1758989067.0
  },
  {
    "body_html": "Our O Line is still hot garbage",
    "created_utc": 1758989719.0
  },
  {
    "body_html": "I told myself I lost hope and wouldn't be watching anymore Pitt football this season. I lied",
    "created_utc": 1758989833.0
  },
  {
    "body_html": "We’re looking good so far, but I’m ready to get my heart broken again",
    "created_utc": 1758989904.0
  },
  {
    "body_html": "We should consider doing that all the time",
    "created_utc": 1758990020.0
  },
  {
    "body_html": "From the other endzone I thought he dropped that and was confused for about 2 minutes until they finally showed a replay. That’s wild",
    "created_utc": 1758990095.0
  },
  {
    "body_html": "QB Mid Off",
    "created_utc": 1758991416.0
  },
  {
    "body_html": "LETS GOOOOOO",
    "created_utc": 1758991461.0
  },
  {
    "body_html": "Lmao, rough day.",
    "created_utc": 1758991469.0
  },
  {
    "body_html": "[deleted]",
    "created_utc": 1758991472.0
  },
  {
    "body_html": "[deleted]",
    "created_utc": 1758991754.0
  },
  {
    "body_html": "Pitt fans, how do you all feel about playing in the same stadium as the Steelers? Is there any regret over getting rid of the old on-campus stadium?",
    "created_utc": 1758991877.0
  },
  {
    "body_html": "Man this Pitt team is on fire",
    "created_utc": 1758992227.0
  },
  {
    "body_html": "I figured this would be competitive? I haven’t been able to watch it - has Pitt gotten lucky or is UL selling?",
    "created_utc": 1758992280.0
  },
  {
    "body_html": "Who invited this kid",
    "created_utc": 1758992281.0
  },
  {
    "body_html": "Huh?!?!?!?!?!?!?!",
    "created_utc": 1758992362.0
  },
  {
    "body_html": "Oh no not Watson :-(",
    "created_utc": 1758993629.0
  },
  {
    "body_html": "Ok bring out Stillings or what's his name for RB",
    "created_utc": 1758993642.0
  },
  {
    "body_html": "Chris has annoyingly inconsistent hands. He makes some amazing catches and then drops gimmes",
    "created_utc": 1758993984.0
  },
  {
    "body_html": "Throwing to the ghosts",
    "created_utc": 1758994287.0
  },
  {
    "body_html": "Lmao",
    "created_utc": 1758994383.0
  },
  {
    "body_html": "Woohoo",
    "created_utc": 1758994388.0
  },
  {
    "body_html": "I am so glad I’m going to meet Christina Ricci, Linda Blair &amp; Sting at a horror con next weekend so I have an excuse not to suffer another week of NardBall",
    "created_utc": 1758994483.0
  },
  {
    "body_html": "I hate everything with a burning passion",
    "created_utc": 1758994496.0
  },
  {
    "body_html": "This game just keeps getting better and better",
    "created_utc": 1758994502.0
  },
  {
    "body_html": "Rashad Battle is getting eaten alive today.",
    "created_utc": 1758994509.0
  },
  {
    "body_html": "God Narduzzi’s teams are weak",
    "created_utc": 1758994528.0
  },
  {
    "body_html": "the icing on the fucking cake will be the cards somehow getting ranked ahead of mizzou.",
    "created_utc": 1758994587.0
  },
  {
    "body_html": "Not surprising at all really, what’s the point",
    "created_utc": 1758994634.0
  },
  {
    "body_html": "Not sure that's the spot I'd call a zero blitz at",
    "created_utc": 1758994871.0
  },
  {
    "body_html": "This game feels familiar lol",
    "created_utc": 1758994877.0
  },
  {
    "body_html": "I hate how teams never go under center on 3rd/4th and 1 these days.",
    "created_utc": 1758995246.0
  },
  {
    "body_html": "I don't understand these Louisville play calls where it's just an open door for the dline. The screens aren't working dude.",
    "created_utc": 1758995397.0
  },
  {
    "body_html": "Alright fellas. USC ILLINOIS is rigged. Notre Dame handling hogs. What’s the bet here? Tuning in…",
    "created_utc": 1758995454.0
  },
  {
    "body_html": "Lol",
    "created_utc": 1758995729.0
  },
  {
    "body_html": "Holy shiiiiiiiit",
    "created_utc": 1758995733.0
  },
  {
    "body_html": "Wow…",
    "created_utc": 1758995742.0
  },
  {
    "body_html": "Does every meaningful game have to be a rollercoaster?",
    "created_utc": 1758995952.0
  },
  {
    "body_html": "Oh now Lacy is going to run the ball now huh?",
    "created_utc": 1758997296.0
  },
  {
    "body_html": "I think miller moss isnt tall enough to see properly",
    "created_utc": 1758997467.0
  },
  {
    "body_html": "So we just throwing it to the middle?",
    "created_utc": 1758997498.0
  },
  {
    "body_html": "So while watching this I’m listening in the background to a podcast of two guys breaking down one of the most painful media experiences they’ve ever seen that for one of them is a Reboot in name only a beloved childhood piece of media.  So at least there’s someone who is having a worse watching experience than us watching this game right now….",
    "created_utc": 1758997534.0
  },
  {
    "body_html": "What are we doing?",
    "created_utc": 1758997568.0
  },
  {
    "body_html": "Miller Moss is terrrrrible",
    "created_utc": 1758998668.0
  },
  {
    "body_html": "Owwww",
    "created_utc": 1758998859.0
  },
  {
    "body_html": "Ouch  petergriffinknee.gif",
    "created_utc": 1758998920.0
  },
  {
    "body_html": "Damn, what a fucking INT",
    "created_utc": 1758999216.0
  },
  {
    "body_html": "What a changing of the tides.",
    "created_utc": 1758999221.0
  },
  {
    "body_html": "What a pick",
    "created_utc": 1758999226.0
  },
  {
    "body_html": "What a play",
    "created_utc": 1758999227.0
  },
  {
    "body_html": "WOW WHAT A PLAY",
    "created_utc": 1758999228.0
  },
  {
    "body_html": "well, that was not ideal. come on, D!",
    "created_utc": 1758999253.0
  },
  {
    "body_html": "Holy fucking shit",
    "created_utc": 1758999258.0
  },
  {
    "body_html": "Beautiful!!!",
    "created_utc": 1758999267.0
  },
  {
    "body_html": "Alright. Safety time.",
    "created_utc": 1758999267.0
  },
  {
    "body_html": "So safety here, right?",
    "created_utc": 1758999277.0
  },
  {
    "body_html": "<strong>Watt<del>s</del> da hell</strong>",
    "created_utc": 1758999278.0
  },
  {
    "body_html": "<h2>Final Who Will Win Poll Results</h2>  <table><thead> <tr> <th align=\"left\">Team</th> <th align=\"right\">Votes</th> <th align=\"right\">Percentage</th> <th align=\"left\">Voters</th> </tr> </thead><tbody> <tr> <td align=\"left\"><a href=\"#f/louisville\">Louisville</a></td> <td align=\"right\">9</td> <td align=\"right\">75.0%</td> <td align=\"left\"><a href=\"#f/floridastate-sheet1-row02-col05\">Florida State</a>x1.5 <a href=\"#f/westvirginia-sheet1-row04-col16\">West Virginia</a>x1.0 <a href=\"#f/byu-sheet1-row04-col04\">BYU</a>x1.0 <a href=\"#f/paperbag-sheetl-row15-col22\">Paper Bag</a>x1.0 <a href=\"#f/louisville-sheet1-row02-col07\">Louisville</a>x1.0 <a href=\"#f/alabama-sheet1-row10-col01\">Alabama</a>x0.5 <a href=\"#f/texas-sheet1-row10-col14\">Texas</a>x0.5 <a href=\"#f/pittsburgh-sheet1-row02-col11\">Pittsburgh</a>x0.5 <a href=\"#f/sickos-sheetl-row16-col02\">Sickos</a>x0.5 <a href=\"#f/usc-sheet1-row05-col16\">USC</a>x0.5 <a href=\"#f/victorybell-sheetl-row30-col11\">Victory Bell</a>x0.5 <a href=\"#f/ucf-sheet1-row04-col14\">UCF</a>x0.5</td> </tr> <tr> <td align=\"left\"><a href=\"#f/pittsburgh\">Pittsburgh</a></td> <td align=\"right\">3</td> <td align=\"right\">25.0%</td> <td align=\"left\"><a href=\"#f/louisville-sheet1-row02-col07\">Louisville</a>x1.5 <a href=\"#f/paperbag-sheetl-row15-col22\">Paper Bag</a>x1.0 <a href=\"#f/kegofnails-sheetl-row29-col12\">Keg of Nails</a>x0.5</td> </tr> </tbody></table>  <em>Last updated: 2025-09-27 18:54 UTC</em>  &nbsp;  <em><sup>Users with multiple flairs splits their vote equally between flairs.</sup><br/> <sup><a href=\"#f/paperbag-sheetl-row15-col22\">paperbag</a></sup> <sup>is used for unflaired users.</sup></em>  <hr/>  <sup>To vote in the Fan Poll simply include the name of the team you think will win enclosed by {} as part of your TOP LEVEL comment discussing the matchup.<br/> Check here for a</sup> <a href=\"https://matchup.rivalrybot.com/aliases\"><sup>list of all valid/known team names/aliases</sup></a><br/> <sup>To change your vote just edit your initial comment to bracket the other team. You can change your vote as often as you like until the GAME THREAD is posted.<br/> The vote tally logic only counts the first comment it finds with a valid vote per user.</sup>",
    "created_utc": 1758999298.0
  },
  {
    "body_html": "I can’t remember the last time our running game was so anemic. 2018?",
    "created_utc": 1758999326.0
  },
  {
    "body_html": "Alright let’s go!",
    "created_utc": 1758999350.0
  },
  {
    "body_html": "I wanted that safety so bad",
    "created_utc": 1758999376.0
  },
  {
    "body_html": "Isaac cannot pass protect worth a damn.",
    "created_utc": 1758999458.0
  },
  {
    "body_html": "Narduzzi just wishes elite pass rushing into existence",
    "created_utc": 1758999483.0
  },
  {
    "body_html": "That was a wasted drive.",
    "created_utc": 1758999567.0
  },
  {
    "body_html": "With how bad our offense has been why not just pin us deep on a punt",
    "created_utc": 1759000083.0
  },
  {
    "body_html": "I think we still would have gotten him even if he didn’t drop it.",
    "created_utc": 1759000157.0
  },
  {
    "body_html": "Ok, now have to do something with it.",
    "created_utc": 1759000194.0
  },
  {
    "body_html": "Holy shit this game",
    "created_utc": 1759000286.0
  },
  {
    "body_html": "Babcock is scary good",
    "created_utc": 1759000653.0
  },
  {
    "body_html": "Well damn. Bout time defense made plays that counted",
    "created_utc": 1759000760.0
  },
  {
    "body_html": "Time for the rally yellow seat costumes!",
    "created_utc": 1759000765.0
  },
  {
    "body_html": "Why why why key anywhere why why whey wheelie ejwujeuv ensure whey whey whey whey why why why why",
    "created_utc": 1759000769.0
  },
  {
    "body_html": "The Pitt player did push him right at the end.",
    "created_utc": 1758992458.0
  },
  {
    "body_html": "Refs 10 - Louisvilles quarterback 17",
    "created_utc": 1758994055.0
  },
  {
    "body_html": "Extend Narduzzi's contract immediately!",
    "created_utc": 1759000442.0
  },
  {
    "body_html": "I know people want to blame the refs for making a bad call but really that was just a stupid play from 23",
    "created_utc": 1758992554.0
  },
  {
    "body_html": "Even the neutral commentators have said the cardinals were gifted a touchdown several times now  that's how you know it's bad",
    "created_utc": 1758994238.0
  },
  {
    "body_html": "I’m not saying the refs have bias for Louisville cause they’re a “northern” team that usually gets fucked like us, but boy have they been incompetent in a way so far that is much more benefiting Louisville then us",
    "created_utc": 1758994267.0
  },
  {
    "body_html": "Talking shit on one leg. Love the kid. Hopefully he comes back stronger",
    "created_utc": 1758999168.0
  },
  {
    "body_html": "I don’t care for Pitt",
    "created_utc": 1759000287.0
  },
  {
    "body_html": "I love this for Narduzzi. Biggest dickhead this side of Hugh Freeze.",
    "created_utc": 1759001037.0
  },
  {
    "body_html": "First UVA, now Louisville, investigate this conference immediately",
    "created_utc": 1758992694.0
  },
  {
    "body_html": "LET'S GO THATS WHAT I'M TALKING ABOUT!!!!!!!!",
    "created_utc": 1758994447.0
  },
  {
    "body_html": "\"You guys fuckin' suck!\" Lol",
    "created_utc": 1758999158.0
  },
  {
    "body_html": "Crazy they don’t call holding.",
    "created_utc": 1759000967.0
  },
  {
    "body_html": "I believed in Louisville this whole time!!",
    "created_utc": 1759001028.0
  },
  {
    "body_html": "shoutout to the refs for that 3 and out",
    "created_utc": 1758993120.0
  },
  {
    "body_html": "BIRDS DO NOT HAVE TEETH",
    "created_utc": 1758989984.0
  },
  {
    "body_html": "There's so many good early games, but no great ones. We need just a general 11a all games thread",
    "created_utc": 1758990202.0
  },
  {
    "body_html": "Did anybody block a guy? I just saw three Pitt players run past our OL! LOL",
    "created_utc": 1758990738.0
  },
  {
    "body_html": "Let’s go dude",
    "created_utc": 1758992344.0
  },
  {
    "body_html": "Did the Pitt player just take that injured lville players mouthguard? Lol",
    "created_utc": 1758993656.0
  },
  {
    "body_html": "lol",
    "created_utc": 1758994370.0
  },
  {
    "body_html": "Hell yeah",
    "created_utc": 1758994376.0
  },
  {
    "body_html": "TDDDD",
    "created_utc": 1758994425.0
  },
  {
    "body_html": "ACC said week 5 = chaos i guess.  This game, GT losing, FSUs loss...  Miami really about to just walk to the CFP uncontested arent they?",
    "created_utc": 1758994718.0
  },
  {
    "body_html": "Lmao the penalty yard difference is nutty",
    "created_utc": 1758994777.0
  },
  {
    "body_html": "Catch up with other games on the Reddit CFB Scoreboard: <a href=\"https://scoreboard.redditcfb.com/\">https://scoreboard.redditcfb.com/</a>",
    "created_utc": 1758994883.0
  },
  {
    "body_html": "Idk man, I kinda love these bobble head commercials",
    "created_utc": 1758996794.0
  },
  {
    "body_html": "You can do this Pitt I believe in you",
    "created_utc": 1758998273.0
  },
  {
    "body_html": "LOLLOLLOL",
    "created_utc": 1758999216.0
  },
  {
    "body_html": "What in the world was Holstein thinking with that pass",
    "created_utc": 1758999247.0
  },
  {
    "body_html": "Pitt…I’m begging you on my hands and knees",
    "created_utc": 1758999356.0
  },
  {
    "body_html": "Pitt QB is an odd looking fellow",
    "created_utc": 1759000051.0
  },
  {
    "body_html": "Lmao what the fuck are you doing all around",
    "created_utc": 1759000137.0
  },
  {
    "body_html": "Catch that shit man",
    "created_utc": 1758998518.0
  },
  {
    "body_html": "I’m a huge Eli Holstein fan personally",
    "created_utc": 1759000723.0
  },
  {
    "body_html": "Pitt fans really think the guy just ran into him without being pushed running full speed",
    "created_utc": 1758992874.0
  },
  {
    "body_html": "Pittsburgh ur kinda ass",
    "created_utc": 1758994418.0
  },
  {
    "body_html": "The dozens of Pitt fans in attendance are going to be so upset. See a lot of red sprinkled amongst the yellow seats, too.",
    "created_utc": 1759000452.0
  },
  {
    "body_html": "That was the right call he did push him",
    "created_utc": 1758992435.0
  },
  {
    "body_html": "Lol can someone give me an actual reason why that shouldn't have been our ball? Or are we just gonna complain because of a call?",
    "created_utc": 1758992734.0
  },
  {
    "body_html": "Miller Moss reminds me of that Mac Miller song that has the goofy voice saying “Miller Mac”  Great game so far. Hope everyone is having fun! Holstein for Heisman.",
    "created_utc": 1759001042.0
  },
  {
    "body_html": "REVENGE GAME!!!",
    "created_utc": 1758989966.0
  },
  {
    "body_html": "Nice pick, uncalled taunting at the end",
    "created_utc": 1758991474.0
  },
  {
    "body_html": "HAHAHATA",
    "created_utc": 1758992598.0
  },
  {
    "body_html": "the hogs eating shit always makes me happy.",
    "created_utc": 1758992979.0
  },
  {
    "body_html": "Holstein has at least been good at not taking sacks and gaining a couple yards.",
    "created_utc": 1758994376.0
  },
  {
    "body_html": "Wow what a turnaround",
    "created_utc": 1758994456.0
  },
  {
    "body_html": "The ceiling is the floor.",
    "created_utc": 1758995965.0
  },
  {
    "body_html": "YES!!!!!!",
    "created_utc": 1759000724.0
  },
  {
    "body_html": "Let’s f’ing go!",
    "created_utc": 1759000730.0
  },
  {
    "body_html": "Hahahahahahahahahahahahahahahahaha",
    "created_utc": 1759000145.0
  },
  {
    "body_html": "It's a good thing the stadium was half empty at the start of the 3rd quarter, those people would have been very disappointed.",
    "created_utc": 1759001112.0
  },
  {
    "body_html": "We gonna get mad about them getting this one right too?",
    "created_utc": 1758993193.0
  },
  {
    "body_html": "Refs helping out pitt once again smh",
    "created_utc": 1758999568.0
  },
  {
    "body_html": "Eli INT incoming",
    "created_utc": 1758992883.0
  },
  {
    "body_html": "We finally caught a break...",
    "created_utc": 1758994393.0
  },
  {
    "body_html": "Pittsburgh education showing in this thread",
    "created_utc": 1758992643.0
  },
  {
    "body_html": "ACC is actually so poverty how is that all the fans you’re bringing in hosting 3-0 Louisville",
    "created_utc": 1758989024.0
  },
  {
    "body_html": "23 had a full hand of jersey and shoved Meeks into the defender",
    "created_utc": 1758992693.0
  },
  {
    "body_html": "[deleted]",
    "created_utc": 1758995200.0
  },
  {
    "body_html": "Meeks got shoved you can clearly see",
    "created_utc": 1758992440.0
  },
  {
    "body_html": "How’d I know Louisville was gonna randomly shit themselves today? I just knew it. Even against a trash Pitt team",
    "created_utc": 1758993957.0
  },
  {
    "body_html": "Every Pitt game is a sickos classic",
    "created_utc": 1758996065.0
  },
  {
    "body_html": "It's horse collar but I did find it absolutely wild that it took the far official throwing the flag and the official 10 feet from the play was just going to let it go.",
    "created_utc": 1758994690.0
  },
  {
    "body_html": "And the refs are now way too involved. No one is here to watch you, jackasses.",
    "created_utc": 1758993854.0
  },
  {
    "body_html": "What a fucking joke",
    "created_utc": 1758992704.0
  },
  {
    "body_html": "Miller Moss is kinda ass",
    "created_utc": 1758991327.0
  },
  {
    "body_html": "Moss is a$$",
    "created_utc": 1758990590.0
  },
  {
    "body_html": "Clemson/FSU were right. Fold this joke of a conference",
    "created_utc": 1758992384.0
  },
  {
    "body_html": "Damn I saw the Louisville injury report had like 5 RBs Questionable or Out. Has it really been that bad for their backs? Tough loss",
    "created_utc": 1758993699.0
  },
  {
    "body_html": "At times Eli does look like a 2nd rounder which makes it all the more frustrating when he turns into an XFL QB",
    "created_utc": 1758989299.0
  },
  {
    "body_html": "Big East football baby",
    "created_utc": 1758989519.0
  },
  {
    "body_html": "Lol, this is a joke.",
    "created_utc": 1758990801.0
  },
  {
    "body_html": "Why did Brohm get Miller Moss? He sucked at USC and he sucks here.",
    "created_utc": 1758992831.0
  },
  {
    "body_html": "That's one of the worst calls I've ever seen.",
    "created_utc": 1758992403.0
  },
  {
    "body_html": "[deleted]",
    "created_utc": 1758992866.0
  },
  {
    "body_html": "Big sheeeeeeesh, this team is just not it this year",
    "created_utc": 1758990022.0
  },
  {
    "body_html": "Great. Bad Eli is back too",
    "created_utc": 1758994801.0
  },
  {
    "body_html": "That was a pretty pitiful drive and we are giving Pitt way too much time to get into scoring range.",
    "created_utc": 1758995564.0
  },
  {
    "body_html": "Man, we really just don’t want to win.",
    "created_utc": 1758995750.0
  },
  {
    "body_html": "Pitt redzone offense at its best",
    "created_utc": 1758989396.0
  },
  {
    "body_html": "Ok I really need to know who’s using an iPhone for a camera when you have the budget for an exploding ship prop",
    "created_utc": 1758989549.0
  },
  {
    "body_html": "Pretty much the start I was expecting. This is a 6-6 to 7-5 squad this year",
    "created_utc": 1758990048.0
  },
  {
    "body_html": "Bring forth the Deuce",
    "created_utc": 1758991251.0
  },
  {
    "body_html": "Brohm is 1/3 in QB transfers. We got lucky Tyler wasn’t ass by the way he brings in QBs",
    "created_utc": 1758991474.0
  },
  {
    "body_html": "After trying for most of the drive, he finally threw that interception he wanted to throw",
    "created_utc": 1758991494.0
  },
  {
    "body_html": "ESPN, take the camera off him. Jesus Christ be respectful",
    "created_utc": 1758991852.0
  },
  {
    "body_html": "Toothy Birds what are you doing? Looking like shit is our job!",
    "created_utc": 1758992103.0
  },
  {
    "body_html": "Uh, okay. I’ll take that, I guess? Probably won’t change the outcome but hopefully we can prevent a shutout. Lmao",
    "created_utc": 1758992390.0
  },
  {
    "body_html": "Obvious momentum shift after that horse shit Louisville touchdown, but Pitt didn’t exactly respond well",
    "created_utc": 1758994451.0
  },
  {
    "body_html": "Well this is a horrible start. We’re lucky we aren’t down 14.",
    "created_utc": 1758990035.0
  },
  {
    "body_html": "wow.",
    "created_utc": 1758992352.0
  },
  {
    "body_html": "Wow.",
    "created_utc": 1758992353.0
  },
  {
    "body_html": "If we don't score here!",
    "created_utc": 1758992454.0
  },
  {
    "body_html": "Is there anyone at this game?",
    "created_utc": 1758994487.0
  },
  {
    "body_html": "Foots not supposed to go that way",
    "created_utc": 1758998864.0
  },
  {
    "body_html": "Shark week motherfuckers",
    "created_utc": 1758991561.0
  },
  {
    "body_html": "Man the refs can't even give these bums a touchdown lmao",
    "created_utc": 1758992555.0
  },
  {
    "body_html": "Death, taxes, and noon home football games, apparently. Do they know they’re allowed to schedule our games for other times?",
    "created_utc": 1758989795.0
  },
  {
    "body_html": "w t f",
    "created_utc": 1758991288.0
  },
  {
    "body_html": "PULL HIM",
    "created_utc": 1758991473.0
  },
  {
    "body_html": "Man we needed a break like that. But we cannot keep getting these unsportsmanlike penalties. That’s all on coaching and discipline.",
    "created_utc": 1758992650.0
  },
  {
    "body_html": "What kind of play calling is this",
    "created_utc": 1758993488.0
  },
  {
    "body_html": "Pitt special teams looking extra special today",
    "created_utc": 1758994457.0
  },
  {
    "body_html": "Everyone relax we’re not going to score anyway",
    "created_utc": 1758992509.0
  },
  {
    "body_html": "Not a great defensive start",
    "created_utc": 1758989246.0
  },
  {
    "body_html": "WOW",
    "created_utc": 1758991475.0
  },
  {
    "body_html": "Isaac really sucks at pass pro today.",
    "created_utc": 1758992279.0
  },
  {
    "body_html": "Oh wow what a huge break!",
    "created_utc": 1758992337.0
  },
  {
    "body_html": "What just happened",
    "created_utc": 1758992552.0
  },
  {
    "body_html": "That should have been a catch but thus far it's just been one of those games for us",
    "created_utc": 1758994000.0
  },
  {
    "body_html": "When things do work the receivers fuggin blow",
    "created_utc": 1758994004.0
  },
  {
    "body_html": "Poor Syracuse. Biggest win in a decade but can’t capitalize on it bc they lost their QB",
    "created_utc": 1758993032.0
  },
  {
    "body_html": "Honestly the guy got pushed Pitt guy should’ve went for the ball",
    "created_utc": 1758992923.0
  },
  {
    "body_html": "Geeeeezzz the refs made him fumble!",
    "created_utc": 1758994376.0
  },
  {
    "body_html": "This s a fraud of a game. Louisville fans, congrats on cheating to get back in it I guess.",
    "created_utc": 1758994477.0
  },
  {
    "body_html": "Arm sleeve on a kicker is a ballsy move",
    "created_utc": 1758994031.0
  }
]