[
  {
    "body_html": "Dabo Haters have been waiting for this day.  Will he bounce back?  Find out next time on CFBall Z!",
    "created_utc": 1758407790.0
  },
  {
    "body_html": "Reporter should ask Dabo about 'clemsoning' in the post game presser.  Reprise of the question many years ago just to watch him freak out and go off.    Oh man I would pay to see that!",
    "created_utc": 1758406439.0
  },
  {
    "body_html": "Did Dabo give either half a grade in the post conference?",
    "created_utc": 1758406402.0
  },
  {
    "body_html": "Feel sorry for UNC. My bet is Clemson hangs 50-60 in Chapel Bill. They are not very good on D or O. Losing 27-3 early in 3rd to UCF.",
    "created_utc": 1758405779.0
  },
  {
    "body_html": "17.5 point underdog won in Death Valley on a must-win for desperate Clemson. This was no fluke. Syracuse never trailed. Won by nearly two TD’s. Even their backup QB scored. Ouch. Made ‘Cuse look like a top 29-30 team.",
    "created_utc": 1758405524.0
  },
  {
    "body_html": "Dabo is a 🤡",
    "created_utc": 1758405517.0
  },
  {
    "body_html": "Somewhere Scott Shafer is yelling “Fuck you, Dabo”",
    "created_utc": 1758405033.0
  },
  {
    "body_html": "How do you even grade this one Dabo??  Syracuse manhandled you in your own house on all sides of the ball, even special teams. You had your guys analyze film during the weather delay and they still came out looking terrible.  Season defining loss and all around failure for Clemson that has to force big changes. Wishing all the best to Angeli for a speedy recovery and hope for a thriller rest of the season for Fran Brown and the Orange!",
    "created_utc": 1758404950.0
  },
  {
    "body_html": "I'm betting Texas Tech to win it all",
    "created_utc": 1758404756.0
  },
  {
    "body_html": "LSU on fraud watch. their only big wins were (fraudulently ranked) Clemson and Florida. 0 indications they’re the #3 team in the country",
    "created_utc": 1758404679.0
  },
  {
    "body_html": "Well Clemson you should get a win after the bye. You play the one ACC team worse than you the Belichick's",
    "created_utc": 1758404614.0
  },
  {
    "body_html": "If Troy closed Clemson would be 0-4 😭😭",
    "created_utc": 1758404543.0
  },
  {
    "body_html": "We’re about to get a master class in gaslighting from Dabo LOL.",
    "created_utc": 1758404401.0
  },
  {
    "body_html": "Dabo is a relic of the pre NIL era.",
    "created_utc": 1758404392.0
  },
  {
    "body_html": "I'll never get over FSU basically pulling a backdoor firing of Bobby Bowden after a string of 7 win seasons, and Dabo, you're no Bowden.",
    "created_utc": 1758404372.0
  },
  {
    "body_html": "Syracuse is the only orange team I can like. All other oranges teams are bad",
    "created_utc": 1758404345.0
  },
  {
    "body_html": "gg Tigers",
    "created_utc": 1758404345.0
  },
  {
    "body_html": "Does God hate Clemson now?",
    "created_utc": 1758404344.0
  },
  {
    "body_html": "I don’t really feel bad for dabo. Should I?",
    "created_utc": 1758404337.0
  },
  {
    "body_html": "On the plus side, Fran is going to shower today!",
    "created_utc": 1758404335.0
  },
  {
    "body_html": "If we can should fire Dabo bc we are tired of winning, what should be do if we’re tired of losing.",
    "created_utc": 1758404332.0
  },
  {
    "body_html": "Good win for Syracuse. Had this penciled in as a loss. Big win given how tough their schedule is with Miami and Notre Dame remaining among other teams.",
    "created_utc": 1758404318.0
  },
  {
    "body_html": "Dabo is so cooked",
    "created_utc": 1758404303.0
  },
  {
    "body_html": "Dabo is the cringiest coach in college football",
    "created_utc": 1758404289.0
  },
  {
    "body_html": "Dabo retirement game",
    "created_utc": 1758404289.0
  },
  {
    "body_html": "loool Dabo trying not to cry",
    "created_utc": 1758404275.0
  },
  {
    "body_html": "WHERE PGT",
    "created_utc": 1758404270.0
  },
  {
    "body_html": "I don't even hate Clemson.  I hate Dabo.",
    "created_utc": 1758404253.0
  },
  {
    "body_html": "them tigers been neutered",
    "created_utc": 1758404241.0
  },
  {
    "body_html": "Don’t lie, Clemson is ass",
    "created_utc": 1758404240.0
  },
  {
    "body_html": "Bro is sobbing wow, he knows it’s over",
    "created_utc": 1758404234.0
  },
  {
    "body_html": "Dabo in tears is always a beautiful sight.",
    "created_utc": 1758404233.0
  },
  {
    "body_html": "Clemsoning is officially back",
    "created_utc": 1758404231.0
  },
  {
    "body_html": "It's been obvious for years Clemson is constantly falling apart without all-universe QBs like Watson and Lawrence, these people will NEVER learn.   If Swinney isn't fired by tomorrow morning, there is blackmail going on between him and the AD",
    "created_utc": 1758404229.0
  },
  {
    "body_html": "Is Dabo crying?",
    "created_utc": 1758404226.0
  },
  {
    "body_html": "Dabo looks like he's legit about to cry.",
    "created_utc": 1758404225.0
  },
  {
    "body_html": "Dabo looks like he finna cry",
    "created_utc": 1758404221.0
  },
  {
    "body_html": "God can’t save you from the media now Dabo",
    "created_utc": 1758404212.0
  },
  {
    "body_html": "This is random, but the amount of deputies teams carry with them now is comically absurd.  Running 5-7 deep for each head coach is insane",
    "created_utc": 1758404210.0
  },
  {
    "body_html": "Joe Fortenbaugh on ESPN bet live 2 best bets for the college football season were  Clemson over 9.5 wins - that bet has already lost 4 games into the season   Cal under 4.5 wins - Cal is 3-0 and favored by 2 TD's today vs San Diego St",
    "created_utc": 1758404208.0
  },
  {
    "body_html": "rickie collins what do you have for me…",
    "created_utc": 1758404195.0
  },
  {
    "body_html": "Clemson continues to die its slow death following \"the catch\" in the 2019 Fiesta Bowl.",
    "created_utc": 1758404193.0
  },
  {
    "body_html": "This game should officially mark the end of questioning if clemson is able to turn it around and get back to national championship form. Thats gone until further notice and we should not be given reporting news other than local teams",
    "created_utc": 1758404192.0
  },
  {
    "body_html": "Love Fran for the orange. Hope he stays there a long time",
    "created_utc": 1758404190.0
  },
  {
    "body_html": "Congratulations Syracuse!  You all beat our tails for 4 quarters. Protect Fran Brown at all costs!",
    "created_utc": 1758404189.0
  },
  {
    "body_html": "Already tuned into WCCP FM to hear the excuses.",
    "created_utc": 1758404189.0
  },
  {
    "body_html": "Postgame thread ??",
    "created_utc": 1758404188.0
  },
  {
    "body_html": "This Dabo post game interview is gonna be 🔥🔥🔥🔥",
    "created_utc": 1758404186.0
  },
  {
    "body_html": "C-L-E-M-S-U-X",
    "created_utc": 1758404182.0
  },
  {
    "body_html": "Fran and that polo buttoned ALL THE WAY UP",
    "created_utc": 1758404181.0
  },
  {
    "body_html": "It just seems unnecessarily mean to comment other than to say Clemson fans, watch our game later and we'll make you feel better.",
    "created_utc": 1758404168.0
  },
  {
    "body_html": "Fear the Orange!",
    "created_utc": 1758404164.0
  },
  {
    "body_html": "my god, they actually did it. never thought we'd be the ones to cast Clempus into the fires of hell, but god damn does it feel good.",
    "created_utc": 1758404163.0
  },
  {
    "body_html": "Look at <a href=\"https://247sports.com/season/2025-football/collegeteamtalentcomposite/\">this</a> and tell me talent is the issue and that the portal would fix Clemson.   The portal has maybe 3 players a year that could start for Clemson (and that’s assuming they pick Clemson over the 20 other schools courting them)  Dabo needs to coach better.",
    "created_utc": 1758404156.0
  },
  {
    "body_html": "Let’s go Orange! 🍊",
    "created_utc": 1758404146.0
  },
  {
    "body_html": "Fran out there recruiting for next year's transfer portal",
    "created_utc": 1758404141.0
  },
  {
    "body_html": "Clemson about to get dog walked by the media",
    "created_utc": 1758404139.0
  },
  {
    "body_html": "WINNERS GET WASHED",
    "created_utc": 1758404130.0
  },
  {
    "body_html": "Help is available  Speak with someone today  988 Suicide and Crisis Lifeline  Languages: English, Spanish Hours: Available 24 hours",
    "created_utc": 1758404127.0
  },
  {
    "body_html": "And the season is over for cLemson in September",
    "created_utc": 1758404126.0
  },
  {
    "body_html": "Everyone wave goodbye….👋👋.",
    "created_utc": 1758404125.0
  },
  {
    "body_html": "CLEMPSON LOST",
    "created_utc": 1758404120.0
  },
  {
    "body_html": "Doesn't it seem like Clemson's fallen apart after Venables left? Meanwhile, Sooners are looking better than ever under Venables. Maybe it was always Venables?",
    "created_utc": 1758404119.0
  },
  {
    "body_html": "What grade would you give Syracuse today Dabo",
    "created_utc": 1758404115.0
  },
  {
    "body_html": "First time so far.",
    "created_utc": 1758404112.0
  },
  {
    "body_html": "Is Dabo gonna get the Richt treatment if he doesn’t shake things up?",
    "created_utc": 1758404110.0
  },
  {
    "body_html": "Come on, field goal on 1st down as time expires.",
    "created_utc": 1758404106.0
  },
  {
    "body_html": "I wonder how long it takes for Dabo to get that smug smirk on his face, \"I think we can afford a couple of dang stinkers, after all this winning we're used to. I promise I don't read the criticism even though I complain about it every season.\"",
    "created_utc": 1758404106.0
  },
  {
    "body_html": "Post game thread should have been up 10 minutes ago",
    "created_utc": 1758404103.0
  },
  {
    "body_html": "Fuck espn for how many ads they ran this second half when they had that long ass rain delay to run ads",
    "created_utc": 1758404099.0
  },
  {
    "body_html": "Get fucked dabo",
    "created_utc": 1758404098.0
  },
  {
    "body_html": "I missed his injury what did he do? ankle?",
    "created_utc": 1758404095.0
  },
  {
    "body_html": "Im ready for austin, the rock, and undertaker to go in there and drop the rock bottom,  stone cold stunner, and choke slam on this whole coaching staff",
    "created_utc": 1758404091.0
  },
  {
    "body_html": "Dabo just needs to own this disaster.",
    "created_utc": 1758404089.0
  },
  {
    "body_html": "WOOHOOOO",
    "created_utc": 1758404084.0
  },
  {
    "body_html": "Tyler from Spartanburg, it’s your time to shine once again",
    "created_utc": 1758404083.0
  },
  {
    "body_html": "I really feel awful for Syracuse QB. Hopefully he gets better fast dude is a dog",
    "created_utc": 1758404077.0
  },
  {
    "body_html": "GG",
    "created_utc": 1758404076.0
  },
  {
    "body_html": "Wonder who Dabo will blame this time   Maybe he finally does the right thing and takes the blame  Eh who am I kidding, he’ll throw some walk on practice dude under the bus for not emulating Syracuses backup te well enough in practice",
    "created_utc": 1758404076.0
  },
  {
    "body_html": "Aaaand unclench",
    "created_utc": 1758404076.0
  },
  {
    "body_html": "Remind me why Clemson was ranked top 5 in preseason?",
    "created_utc": 1758404074.0
  },
  {
    "body_html": "You know, I wish more teams in the ACC tried to carry their weight. When little country schools like Clemson, who don't care about football, get the same share of the conference pie, that's a problem. That's why Cuse is trying to go to the SEC.",
    "created_utc": 1758404071.0
  },
  {
    "body_html": "It's September 20 and Clemson effectively is out of the ACC title race",
    "created_utc": 1758404069.0
  },
  {
    "body_html": "GG",
    "created_utc": 1758404068.0
  },
  {
    "body_html": "i remember thinking the first half against troy was an exception but now i think the second half was",
    "created_utc": 1758404062.0
  },
  {
    "body_html": "They should take all the post game questions from the Clemson message boards.",
    "created_utc": 1758404062.0
  },
  {
    "body_html": "Hey Clemson that's how you make a 4th down conversion",
    "created_utc": 1758404061.0
  },
  {
    "body_html": "It's not even the fact that we're 1-3  We look absolutely terrible",
    "created_utc": 1758404054.0
  },
  {
    "body_html": "Dabo is running the program to compete in yesteryears game. The game has changed and you cannot cheat the game. Look at any mid to upper echelon program. They're faster, meaner and quite frankly significantly better than our squad. The head man cannot go on National TV and whine while he's cheating the game. This season's results say much more than all the talk.",
    "created_utc": 1758404052.0
  },
  {
    "body_html": "FATALITY",
    "created_utc": 1758404049.0
  },
  {
    "body_html": "Could the acc send two teams to the CFP?",
    "created_utc": 1758404044.0
  },
  {
    "body_html": "Lost in the lol Dabo of this is that Fran had them fired up and put a good plan together.",
    "created_utc": 1758404040.0
  },
  {
    "body_html": "How is this game still on?",
    "created_utc": 1758404038.0
  },
  {
    "body_html": "Nice, we won",
    "created_utc": 1758404034.0
  },
  {
    "body_html": "games back right on time bye guys",
    "created_utc": 1758404033.0
  },
  {
    "body_html": "Can someone ELI5/OOTL me who in the fuck \"Tyler from Spartanburg\" is?",
    "created_utc": 1758404030.0
  },
  {
    "body_html": "Sometimes I feel like im watching a different game. The last missed throw to Randall was kinda bad and the one to the middle over Moore was a real bad miss too but Klubnik consistently has no time to throw.  And moore has zero room to be mad about anything, dropped 2 huge plays and never gets open.",
    "created_utc": 1758404028.0
  },
  {
    "body_html": "ESPN: Clemson might be the best team in the country! Arch Manning will win the Heisman!  Im starting to think maybe ESPN just wants clicks?",
    "created_utc": 1758404015.0
  },
  {
    "body_html": "syracuse isnt fucking around now. saving the extra second 🤣",
    "created_utc": 1758404013.0
  },
  {
    "body_html": "I just want a <del>Gundy</del> Dabo, \"I'm a man\" speech after this.",
    "created_utc": 1758404012.0
  },
  {
    "body_html": "This is the crappiest Clemson football I've seen since the end of the Bowden days",
    "created_utc": 1758404008.0
  },
  {
    "body_html": "Welp, who had Clemson going 1-3 to start the year? I sure as hell didn’t LOL🤣",
    "created_utc": 1758404008.0
  },
  {
    "body_html": "You can watch us get our shit kicked in for free at 7 instead!",
    "created_utc": 1758404002.0
  },
  {
    "body_html": "Just saw someone fall to their knees in a Cookout",
    "created_utc": 1758404002.0
  },
  {
    "body_html": "I'd say \"rank Syracuse you cowards\" but given how Clemson played this game I don't think it's that impressive a win.",
    "created_utc": 1758404001.0
  },
  {
    "body_html": "Clemson it was more looking like you were going to win then losing.  Snatching defeat from the jaws of victory.  Not the case here.",
    "created_utc": 1758408021.0
  },
  {
    "body_html": "So not one play away then huh?",
    "created_utc": 1758406288.0
  },
  {
    "body_html": "It took him an annoying amount of time to loose.",
    "created_utc": 1758412596.0
  },
  {
    "body_html": "Lol, I'm laughing at this and I do not get the joke",
    "created_utc": 1758405491.0
  },
  {
    "body_html": "Same thing for tOSU to me. Early rankings damn sure prop teams up",
    "created_utc": 1758406360.0
  },
  {
    "body_html": "🔭",
    "created_utc": 1758404845.0
  },
  {
    "body_html": "Is there an option where they both lose? Asking for a friend",
    "created_utc": 1758405878.0
  },
  {
    "body_html": "I wonder if this still “smells like 2016” 🤣",
    "created_utc": 1758405909.0
  },
  {
    "body_html": "unpack this",
    "created_utc": 1758405168.0
  },
  {
    "body_html": "☝🏿",
    "created_utc": 1758404553.0
  },
  {
    "body_html": "Cuse is likable. Even more so when they beat Clemson.",
    "created_utc": 1758405484.0
  },
  {
    "body_html": "Miami Hurricanes are crying",
    "created_utc": 1758405204.0
  },
  {
    "body_html": "I like you",
    "created_utc": 1758404480.0
  },
  {
    "body_html": "Don’t confuse my feelings or excitement at Clempsun’s loss for approval of Syracuse.",
    "created_utc": 1758404444.0
  },
  {
    "body_html": "Yeahhhhhhh no",
    "created_utc": 1758405994.0
  },
  {
    "body_html": "Feel bad for Steve Angeli",
    "created_utc": 1758404975.0
  },
  {
    "body_html": "Nah. He had his legendary run, now hes the cause of his own downfall",
    "created_utc": 1758404622.0
  },
  {
    "body_html": "No.",
    "created_utc": 1758404576.0
  },
  {
    "body_html": "no",
    "created_utc": 1758404425.0
  },
  {
    "body_html": "No",
    "created_utc": 1758404347.0
  },
  {
    "body_html": "Not watching the game. Is he actually crying?",
    "created_utc": 1758404271.0
  },
  {
    "body_html": "Nah, Clemsoning is giving a winnable game away. This game was never winnable for Clemson. Syracuse went into their house and was flat out better from start to finish.",
    "created_utc": 1758464867.0
  },
  {
    "body_html": "This isn’t clemsoning",
    "created_utc": 1758404328.0
  },
  {
    "body_html": "You can't fire Dabo as the AD",
    "created_utc": 1758404304.0
  },
  {
    "body_html": "I'm convinced ESPN is actively trying to encourage people to lose money with their shitty recommendations which are conveniently advertised on their sports book and networks  I don't bet on sports, but I've tracked a few of their recommendations and they are wrong more often than not",
    "created_utc": 1758404365.0
  },
  {
    "body_html": "Technically win out &amp; bowl win is 10 wins so not entirely fucked",
    "created_utc": 1758404327.0
  },
  {
    "body_html": "Worried by what I saw with him in.",
    "created_utc": 1758406342.0
  },
  {
    "body_html": "Give me bowl eligibility and a little more and I will be happy",
    "created_utc": 1758404251.0
  },
  {
    "body_html": "They need to back the Brink’s truck up for him, and put a huge buyout in his contract to try and deter most teams.",
    "created_utc": 1758407651.0
  },
  {
    "body_html": "If he pulls off another 10 win season, I don't think he's staying lol",
    "created_utc": 1758404387.0
  },
  {
    "body_html": "GG Tigers, sincerely hope yall figure it out and ball out",
    "created_utc": 1758404234.0
  },
  {
    "body_html": "\"FUCK YOU, FUCK YOU, AND FUCK YOU\"",
    "created_utc": 1758404234.0
  },
  {
    "body_html": "All we have left is our hate for each other.",
    "created_utc": 1758404359.0
  },
  {
    "body_html": "Who has been saying it's a talent issue?",
    "created_utc": 1758413067.0
  },
  {
    "body_html": "It’s the coordinators and position coaches 100%. He’s built it up on nepotism hires and needs a full reset.",
    "created_utc": 1758404413.0
  },
  {
    "body_html": "Yep its an annoying storyline",
    "created_utc": 1758404234.0
  },
  {
    "body_html": "LFG",
    "created_utc": 1758404153.0
  },
  {
    "body_html": "Venables was absolutely a HUGE part of the success. Scott was a huge part of the offense. I don't think losing them is 100% the issue but it's definitely a big part of it.",
    "created_utc": 1758404218.0
  },
  {
    "body_html": "Defense wise it was.",
    "created_utc": 1758404148.0
  },
  {
    "body_html": "I need someone to ask that in the presser",
    "created_utc": 1758404151.0
  },
  {
    "body_html": "Oh, if you want a funny read... look up Tyler from Spartanburg. <a href=\"https://apnews.com/article/dabo-swinney-caller-radio-angry-clemson-edd83997b6a4d943276ffd040fbd5093\">https://apnews.com/article/dabo-swinney-caller-radio-angry-clemson-edd83997b6a4d943276ffd040fbd5093</a>",
    "created_utc": 1758413198.0
  },
  {
    "body_html": "You mean Disney.",
    "created_utc": 1758404298.0
  },
  {
    "body_html": "Pretty sure he tore his ACL",
    "created_utc": 1758404185.0
  },
  {
    "body_html": "Tripped on grass while cutting. They didn't say but maybe achilles.",
    "created_utc": 1758404156.0
  },
  {
    "body_html": "Non contact, looked like Achilles",
    "created_utc": 1758404149.0
  },
  {
    "body_html": "He probably won’t play the rest of the season. That looked very bad.",
    "created_utc": 1758404137.0
  },
  {
    "body_html": "He will be back next year, strong and more determined.",
    "created_utc": 1758404112.0
  },
  {
    "body_html": "He will blame the transfer portal somehow",
    "created_utc": 1758404165.0
  },
  {
    "body_html": "Tigers are scary",
    "created_utc": 1758404164.0
  },
  {
    "body_html": "And definitely out of the CFP convo.",
    "created_utc": 1758404194.0
  },
  {
    "body_html": "100% we have been outcoached so many times these last two years. The talent is there, the coaching is just fucking abysmal.",
    "created_utc": 1758404123.0
  },
  {
    "body_html": "We still have much love for Coach Fran down here in Athens...was rooting for you guys from kickoff today.",
    "created_utc": 1758404101.0
  },
  {
    "body_html": "Very long weather delay.",
    "created_utc": 1758404121.0
  },
  {
    "body_html": "Clemson weather be wild",
    "created_utc": 1758404066.0
  },
  {
    "body_html": "Weather delay",
    "created_utc": 1758404058.0
  },
  {
    "body_html": "He was a caller that got into it with Dabo on a radio show and Dabo refuses to talk to callers now",
    "created_utc": 1758404217.0
  },
  {
    "body_html": "The beef you needed to hear.  I think it happened in 2023.  Tyler vs. Dabo.  May still be recorded somewhere.",
    "created_utc": 1758404182.0
  },
  {
    "body_html": "A couple years ago a guy from Spartanburg called into a radio show that dabo was on and complained about how dabo was running the program. Dabo proceeded to go on a massive rant about how Clemson fans are spoiled and they should be grateful with the success they’ve had.",
    "created_utc": 1758404144.0
  },
  {
    "body_html": "He’s basically a fan that called in to the radio show when Dabo first started to shit the bed, took him down Broadway on the problems - and Dabo went holier than thou on him",
    "created_utc": 1758404122.0
  },
  {
    "body_html": "Kid who called in on a talk to the coach show and gave him the business. Google for more info",
    "created_utc": 1758404092.0
  },
  {
    "body_html": "Alright Notre Dame, that's on you for finally realizing that. You're better than this",
    "created_utc": 1758404154.0
  },
  {
    "body_html": "First time?",
    "created_utc": 1758404087.0
  },
  {
    "body_html": "Plenty of people not at ESPN said similar things",
    "created_utc": 1758404070.0
  },
  {
    "body_html": "I want a “why has God forsaken me!!!!!” Speech",
    "created_utc": 1758404108.0
  },
  {
    "body_html": "I don't have the heart to be a hate watcher I have seen enough terrible football for one day lol",
    "created_utc": 1758404243.0
  },
  {
    "body_html": "Yall will bounce back we're cooked though",
    "created_utc": 1758404036.0
  },
  {
    "body_html": "Pain.",
    "created_utc": 1758404024.0
  },
  {
    "body_html": "Man I’d kill for some Cookout right now.",
    "created_utc": 1758404027.0
  },
  {
    "body_html": "I mean Notre Dame is 24th with an 0-2 record.   Why not?",
    "created_utc": 1758404058.0
  },
  {
    "body_html": "Clemson…and I’m not exaggerating…May not make a bowl.",
    "created_utc": 1758403086.0
  },
  {
    "body_html": "THEY PUT MY FUCKING HOUSE IN THE ICE COMMERCIAL LMAAAOOOOOO",
    "created_utc": 1758401614.0
  },
  {
    "body_html": "I am one side quest away from 100%ing Red Dead 2. It has taken me 5 years but I just needed to tell someone. Thank you for your time",
    "created_utc": 1758397264.0
  },
  {
    "body_html": "Interviewing Dabo right now is hilarious",
    "created_utc": 1758400983.0
  },
  {
    "body_html": "This team is fantastic, just needs to work on offense, defense, special teams, tackling, running the ball, passing the ball, offensive play calling, defensive play calling, pass blocking, run blocking, catching the ball, scoring points, stopping the other team from scoring points, and coaching",
    "created_utc": 1758401191.0
  },
  {
    "body_html": "Cade \"CHUCK IT UP AND INSHALLAH\" Klubnik",
    "created_utc": 1758403405.0
  },
  {
    "body_html": "Dabo Swinney did not lie when he said he would stop coaching when players began getting paid",
    "created_utc": 1758403663.0
  },
  {
    "body_html": "Isn’t Dabo the one that said if Clemson is tired of winning they can fire him?",
    "created_utc": 1758403936.0
  },
  {
    "body_html": "Clemson really staring 1-3 right in the eyes",
    "created_utc": 1758403979.0
  },
  {
    "body_html": "Now I'm not getting paid what these coaches are, so Im not expert.  But I don't think you can keep trading points for no points",
    "created_utc": 1758398971.0
  },
  {
    "body_html": "Cade Uiagalelei",
    "created_utc": 1758402978.0
  },
  {
    "body_html": "Tyler from Spartanburg is going to be at the paw with boxing gloves postgame",
    "created_utc": 1758403241.0
  },
  {
    "body_html": "Don’t forget - this team is not that far from 0-4  Troy had them on the ropes",
    "created_utc": 1758403920.0
  },
  {
    "body_html": "We should be 0-4, the Troy win was a fluke. Screw this whole team they clearly don't care about anything anymore",
    "created_utc": 1758403982.0
  },
  {
    "body_html": "15-4 overall record for Fran Brown. Incredible.",
    "created_utc": 1758403085.0
  },
  {
    "body_html": "Where is Tyler from Spartansburg when you need him",
    "created_utc": 1758403437.0
  },
  {
    "body_html": "DJ Klubalelei",
    "created_utc": 1758403552.0
  },
  {
    "body_html": "LSU beat them and took Death Valley, Syracuse beats them and takes the color orange, if SCAR beats them they have to leave the state right??",
    "created_utc": 1758403732.0
  },
  {
    "body_html": "Getting booed at home has got to be the most demoralizing thing ever",
    "created_utc": 1758400714.0
  },
  {
    "body_html": "This game would be over if we just ran it both those third downs",
    "created_utc": 1758403224.0
  },
  {
    "body_html": "Crazy to think Clemson and VT will have the same record",
    "created_utc": 1758403447.0
  },
  {
    "body_html": "I'm still clenching, won't believe the W until it's 0:00 and we have more points",
    "created_utc": 1758403502.0
  },
  {
    "body_html": "No lighting delay this team is probably 0-4 losing to Troy",
    "created_utc": 1758403957.0
  },
  {
    "body_html": "The dozen people left in the stadium booing Clemson for a turnover on downs while losing by 20 points... glorious",
    "created_utc": 1758400757.0
  },
  {
    "body_html": "Clemson has had more lighting delays than wins this season. We’re entering Week 5 next week",
    "created_utc": 1758403360.0
  },
  {
    "body_html": "He was right, 1-2 isn't that bad. 1-3 is much worse",
    "created_utc": 1758403877.0
  },
  {
    "body_html": "What Dabo's narrative should be after the game: \"We need to start looking internally because things aren't clicking like they used to and we need to make changes and that's on me.\" But that won't be his narrative.",
    "created_utc": 1758403915.0
  },
  {
    "body_html": "I mean, he did say 6-6 was a possibility in his rant. When someone tells you who they really are, believe them.",
    "created_utc": 1758401148.0
  },
  {
    "body_html": "WHY ARE YOU CALLING PASSES WITH A BACKUP QB IN THE GAME ARE YOU TRYING TO LOSE",
    "created_utc": 1758402568.0
  },
  {
    "body_html": "Cade looks worse this season than he did as a Freshman. Hes missing wide open WRs all day long.",
    "created_utc": 1758403053.0
  },
  {
    "body_html": "460 yards of offense and only 3 scores is crazy",
    "created_utc": 1758403068.0
  },
  {
    "body_html": "Cade \"hospital ball\" klubnik",
    "created_utc": 1758403362.0
  },
  {
    "body_html": "It’s Dabover",
    "created_utc": 1758403735.0
  },
  {
    "body_html": "<h1>FACT</h1>  Clemson issue is <strong>NOT</strong> the portal, they are ranked NUMBER 7 in the team talent composite.   The issue is that they do not develop good players anymore, and the offensive game plan is comically bad.   For example, they have a higher team talent composite than A&amp;M, ND, Florida Tennessee. USC  IT IS NOT THE PORTAL the coaching is terrible",
    "created_utc": 1758403809.0
  },
  {
    "body_html": "Can't wait to see Dabo gaslight after this one. \"You guys are spoiled, I'm still not going to the beach!\"",
    "created_utc": 1758403938.0
  },
  {
    "body_html": "Dabo obviously shouldn't be fired, but he should <em>absolutely</em> be under an enormous amount of pressure to make serious changes.  And if he stubbornly refuses... Then the seat's gotta start getting warm. Especially if Clemson wins up not being bowl eligible, and that's on the table after today.",
    "created_utc": 1758403949.0
  },
  {
    "body_html": "I think the “rules experts” that they have on all these broadcasts are probably wrong with their analysis over 60% of the time.",
    "created_utc": 1758400373.0
  },
  {
    "body_html": "If there is anything less than full and total accountability from Dabo Swinney following today's game I am joining the hot seat club.  I dont mind losing, even to Cuse. But getting run out at home like this and going 1-3 isnt going to cut it. Even for Dabo.",
    "created_utc": 1758401169.0
  },
  {
    "body_html": "Tyler from Spartanburg should be guaranteed a minute of call time for every point Clemson loses by.",
    "created_utc": 1758402094.0
  },
  {
    "body_html": "So whats the main sports radio call in show for Clemson football?",
    "created_utc": 1758403388.0
  },
  {
    "body_html": "can't wait for this presser",
    "created_utc": 1758403874.0
  },
  {
    "body_html": "“what will the next narrative be from their head coach?” commentators calling Dabo out lol",
    "created_utc": 1758403876.0
  },
  {
    "body_html": "Clemson is really fortunate they balled out for 1 quarter against Troy.",
    "created_utc": 1758400794.0
  },
  {
    "body_html": "This has to be a wake up call for Dabo, right? His pedigree absolutely affords him the grace to do it his way, but for how long? If he doesn't change how he does things after this season, Id think he is genuinely crazy.",
    "created_utc": 1758401005.0
  },
  {
    "body_html": "Guys I’m starting think cade Klubnik isn’t going in the first round in April lmao",
    "created_utc": 1758401068.0
  },
  {
    "body_html": "There's a Tyler somewhere in South Carolina that is probably cackling like a maniac right now.",
    "created_utc": 1758401104.0
  },
  {
    "body_html": "We seriously might be one of the worst coached teams in a P4 conference. Guys seemingly dont know who to block, recievers frequently lost on routes especially when the qb scrambles, cade late on reads, the punt fuckup earlier, dbs with zero clue of what do do when the ball is in the air, horrible playcalling on both sides. A lot of the issues might be talent related but if the coaching was actually good many of these things arent problems",
    "created_utc": 1758401208.0
  },
  {
    "body_html": "Tyler from Spartanburg is the only man who can save this program",
    "created_utc": 1758401443.0
  },
  {
    "body_html": "Even accounting for the delay, is this game moving at a snail's pace to anyone else?",
    "created_utc": 1758401981.0
  },
  {
    "body_html": "Cade Turndaballova Uiagalelei",
    "created_utc": 1758403053.0
  },
  {
    "body_html": "guys i think they’re gonna pass",
    "created_utc": 1758403438.0
  },
  {
    "body_html": "Dabo owes the fans an apology in his presser",
    "created_utc": 1758403661.0
  },
  {
    "body_html": "3-17 on third and fourth downs. 💀",
    "created_utc": 1758403763.0
  },
  {
    "body_html": "The post-game presser is gonna be wild.",
    "created_utc": 1758403920.0
  },
  {
    "body_html": "Clemson losing out the rest of the season would be less embarrassing than joining ICE",
    "created_utc": 1758401576.0
  },
  {
    "body_html": "So lemme get this straight, Syracuse QB's went down and the very next thing that happened is the defense gets a turnover inside the 20 and the very NEXT thing that happened is the backup QB throws a TD pass so accurate it goes right to the WR's crotch before he even realizes the ball is in the air?",
    "created_utc": 1758400470.0
  },
  {
    "body_html": "Shoutout to the forgotten Kelly Bryant season between Deshaun and Trevor",
    "created_utc": 1758401665.0
  },
  {
    "body_html": "Syracuse dropped two passes and also snapped the ball when the playclock was at 20 seconds and the clock was running. Gave Clemson 100 seconds of time for free.",
    "created_utc": 1758402732.0
  },
  {
    "body_html": "This was your Heisman hopeful?",
    "created_utc": 1758402983.0
  },
  {
    "body_html": "Can’t wait to hear Dabo’s “a few plays away”, “this is a good team”, “loved to see their fight”, “look what I did 8 years ago” post game press conference",
    "created_utc": 1758403122.0
  },
  {
    "body_html": "As much as Cade sucks, I think this is a bigger statement on Riley…. He’s done after this season. The fact that Cade has regressed so bad and apperantly we don’t have any QBs that we even trust to compete is a poor showing",
    "created_utc": 1758403123.0
  },
  {
    "body_html": "Fran brown and Syracuse are doing everything they can to lose the game and Clemson is so lifeless they can’t even threaten to capitalize on it",
    "created_utc": 1758403383.0
  },
  {
    "body_html": "Dabo: If they want me gone they can tell me to go  Clemson AD: Hold my beer",
    "created_utc": 1758403621.0
  },
  {
    "body_html": "I need to hear from Tyler from Spartanburg after this game",
    "created_utc": 1758403827.0
  },
  {
    "body_html": "Lmao these commentators are not holding back😂",
    "created_utc": 1758403890.0
  },
  {
    "body_html": "Can't wait to see the two fans that meet at the paw",
    "created_utc": 1758403927.0
  },
  {
    "body_html": "Can't wait to hear Dabo blame everyone but Dabo.",
    "created_utc": 1758403935.0
  },
  {
    "body_html": "This team is fucking pathetic",
    "created_utc": 1758399982.0
  },
  {
    "body_html": "The rules analyst def posts anonymously on Reddit threads",
    "created_utc": 1758400430.0
  },
  {
    "body_html": "Actually I was wrong. Not even that bad of a play by klubnik. The left tackle competely whiffed his block, huge gain if he doesnt",
    "created_utc": 1758400747.0
  },
  {
    "body_html": "Klubnik really showing he’s got what it takes to be the Browns’ next 1st round pick",
    "created_utc": 1758400749.0
  },
  {
    "body_html": "LSU is watching their one quality win disappear.",
    "created_utc": 1758400957.0
  },
  {
    "body_html": "Cade is toast.  Let him redshirt and transfer at this point.  You've got to try something else at this point or at least start working on the future.    Wrong reads, missing open guys, missing throws, turnovers. He's regressed to his first year starting",
    "created_utc": 1758400974.0
  },
  {
    "body_html": "Death Valley cleared out so thoroughly I can hear 3rd Deck Clemson Karen clearly.",
    "created_utc": 1758402032.0
  },
  {
    "body_html": "I don’t think Clemson is going to cover.",
    "created_utc": 1758402139.0
  },
  {
    "body_html": "Just remember guys: to win games you have to win the game.",
    "created_utc": 1758402265.0
  },
  {
    "body_html": "Syracuse are selling so hard rn. They’re gonna have to hope Clemson sell themselves.",
    "created_utc": 1758402789.0
  },
  {
    "body_html": "Damn so Clemson stinks",
    "created_utc": 1758402988.0
  },
  {
    "body_html": "The downfall of the Tigers this month",
    "created_utc": 1758402988.0
  },
  {
    "body_html": "Every big QB spent the summer mainlining their own hype apparently",
    "created_utc": 1758403012.0
  },
  {
    "body_html": "Oh yes. Give me the exit shots",
    "created_utc": 1758403066.0
  },
  {
    "body_html": "Has there been a worse 1-2 QB hype that turned out so poorly? Between Cade and Arch its so rough.",
    "created_utc": 1758403070.0
  },
  {
    "body_html": "17 YEAR OLD MENTIONED",
    "created_utc": 1758403278.0
  },
  {
    "body_html": "Damn prevent defense",
    "created_utc": 1758403433.0
  },
  {
    "body_html": "\"Dabo sucks, he was only good because of hiring decisions and recruiting.\"  (There was an era where those were more important than NIL or the portal).",
    "created_utc": 1758403539.0
  },
  {
    "body_html": "Did ND and Clemson just agree to a 12 year series of games and wer'e both suddenly becoming shitty teams again?",
    "created_utc": 1758403712.0
  },
  {
    "body_html": "Syracuse not fucking the running the ball there ended up not mattering because Clemson is just that much of a fuckup.",
    "created_utc": 1758403769.0
  },
  {
    "body_html": "To be fair, a 1-3 start is WAY worse than a 1-2 start. So Dabo was right",
    "created_utc": 1758403833.0
  },
  {
    "body_html": "I hope Klubnik picked a useful degree because at this rate he’s not going to be suiting up in the NFL",
    "created_utc": 1758403896.0
  },
  {
    "body_html": "Cade and Arch couldn't start a community college flag football game",
    "created_utc": 1758403907.0
  },
  {
    "body_html": "Can we please see Vizzina next game? Cade just ain't it  What's the worst that can happen? Cade gets his feelings hurt and doesn't play well if he comes back in?  He ain't playing well now",
    "created_utc": 1758403938.0
  },
  {
    "body_html": "Dabo is now concentrating on his post game presser.",
    "created_utc": 1758403977.0
  },
  {
    "body_html": "This guy so confidently saying he can clearly see is so full of shit.",
    "created_utc": 1758400338.0
  },
  {
    "body_html": "apologize for bad english   clemson is kill",
    "created_utc": 1758401377.0
  },
  {
    "body_html": "Tyler from Spartanburg in his mom’s basement pounding the heavy bag to prepare for the parking lot brawl next week.",
    "created_utc": 1758401378.0
  },
  {
    "body_html": "There's literally no reason to believe ICE would give you any of the benefits they're claiming",
    "created_utc": 1758401616.0
  },
  {
    "body_html": "hahahahahahaahahahahahahahahahahahahaha fire everyone",
    "created_utc": 1758400147.0
  },
  {
    "body_html": "Lo though I walk through the valley of death I fear no evil for Fran art with me",
    "created_utc": 1758400745.0
  },
  {
    "body_html": "Dabo is about to have a come apart.",
    "created_utc": 1758400995.0
  },
  {
    "body_html": "Who tf is Tyler from Spartanburg can someone enlighten me here",
    "created_utc": 1758401524.0
  },
  {
    "body_html": "Way back when Scott Shafer was our head coach, there was a pivotal 4th down in the dome and Syracuse went for it on offense. The camera focused on Shafer as he very clearly said “fuck you, Dabo” and then spit.   We would go on to lose the game. Classic Scott Shafer.",
    "created_utc": 1758406512.0
  },
  {
    "body_html": "fair, their only real win was by 7 points over a texas who’s ranked #8 but doesn’t really look like a top 10 team.",
    "created_utc": 1758414098.0
  },
  {
    "body_html": "That would require going back in time 5 years",
    "created_utc": 1758420961.0
  },
  {
    "body_html": "Is Clemson tired of winning?",
    "created_utc": 1758406064.0
  },
  {
    "body_html": "I grew up going to SU games in the Mcnabb era. I don’t hate Miami as much as I used to but still don’t like them",
    "created_utc": 1758421621.0
  },
  {
    "body_html": "Hurtful 😔💔 I expect it from Georgia fans",
    "created_utc": 1758404601.0
  },
  {
    "body_html": "Is that how you guys spell it? Really? We always went with \"Climpson\". 😂",
    "created_utc": 1758405527.0
  },
  {
    "body_html": "He was definitely holding back tears",
    "created_utc": 1758404670.0
  },
  {
    "body_html": "It genuinely looked like he was chocking them back",
    "created_utc": 1758404650.0
  },
  {
    "body_html": "Every loss.... there's PLENTY of material for jokes, and they still cannot get it right.",
    "created_utc": 1758412900.0
  },
  {
    "body_html": "100% they want the the tv heads to say random bullshit, of course they dont want them saying actual good advice for betting",
    "created_utc": 1758411961.0
  },
  {
    "body_html": "Most of the people on that show are terrible. Erin Dolan is the only one who wins. Joe is bad but Tyler and Anita lose almost every bet. Just bet the opposite and you will win",
    "created_utc": 1758404536.0
  },
  {
    "body_html": "Only regular season games count",
    "created_utc": 1758404374.0
  },
  {
    "body_html": "I don't think that will happen if angeli is done",
    "created_utc": 1758406375.0
  },
  {
    "body_html": "Wish we could post gifs, lol",
    "created_utc": 1758406405.0
  },
  {
    "body_html": "Literally everyone, including Saban today",
    "created_utc": 1758413081.0
  },
  {
    "body_html": "That fucking sucks",
    "created_utc": 1758404196.0
  },
  {
    "body_html": "Clemson should be on life support.  Those coaches have some of the finest tools available, and they are putting shit together like a preschooler with paste and popsicle sticks.",
    "created_utc": 1758413654.0
  },
  {
    "body_html": "It will be cathartic!",
    "created_utc": 1758404282.0
  },
  {
    "body_html": "Point taken.",
    "created_utc": 1758404156.0
  },
  {
    "body_html": "We are literally like 36 in the AP Poll. Unfortunately you don't get the credit like LSU",
    "created_utc": 1758404039.0
  },
  {
    "body_html": "Their one win is a comeback against powerhouse Troy.",
    "created_utc": 1758404048.0
  },
  {
    "body_html": "Clemson hold all damn day I mean come on.  Make up call I guess.",
    "created_utc": 1758401850.0
  },
  {
    "body_html": "I feel like TJ Moore has a condition where his hands and feet excrete butter.",
    "created_utc": 1758402008.0
  },
  {
    "body_html": "i feel for syracuse fans who still feel a bit of nerves. but let me reassure you, this game was over a while ago.",
    "created_utc": 1758402267.0
  },
  {
    "body_html": "Syracuse is really playing like they dont want to win.",
    "created_utc": 1758402611.0
  },
  {
    "body_html": "Syracuse is doing everything they can to make sure Clemson still has a chance",
    "created_utc": 1758402659.0
  },
  {
    "body_html": "Remarkably stupid playcalling. You're <em>probably</em> not going to convert 3rd and 13, why risk the incompletion?",
    "created_utc": 1758402670.0
  },
  {
    "body_html": "Klubniks deep ball has not looked good",
    "created_utc": 1758402853.0
  },
  {
    "body_html": "Cade Klubnik is straight ass",
    "created_utc": 1758402945.0
  },
  {
    "body_html": "I’m so excited for the Dabo presser this week",
    "created_utc": 1758402952.0
  },
  {
    "body_html": "dude I don't even have any alcohol in my house right now why would you do this to me",
    "created_utc": 1758402987.0
  },
  {
    "body_html": "Cade “DJ” Klubnik",
    "created_utc": 1758403019.0
  },
  {
    "body_html": "Klubnick transferring to UF confirmed",
    "created_utc": 1758403059.0
  },
  {
    "body_html": "EXTEND FRAN BROWN",
    "created_utc": 1758403060.0
  },
  {
    "body_html": "Syracuse OC should get the rubber hose treatment for even calling a pass play in the last 6 minutes.",
    "created_utc": 1758403187.0
  },
  {
    "body_html": "I understand wanting to give him reps but just run the damn ball",
    "created_utc": 1758403202.0
  },
  {
    "body_html": "Why would you throw there? Syracuse is doing their best to barely keep us in it",
    "created_utc": 1758403218.0
  },
  {
    "body_html": "3 runs and eat clock what the fuck is difficult about that to grasp?",
    "created_utc": 1758403219.0
  },
  {
    "body_html": "Klubnik is going to finish the game with 55+ pass attempts despite his running back looking unstoppable and averaging 8ypc",
    "created_utc": 1758403327.0
  },
  {
    "body_html": "I hope the \"I woke up feeling the cheesiest, coach!\" commercial never goes away. It's been a daily vocal stim for years at this point.",
    "created_utc": 1758403657.0
  },
  {
    "body_html": "Klubnik is caught in that great area where he is struggling with accuracy, and then his receivers are dropping it when he is actually accurate.",
    "created_utc": 1758403740.0
  },
  {
    "body_html": "\"fuck it someone has to be down there\" -Clemson on 3rd and 4th downs",
    "created_utc": 1758403757.0
  },
  {
    "body_html": "Clemson catching an L on their bye week from the Dabo presser where he blames the culture in America and toxic expectations for why this is happening",
    "created_utc": 1758403830.0
  },
  {
    "body_html": "“Well dagnabbit I guess I’ll just take my lil’ ol’ self somewhere else. I won’t be sittin’ on no lil’ ol’ beach goshdarnit. I’ll take myself to some other school to hoodwink them with my antiquated approach in the new world of college football.”",
    "created_utc": 1758403873.0
  },
  {
    "body_html": "Couldn't happen to a more unlikeable coach.",
    "created_utc": 1758403889.0
  },
  {
    "body_html": "And this is why preseason rankings are a joke.",
    "created_utc": 1758403901.0
  },
  {
    "body_html": "WWE on ESPN is weird, y’all",
    "created_utc": 1758403917.0
  },
  {
    "body_html": "This team is ass, bro",
    "created_utc": 1758403920.0
  },
  {
    "body_html": "God I love these serious legit sports commentators having to hype silly fake wrasslin",
    "created_utc": 1758403970.0
  },
  {
    "body_html": "Cade Klubnik has tanked his NFL stock so much this year",
    "created_utc": 1758402233.0
  },
  {
    "body_html": "<strong>HEY IF YOU DONT WANT US IN THE CHEEZ-ITZ BOWL THEN ILL JUST LEAVE</strong> - Dabo in about 30 minutes",
    "created_utc": 1758402558.0
  },
  {
    "body_html": "That announcer is trying desperately to make it look like that was a great defensive plays, but the fact is Cade had an easy pitch to the HB for a wide-open first down and the QB fuckin blew the read and/or tried to play hero ball.",
    "created_utc": 1758400780.0
  },
  {
    "body_html": "Imagine waiting out the weather and coming back to this",
    "created_utc": 1758400832.0
  },
  {
    "body_html": "LSU struggled to beat this team 🤣",
    "created_utc": 1758400837.0
  },
  {
    "body_html": "In Dabo’s defense he’s not a bad coach given his successes but I think he’s lost his fastball.",
    "created_utc": 1758400875.0
  },
  {
    "body_html": "They are not managing the clock well  32 seconds off the clock through 2 plays",
    "created_utc": 1758402447.0
  },
  {
    "body_html": "Bruh you have got to be fucking kidding me",
    "created_utc": 1758402655.0
  },
  {
    "body_html": "Two drops have cost Syracuse about a minute and half of clock. Wild stuff. I'd argue throwing on that down period was a dumb call though.",
    "created_utc": 1758402686.0
  },
  {
    "body_html": "3 man rush is surrender what the fuck syracuse",
    "created_utc": 1758402804.0
  },
  {
    "body_html": "Cade is just missing. Guys are open.",
    "created_utc": 1758402898.0
  },
  {
    "body_html": "We really need to move on from Cade. Seasons over, he isn’t putting points up. Get some one some reps for next season",
    "created_utc": 1758403043.0
  },
  {
    "body_html": "Ooof, the stands shot of people leaving in droves …",
    "created_utc": 1758403079.0
  },
  {
    "body_html": "Getting beaten by an ipad kid smh /s",
    "created_utc": 1758403080.0
  },
  {
    "body_html": "Run the damn clock to end the game already.",
    "created_utc": 1758403199.0
  },
  {
    "body_html": "Clemson is still holding like crazy.",
    "created_utc": 1758403349.0
  },
  {
    "body_html": "Cuse is laying lumber",
    "created_utc": 1758403352.0
  },
  {
    "body_html": "Tigernet probably about to break",
    "created_utc": 1758403537.0
  },
  {
    "body_html": "Northeast needs a major college team. There are some potential contenders but Cuse is the only one with tradition. I hope this is the start of their climb. Hopefully they have rich boosters.",
    "created_utc": 1758403600.0
  },
  {
    "body_html": "This whole game has been Cade having pressure in his face and him heaving the ball up.",
    "created_utc": 1758403728.0
  },
  {
    "body_html": "Big if, but if this beating serves as a wake-up call for Clemson, we'd owe Fran Brown twice.",
    "created_utc": 1758403762.0
  },
  {
    "body_html": "Put Clemson out of their misery already. It’s been 5 1/2 hours of putrid football on their end.",
    "created_utc": 1758403778.0
  },
  {
    "body_html": "Well Clemson fans see you at 7:00 for our turn to get killed",
    "created_utc": 1758403800.0
  },
  {
    "body_html": "🟧🟧🟧",
    "created_utc": 1758403857.0
  },
  {
    "body_html": "Why can’t we have a win that doesn’t get laughed off afterwards",
    "created_utc": 1758403904.0
  },
  {
    "body_html": "Can we use the tariff money to pay for Dabos buyout?",
    "created_utc": 1758403947.0
  },
  {
    "body_html": "Why is God not orchestrating a Clemson comeback?",
    "created_utc": 1758403964.0
  },
  {
    "body_html": "Are we the worst top 5 preseason team of all time?",
    "created_utc": 1758403072.0
  },
  {
    "body_html": "I’m watching on the ESPN app on my phone and just got an ad for joining ICE. Fuck off.",
    "created_utc": 1758401549.0
  },
  {
    "body_html": "Clemson O Line been holding all day. About time.",
    "created_utc": 1758403417.0
  },
  {
    "body_html": "Dabo was a Venables and Jeff Scott merchant tbh",
    "created_utc": 1758403445.0
  },
  {
    "body_html": "Prediction: Billy Napier is fired in the locker room after getting demolished by Miami. Florida boosters call Clemson boosters, pay Dabo’s buyout clause, and Dabo is your next Florida head coach.",
    "created_utc": 1758403935.0
  },
  {
    "body_html": "I hope this game never ends.",
    "created_utc": 1758393790.0
  },
  {
    "body_html": "1-3 for the first time since 2004  Congratulations Dabo. You've brought us back to the Bowden era.",
    "created_utc": 1758400350.0
  },
  {
    "body_html": "If I had a nickel for each time that a person I didn’t like proceeded to get bodied after claiming people are “getting tired of winning”, I’d have two nickels, which is not a lot but fuck Clemson lol.",
    "created_utc": 1758400525.0
  },
  {
    "body_html": "Our Tight End making stops, I am sick",
    "created_utc": 1758400747.0
  },
  {
    "body_html": "As an outsider looking in, I think Dabo's responses in his pressers after this game set his tone for the \"hotseat\" conversation.",
    "created_utc": 1758401271.0
  },
  {
    "body_html": "There’s absolutely no way dabo gets fired even if this season ends in a complete disaster. But Clemson fans correct me if I’m wrong here",
    "created_utc": 1758401824.0
  },
  {
    "body_html": "Dude is just spamming spin moves",
    "created_utc": 1758401958.0
  },
  {
    "body_html": "Really hope we can burn some clock on offense",
    "created_utc": 1758402010.0
  },
  {
    "body_html": "2 score game with a backup in. Not over by any stretch",
    "created_utc": 1758402236.0
  },
  {
    "body_html": "Yepppp we're losing this. Lol.",
    "created_utc": 1758402672.0
  },
  {
    "body_html": "Syracuse really testing the theory of prevent defense preventing wins",
    "created_utc": 1758402840.0
  },
  {
    "body_html": "‘Here Clemson you can win this game by 1’  ‘No thanks’",
    "created_utc": 1758402870.0
  },
  {
    "body_html": "Please ban all Klub sandwiches in a 50 mile radius from Clemson",
    "created_utc": 1758402966.0
  },
  {
    "body_html": "You cannot be as hyped as Klubnik and have those two plays back to back in the biggest moments of the game.",
    "created_utc": 1758402987.0
  },
  {
    "body_html": "This 2026 QB class was always hideously overrated but it’s honestly worse than I could imagine.",
    "created_utc": 1758403012.0
  },
  {
    "body_html": "Cuse should run a flea flicker or other trick plays just to rub it in.",
    "created_utc": 1758403023.0
  },
  {
    "body_html": "TigerNet server going to crash tonight.",
    "created_utc": 1758403029.0
  },
  {
    "body_html": "Cade needs to be benched lol. Dabo gonna explode when Tyler calls in",
    "created_utc": 1758403033.0
  },
  {
    "body_html": "This game feels so much different if they take the 6 points from the two failed 4th down attempts",
    "created_utc": 1758403033.0
  },
  {
    "body_html": "Let’s go Cuse!! Fran brown is HIM",
    "created_utc": 1758403036.0
  },
  {
    "body_html": "Klubnik is so bad…how is he this bad…",
    "created_utc": 1758403049.0
  },
  {
    "body_html": "Where's Tyler from Spartanburg when you need him?",
    "created_utc": 1758403211.0
  },
  {
    "body_html": "Honestly Syracuse deserves to lose this lmao",
    "created_utc": 1758403220.0
  },
  {
    "body_html": "Dabo tried his hardest to fight against modern football landscape. And it's really caught up to him. Wonder if he hits the portal far harder this off season.",
    "created_utc": 1758403320.0
  },
  {
    "body_html": "Clemson at 17.5 was the easiest money I’ve made in a long time",
    "created_utc": 1758403340.0
  },
  {
    "body_html": "This is why it is so hard to predict college football now with the transfer portal and NIL. There is so much turnover every year. Just look at the ACC  Fla St terrible last year looks great  Cal terrible last year looks great  Syracuse lost everyone on offense but clearly retooled  Clemson and SMU the top 2 teams in ACC last year don't look good at all",
    "created_utc": 1758403355.0
  },
  {
    "body_html": "Jesus the holds",
    "created_utc": 1758403361.0
  },
  {
    "body_html": "The fortress is taken, it is over",
    "created_utc": 1758403437.0
  },
  {
    "body_html": "Dabo’s team has given up on him.",
    "created_utc": 1758403515.0
  },
  {
    "body_html": "I heard Dabo sold his naming rights, too  \"Dabo Sweeney Waste Management Hot Trash Division\"",
    "created_utc": 1758403629.0
  },
  {
    "body_html": "I will 100% bark at my boss on a Saturday.",
    "created_utc": 1758403643.0
  },
  {
    "body_html": "So this is gonna be like, a 2 or 3 win season huh",
    "created_utc": 1758403649.0
  },
  {
    "body_html": "Cade is so scared of being blitzed",
    "created_utc": 1758403709.0
  },
  {
    "body_html": "Lmao at Clemson doing both of their keys to the game and still getting wallopped",
    "created_utc": 1758403722.0
  },
  {
    "body_html": "Alright i wanna see three passes here syracuse",
    "created_utc": 1758403752.0
  },
  {
    "body_html": "I literally might tune in to a head coach post game press conference live for the first time ever",
    "created_utc": 1758403757.0
  },
  {
    "body_html": "Dabo, hopefully this is the ass kicking needed to get on with the times",
    "created_utc": 1758403781.0
  },
  {
    "body_html": "What will Dabo's excuses be post-game? It isn't his fault, we do know that.",
    "created_utc": 1758403848.0
  },
  {
    "body_html": "Ooooh I've seen that.  Totally didn't get the context.",
    "created_utc": 1758406575.0
  },
  {
    "body_html": "<blockquote> going to SU </blockquote>  SU?",
    "created_utc": 1758422258.0
  },
  {
    "body_html": "They've been saying that for not making it back to the championship, but it in no way explains the complete catastrophe we are in.  This season is explainable if you recruit like Wofford, not if you are consistantly in the top 7.",
    "created_utc": 1758414171.0
  },
  {
    "body_html": "Kinda sad to see death valley turn into just another place to play",
    "created_utc": 1758403868.0
  },
  {
    "body_html": "Serious question, wasn't Klubnik the preseason heisman favorite?",
    "created_utc": 1758403910.0
  },
  {
    "body_html": "This game film is going to flag Dabo’s Covenant Eyes with the pounding Cuse gave them",
    "created_utc": 1758403944.0
  },
  {
    "body_html": "John Cena vs Bork Laser. What is this 2010",
    "created_utc": 1758403973.0
  },
  {
    "body_html": "Fuck ICE",
    "created_utc": 1758401535.0
  },
  {
    "body_html": "You know, losing to FSU week 1 felt a bit embarrassing, but in perspective, I don’t feel so bad about our troubles. Clemson has turned to straight ass.",
    "created_utc": 1758401757.0
  },
  {
    "body_html": "He has control of the ball with his legs",
    "created_utc": 1758400218.0
  },
  {
    "body_html": "Defense has been insane. Looks way better than last year. Turns out Tennessee’s offense has been better than expected as well.",
    "created_utc": 1758400718.0
  },
  {
    "body_html": "Glad we aren’t the only South Carolina team who got blown out at home by an unranked opponent",
    "created_utc": 1758400827.0
  },
  {
    "body_html": "lmao he’s pissed",
    "created_utc": 1758401000.0
  },
  {
    "body_html": "Go man, full blitz, every play",
    "created_utc": 1758401026.0
  },
  {
    "body_html": "At what point do players like Woods consider shutting it down to prepare for the draft?",
    "created_utc": 1758401260.0
  },
  {
    "body_html": "KdB getting fired and Swinney going to Tuscaloosa.",
    "created_utc": 1758401471.0
  },
  {
    "body_html": "That’s holding on the OL fuck off",
    "created_utc": 1758401831.0
  },
  {
    "body_html": "Unless Dabo builds a Time Machine…I think they’re cooked",
    "created_utc": 1758401882.0
  },
  {
    "body_html": "Sorry to come in as I know we’re gonna get destroyed by Ole Miss next week, but I wonder what grade Dabo would give Syracuse",
    "created_utc": 1758401938.0
  },
  {
    "body_html": "Hey they’re finally using that huge receiver they took in the portal",
    "created_utc": 1758402075.0
  },
  {
    "body_html": "Flipped over to the Clemson game during the break of Michigan Nebraska and holy shit  I feel so bad for Klubnik  Constant free rushers in his face, receivers have stones for hands, they can't run routes and Garrett Riley doesn't know what a pre snap motion is  I think Klubnik is a good quarterback but the offense as a unit is dysfunctional  Regardless of the outcome",
    "created_utc": 1758402213.0
  },
  {
    "body_html": "Remember when Syracuse managed an onside kick in the first quarter which was forever ago",
    "created_utc": 1758402248.0
  },
  {
    "body_html": "Without Wesco our offense would have like 14 points this year.",
    "created_utc": 1758402264.0
  },
  {
    "body_html": "Syracuse keeping Clemson in this by not running the ball",
    "created_utc": 1758402607.0
  },
  {
    "body_html": "These announcers really need to stop getting ahead of themselves.",
    "created_utc": 1758402672.0
  },
  {
    "body_html": "Should’ve made Clemson waste another timeout",
    "created_utc": 1758402685.0
  },
  {
    "body_html": "You can tell who is just tuning in now by who is worried Syracuse might blow this",
    "created_utc": 1758402695.0
  },
  {
    "body_html": "that was a terrible play call on a down and distance you arent going to pick up anyway.",
    "created_utc": 1758402721.0
  },
  {
    "body_html": "From Heisman frontrunner to Backup in four weeks. Youre up Vizzina",
    "created_utc": 1758402972.0
  },
  {
    "body_html": "2025 CLEMSON <del>PLAYOFF LOCK</del> FIGHTING FOR BOWL ELIGIBILITY",
    "created_utc": 1758402975.0
  },
  {
    "body_html": "I’m not sure about Cade’s heisman chances now.",
    "created_utc": 1758402984.0
  },
  {
    "body_html": "Presbyterian might be the best team in SC lol",
    "created_utc": 1758403009.0
  },
  {
    "body_html": "What is with the insane QB regression at Clemson. What are you doing to them over there?!",
    "created_utc": 1758403020.0
  },
  {
    "body_html": "I remember watching Klubnik when he was a freshmen and thinking about how good his future will be... missed on that one",
    "created_utc": 1758403034.0
  },
  {
    "body_html": "Trevor Lawrence legacy grows by the day",
    "created_utc": 1758403047.0
  },
  {
    "body_html": "Maybe when we were told Klubnik, Manning, etc were first round picks they meant the CFL",
    "created_utc": 1758403127.0
  },
  {
    "body_html": "Why hello there fellow top 10 preseason implosion",
    "created_utc": 1758403152.0
  },
  {
    "body_html": "Why would you throw it there? The hell???",
    "created_utc": 1758403168.0
  },
  {
    "body_html": "Should be 2:00 left on the clock if cuse simply ran the last two drives",
    "created_utc": 1758403198.0
  },
  {
    "body_html": "Fran Brown on Clemson being favored by 17.5 points: \"I don't care about what Vegas says,\" he said. \"I've been an under dog my whole life.\"",
    "created_utc": 1758403206.0
  },
  {
    "body_html": "Mike Gundy to Clemson, Dabo to Liberty",
    "created_utc": 1758403268.0
  },
  {
    "body_html": "[deleted]",
    "created_utc": 1758403277.0
  },
  {
    "body_html": "Klubnik is the same guy he was as a true freshman. Better mobility and pocket awareness, but the same QB when it’s time to throw",
    "created_utc": 1758403326.0
  },
  {
    "body_html": "This is like a reward after Dabo's rant.",
    "created_utc": 1758403347.0
  },
  {
    "body_html": "There are at least 30 other quarterbacks I would take before Cade Klubnik, and I am 100% under-estimating that number. He is actually awful. DJU was bad at *some* points, mostly because he let mental stuff get to him. Also he did not have a supporting cast and coaches to help him be his best. Cade isn't bad, he's actually awful.",
    "created_utc": 1758403370.0
  },
  {
    "body_html": "Should really stop calling plays where everyone is right at or short of the sticks.",
    "created_utc": 1758403414.0
  },
  {
    "body_html": "Bruh why do i hate watch to the end every week",
    "created_utc": 1758403527.0
  },
  {
    "body_html": "Give Fran a lifetime contract",
    "created_utc": 1758403532.0
  },
  {
    "body_html": "If Syracuse wins every team in America should be forced to change their name to a color. Oklahoma state chartreuse has a good ring to it",
    "created_utc": 1758403549.0
  },
  {
    "body_html": "the acc powerhouse ad rn is funny",
    "created_utc": 1758403577.0
  },
  {
    "body_html": "I feel like I’ve been watching this game all day",
    "created_utc": 1758403579.0
  },
  {
    "body_html": "I really wouldn’t be shocked if Clemson and Dabo part ways in the next few years, not sure whether it will be mutual or he’s forced out. Probably not happening this year but I’m starting to think if Dabo even wants to be there anymore. It just seems like he is uninterested in changing things and I feel like I could see him quitting soon.   I don’t think Clemson is ever going to be great under Dabo again.",
    "created_utc": 1758403588.0
  },
  {
    "body_html": "Clemson’s talent issue isn’t all about the portal  There’s been a serious lack of development. Adding from the portal can mitigate some of that but the OL, WR (outside of Wesco) and Klubnik are all worse than last year.",
    "created_utc": 1758403693.0
  },
  {
    "body_html": "This QB is……uninspiring.",
    "created_utc": 1758403704.0
  },
  {
    "body_html": "Can’t believe how empty that stadium is",
    "created_utc": 1758403751.0
  },
  {
    "body_html": "0-4 on 4th down in 2nd half lol",
    "created_utc": 1758403774.0
  },
  {
    "body_html": "Unbiased Oregon State fan here: is Klubnik bad?",
    "created_utc": 1758403818.0
  },
  {
    "body_html": "I know there was a long delay but this being a 5.5 hour upset makes me a little bit happier",
    "created_utc": 1758403839.0
  },
  {
    "body_html": "Crazy Klubnik was a heisman favorite on a preseason #4 team and now might not even get drafted.",
    "created_utc": 1758403842.0
  },
  {
    "body_html": "Is this the start of Dabo purgatory for Clemson fans? He’s achieved too much to be fired but he’s too stubborn to change in the new era",
    "created_utc": 1758401071.0
  },
  {
    "body_html": "I got a commercial for ICE just now, are you fucking kidding me",
    "created_utc": 1758401511.0
  },
  {
    "body_html": "The good news is that there are about 5,000 QBs that could beat 2025 Clemson, so I’ve got a lot of faith in whatever warm body gets sent out next",
    "created_utc": 1758399926.0
  },
  {
    "body_html": "As it should be.  There was zero evidence to turn that over.",
    "created_utc": 1758400350.0
  },
  {
    "body_html": "Stuff that rules analyst in a locker",
    "created_utc": 1758400390.0
  },
  {
    "body_html": "Oh wow. They called it this time.",
    "created_utc": 1758403424.0
  },
  {
    "body_html": "Worthless team. All the coaches gotta' go. The fumble is bad protection, the other 98% of the game is coaching.",
    "created_utc": 1758400104.0
  },
  {
    "body_html": "BACKUP QB CAN BALL",
    "created_utc": 1758400138.0
  },
  {
    "body_html": "I’m beginning to think Clemson was overrated at the beginning of the year.",
    "created_utc": 1758400185.0
  },
  {
    "body_html": "So Clemson isn’t just like, overrated. They might actually be bad",
    "created_utc": 1758400203.0
  },
  {
    "body_html": "No OPI? Hands to the face?",
    "created_utc": 1758400205.0
  },
  {
    "body_html": "I actually dont know that's really a catch after watching the replay. by the time his hand is back on it the shoulder is touching oob. Im sure our soft ass defense woulda given it up the next play anyway",
    "created_utc": 1758400367.0
  },
  {
    "body_html": "WIN IT FOR STEVIE",
    "created_utc": 1758400443.0
  },
  {
    "body_html": "Even the open throws look hard for Cade",
    "created_utc": 1758400492.0
  },
  {
    "body_html": "Is Dabo a hard grader? Didn't he give his team a 58 after that week 1 loss to LSU? That was probably their best game? Easily a solid 75-80 for this team.",
    "created_utc": 1758400566.0
  },
  {
    "body_html": "Can we see Vizzina? I just want to see what happens",
    "created_utc": 1758400604.0
  },
  {
    "body_html": "Excellent move Cade",
    "created_utc": 1758400691.0
  },
  {
    "body_html": "Klubnick has defects that aren't correctable. The opposition knows how to stop him.",
    "created_utc": 1758400721.0
  },
  {
    "body_html": "Dabo better start learning how to speak Valley Girl",
    "created_utc": 1758400809.0
  },
  {
    "body_html": "If Clemson goes on to lose what even is Dabo’s “hot seat” status? Like does the idea of being fired even seriously cross the athletic department’s mind or is it just something some fans want I have zero clue what the situation is",
    "created_utc": 1758400958.0
  },
  {
    "body_html": "It’s kind of wild how bad Clemson looks with so much talent, and experienced talent at that. Their DBs are out here giving up wide open TDs. I have no idea what the fix is for some of this stuff",
    "created_utc": 1758400979.0
  },
  {
    "body_html": "Downs, Fumble, Punt, Downs, Punt  Clemson’s 3rd quarter possessions after the rain delay.",
    "created_utc": 1758401015.0
  },
  {
    "body_html": "Syracuse man-handling Clemson.",
    "created_utc": 1758401637.0
  },
  {
    "body_html": "Yeah we got away with one there",
    "created_utc": 1758401766.0
  },
  {
    "body_html": "if Dabo loses to Belichick, is he officially on hot seat?",
    "created_utc": 1758401818.0
  },
  {
    "body_html": "Terrible tackling there",
    "created_utc": 1758401944.0
  },
  {
    "body_html": "Holy miss tackles…",
    "created_utc": 1758401945.0
  },
  {
    "body_html": "New rule proposal. Get a wheelbarrow on the sideline and any player going down gets wheeled to the sideline. That way real or fake injuries don’t stop play. If it’s a neck or head, then stop the play, but otherwise get the red wagon out.",
    "created_utc": 1758402069.0
  },
  {
    "body_html": "If our defense gets a 3 and out I will eat a sock.",
    "created_utc": 1758402216.0
  },
  {
    "body_html": "This game ain’t over. Secondary completely broke coverage",
    "created_utc": 1758402217.0
  },
  {
    "body_html": "Cade looks rough",
    "created_utc": 1758402284.0
  },
  {
    "body_html": "woodass",
    "created_utc": 1758402362.0
  },
  {
    "body_html": "This is definitely far from over.",
    "created_utc": 1758402406.0
  },
  {
    "body_html": "Every time you think Clemson might make a comeback, they firmly do not.",
    "created_utc": 1758402501.0
  },
  {
    "body_html": "Jaedyn lukus of course",
    "created_utc": 1758402504.0
  },
  {
    "body_html": "Dabo about to have a coronary",
    "created_utc": 1758402536.0
  },
  {
    "body_html": "The announcer just said a first down here might do it like there is any chance we are going to pull this out. lol",
    "created_utc": 1758402587.0
  },
  {
    "body_html": "If we score in under 2/minutes I will eat a sock.",
    "created_utc": 1758402642.0
  },
  {
    "body_html": "What the heck was that supposed to accomplish?",
    "created_utc": 1758402657.0
  },
  {
    "body_html": "Why would you throw the fucking ball",
    "created_utc": 1758402662.0
  },
  {
    "body_html": "Why pass the ball???!!",
    "created_utc": 1758402677.0
  },
  {
    "body_html": "Syracuse lol",
    "created_utc": 1758452504.0
  },
  {
    "body_html": "I’m convinced the Syracuse OC got drunk during the delay because wtf is he doing…",
    "created_utc": 1758402707.0
  },
  {
    "body_html": "Klubnik has thrown the ball as many times today as Shula has let Sellers throw all year.",
    "created_utc": 1758402731.0
  },
  {
    "body_html": "Cade like ‘wait, wait, wait, NOW that there are three guys in my face this will go perfect’",
    "created_utc": 1758402966.0
  },
  {
    "body_html": "Perfect timing user INT",
    "created_utc": 1758402967.0
  },
  {
    "body_html": "Run. The. Fucking. Ball. Cuse.",
    "created_utc": 1758402967.0
  },
  {
    "body_html": "Cade is just staring down his target every time",
    "created_utc": 1758403021.0
  },
  {
    "body_html": "The funniest part is Dabo is far to stubborn to bench Klubnick.   He’d rather be loyal and go down in flames than even try a switch",
    "created_utc": 1758403028.0
  },
  {
    "body_html": "HEY TYLER",
    "created_utc": 1758403076.0
  },
  {
    "body_html": "God I’m glad I graduated when we were on top",
    "created_utc": 1758403106.0
  },
  {
    "body_html": "Is this the same Syracuse we played earlier this season? Hot dang.",
    "created_utc": 1758403138.0
  },
  {
    "body_html": "Hope Cuse hangs on to Fran. He’s had a really nice record so far and bigger jobs are gonna come calling. He’s a huge asset for the ACC",
    "created_utc": 1758403155.0
  },
  {
    "body_html": "Cade can still throw another pick, hell yeah",
    "created_utc": 1758403176.0
  },
  {
    "body_html": "Syracuse running the ball to kill clock challenge = Impossible",
    "created_utc": 1758403184.0
  },
  {
    "body_html": "Oof, 21 pass attempts for 152 yards and 30 attempts for 160 yards. Disasterclass of efficiency.",
    "created_utc": 1758403241.0
  },
  {
    "body_html": "Dabo just really wants to coach UCLA",
    "created_utc": 1758403259.0
  },
  {
    "body_html": "I kinda like the playcall - it says you trust your guys to make plays and that we’re good enough to put someone away  Going conservative can backfire too",
    "created_utc": 1758403264.0
  },
  {
    "body_html": "Kirby needs to call Fran and chew him out for how he's called this 4th quarter. Milk the clock...",
    "created_utc": 1758403273.0
  },
  {
    "body_html": "Does Syracuse now have D line and O line who can hang with the elite physical teams now? This was always their problem.",
    "created_utc": 1758403280.0
  },
  {
    "body_html": "Tbh im glad we are losing is such embarrassing fashion. Maybe something will change.   Because brother we are fucking ASS",
    "created_utc": 1758403283.0
  },
  {
    "body_html": "Genuine question: What are we thinking for the Clemson-UNC game in two weeks? Sicko bowl?",
    "created_utc": 1758403314.0
  },
  {
    "body_html": "Sorry, I stepped away for a haircut appointment. Did Dabo throw the hat down in rage yet?",
    "created_utc": 1758403316.0
  },
  {
    "body_html": "I think we've lost as many games at home between last year and now than we did the previous 10 years",
    "created_utc": 1758403331.0
  },
  {
    "body_html": "Fran said fuck prevent...",
    "created_utc": 1758403381.0
  },
  {
    "body_html": "I guess we’re the new Tigers now",
    "created_utc": 1758403484.0
  },
  {
    "body_html": "Tyler from Spartanburg was fake and set up by Clemson to get the fans riled up. They’re gonna have to dig DEEP to save this season. They need 5 more wins and it looks like they can’t even pull that off",
    "created_utc": 1758403496.0
  },
  {
    "body_html": "Mike Gundy and his brother Dabo aren't doing so well.",
    "created_utc": 1758403555.0
  },
  {
    "body_html": "<a href=\"https://media.giphy.com/media/v1.Y2lkPTc5MGI3NjExOW9tNXczZnQ0NDdpeGRwdDBudjdyNHk2a25pcHZ5MTNheWh1MXY1eiZlcD12MV9naWZzX3NlYXJjaCZjdD1n/pOeaTGiDBZgYM/giphy.gif\">mfw</a>",
    "created_utc": 1758403575.0
  },
  {
    "body_html": "CHEEZ CHEEZ CHEEZ CHEEZ",
    "created_utc": 1758403605.0
  },
  {
    "body_html": "Klubnik sending out so many hospital balls those recievers going to get ptsd",
    "created_utc": 1758403706.0
  },
  {
    "body_html": "Punt it Dabo! Punting is winning!",
    "created_utc": 1758403711.0
  },
  {
    "body_html": "If your QB has to throw 60 times in game… you’re gonna have a bad time",
    "created_utc": 1758403727.0
  },
  {
    "body_html": "Hes dead Jim.",
    "created_utc": 1758403741.0
  },
  {
    "body_html": "that'll do it",
    "created_utc": 1758403755.0
  },
  {
    "body_html": "D.A.R.T",
    "created_utc": 1758403770.0
  },
  {
    "body_html": "Jesus christ Cade lol",
    "created_utc": 1758403772.0
  },
  {
    "body_html": "Cade probably would’ve been a decent draft pick had he left",
    "created_utc": 1758403776.0
  },
  {
    "body_html": "GG Clemson Bros, good luck the rest of the season, always welcome to come hangout in our game threads.",
    "created_utc": 1758403803.0
  },
  {
    "body_html": "To be fair, it’s not very hard to give Garrett Riley fits",
    "created_utc": 1758403814.0
  },
  {
    "body_html": "People really tried to hype Arch Manning and Cade Klubnik as Heisman candidates lol",
    "created_utc": 1758403818.0
  },
  {
    "body_html": "Dabo's going to be at the podium whining about 2016 until kickoff next week, isn't he?",
    "created_utc": 1758403818.0
  },
  {
    "body_html": "Lmao they're ripping Dabo",
    "created_utc": 1758403824.0
  },
  {
    "body_html": "one more Orange TD please",
    "created_utc": 1758403840.0
  },
  {
    "body_html": "“Never been able to settle in.” Well yeah because Cade sucks. I really don’t understand why Dabo refuses to put in the back up. He did the same shit with DJ U.",
    "created_utc": 1758403845.0
  },
  {
    "body_html": "2018 Dabo: \"The BEST Is Yet to Come\"  Well, we're still waiting on that coach",
    "created_utc": 1758403852.0
  },
  {
    "body_html": "If Cade Klubnik is the starter next game, Dabo has officially given up and is just laughing all the way to the bank knowing he's going to get his money regardless of the results of this season. Cade is worse now than DJ U was (with a much worse OC too) and I will not be gaslit into pretending otherwise.",
    "created_utc": 1758403857.0
  },
  {
    "body_html": "60 attempts... with 16 carries by your running back.... wild",
    "created_utc": 1758403868.0
  },
  {
    "body_html": "Cade really just chucks it over and over. I can’t remember watching another QB that felt less accurate in his throws. Like, it seems like literally half of them are uncatchable out of bounds.",
    "created_utc": 1758403881.0
  },
  {
    "body_html": "Randall averaged 8.1 yards a carry but hey throw it 60 times and only run it 16",
    "created_utc": 1758403903.0
  },
  {
    "body_html": "Does this make Clemson the 2024 FSU of 2025? 🤔",
    "created_utc": 1758403926.0
  },
  {
    "body_html": "When does the christmas tree show up outside Dabos house",
    "created_utc": 1758403926.0
  },
  {
    "body_html": "What happened to the average Clemson finger up the bootyhole on defense or is that done now?",
    "created_utc": 1758401359.0
  },
  {
    "body_html": "c༙྇l༙྇e༙྇m༙྇s༙྇o༙྇n༙྇ i༙྇s༙྇  k༙྇i༙྇l༙྇l༙྇",
    "created_utc": 1758401642.0
  },
  {
    "body_html": "Watching that celmson receiver celebrate like he just scored a TD while his team is in a hurry up situation down 20 shows how over it really is for  Clemson.",
    "created_utc": 1758402053.0
  },
  {
    "body_html": "Are you tired of winning yet clemson?",
    "created_utc": 1758402981.0
  },
  {
    "body_html": "Last one out turn off the lights",
    "created_utc": 1758402990.0
  },
  {
    "body_html": "Might I suggest Sydney Sweeney to be the interim HC at Clemson? She may be able to get them fired up. And it would be a big pr win",
    "created_utc": 1758403382.0
  },
  {
    "body_html": "Do not join ICE. Keep your humanity and soul intact.",
    "created_utc": 1758401495.0
  },
  {
    "body_html": "You’ve sat through three and a half quarters of losing football and a nearly two-hour lightning delay. What’s staying five more minutes to just finish it out going to hurt?",
    "created_utc": 1758403078.0
  },
  {
    "body_html": "Papa Dabo got Clemson Clemsoning again and I love it!",
    "created_utc": 1758389149.0
  },
  {
    "body_html": "Georgia Tech fans, honestly, how does this make you feel about our game last week.",
    "created_utc": 1758396465.0
  },
  {
    "body_html": "Fuck that looked bad",
    "created_utc": 1758399757.0
  },
  {
    "body_html": "Did he say Fran brown’s mom had him when she was 13?",
    "created_utc": 1758400046.0
  },
  {
    "body_html": "KEEP ROLLING CUSE KEEP GOING",
    "created_utc": 1758400141.0
  },
  {
    "body_html": "If this is God’s name, image, and likeness, then God isn’t very attractive.",
    "created_utc": 1758400221.0
  },
  {
    "body_html": "It's Dabover",
    "created_utc": 1758400227.0
  },
  {
    "body_html": "Dabo would make a good service academy coach.",
    "created_utc": 1758400602.0
  },
  {
    "body_html": "OMG lol.  The option was a guaranteed 15+ yard run.  Holy fuck.",
    "created_utc": 1758400697.0
  },
  {
    "body_html": "STOP FAKING THE PITCH TO RANDALL AND JUST GIVE IT TO HIM BRUH",
    "created_utc": 1758400728.0
  },
  {
    "body_html": "You can tell there’s less trust in Rickie (also game situation) but hopefully he does some stuff to earn more faith going forward",
    "created_utc": 1758401318.0
  },
  {
    "body_html": "Gotta give credit where it’s due to Syracuse and Fran Brown here. This isn’t just a Clemson failure. Cuse has some absolute dawgs and they came into Clemson’s house to play. Thought this would be the story of two halves but gotta respect the dedication and execution from the orange",
    "created_utc": 1758401344.0
  },
  {
    "body_html": "Giant jersey does it!",
    "created_utc": 1758401462.0
  },
  {
    "body_html": "Was that the long snapper in a jersey 2 sizes to big?",
    "created_utc": 1758401481.0
  },
  {
    "body_html": "A make up no holding call for the missed PI",
    "created_utc": 1758401860.0
  },
  {
    "body_html": "Clemson 🤝 Florida State  Lightning delays.  I’m back here till it’s over now lol",
    "created_utc": 1758401927.0
  },
  {
    "body_html": "If Riley calls another swing pass I’m going to scream.",
    "created_utc": 1758401935.0
  },
  {
    "body_html": "Clemson looks worse than the hasbrown the mcdonalds has by my dorm",
    "created_utc": 1758401940.0
  },
  {
    "body_html": "Tristan smith seems productive everytime he's on the field and he was one of our very few transfers. Yet we still refuse to play him consistently",
    "created_utc": 1758402137.0
  },
  {
    "body_html": "Wow. I thought Duke would be good this year.",
    "created_utc": 1758402315.0
  },
  {
    "body_html": "Why did we snap there. We had 30 seconds on the play clock",
    "created_utc": 1758402434.0
  },
  {
    "body_html": "On track for over 500 yards of offense with just 3 tds to show for it.   Finishing problems. Story of my life",
    "created_utc": 1758402611.0
  },
  {
    "body_html": "I’ve seen this too many times to be comfortable",
    "created_utc": 1758402659.0
  },
  {
    "body_html": "Syracuse is being so incredibly stupid. Run the ball and punt. Clock is your friend. Giving Clemson a window",
    "created_utc": 1758402684.0
  },
  {
    "body_html": "He was looking in the exact opposite direction of the ball while trying to catch it",
    "created_utc": 1758402685.0
  },
  {
    "body_html": "I've seen this movie before.",
    "created_utc": 1758402704.0
  },
  {
    "body_html": "wtf is Syracuse doing with the clock .",
    "created_utc": 1758402705.0
  },
  {
    "body_html": "All I had to see was prevent defense in the middle of the 2nd quarter to know that Syracuse would somehow blow this. I hope I’m wrong.",
    "created_utc": 1758402714.0
  },
  {
    "body_html": "At least 4 wide open missed throws",
    "created_utc": 1758402906.0
  },
  {
    "body_html": "LETS GOOOOOOO",
    "created_utc": 1758402933.0
  },
  {
    "body_html": "Cade Klubnik should be on the No Fly List. Lord knows his passes already are",
    "created_utc": 1758402955.0
  },
  {
    "body_html": "The superior Orange",
    "created_utc": 1758402963.0
  },
  {
    "body_html": "Dude throws ints at the worst possible times.",
    "created_utc": 1758402963.0
  },
  {
    "body_html": "This team is so god awful. Cade is a fucking bum",
    "created_utc": 1758402965.0
  },
  {
    "body_html": "Cade is so bad",
    "created_utc": 1758402979.0
  },
  {
    "body_html": "Punts by both QBs this game, wild",
    "created_utc": 1758402982.0
  },
  {
    "body_html": "There's the cade turnover i was looking for",
    "created_utc": 1758402983.0
  },
  {
    "body_html": "Insert Charlie Murphy laughing gif here",
    "created_utc": 1758403024.0
  },
  {
    "body_html": "The qb seems pretty inconsistent especially on 4th down conversions. Well played Cuse!",
    "created_utc": 1758403036.0
  },
  {
    "body_html": "klubnik is cheeeeeeks damn",
    "created_utc": 1758403079.0
  },
  {
    "body_html": "How bad was Angeli’s injury?",
    "created_utc": 1758403128.0
  },
  {
    "body_html": "I can't wait for dabos freak out in the post game this time.",
    "created_utc": 1758403151.0
  },
  {
    "body_html": "Jesus, Syracuse really trying to give Clemson as much time as possible.",
    "created_utc": 1758403158.0
  },
  {
    "body_html": "Sorry Syracuse, but we're not a good barometer for anything except how to fall flat on your face in your own stadium",
    "created_utc": 1758403175.0
  },
  {
    "body_html": "Syracuse have you tried running the ball?",
    "created_utc": 1758403180.0
  },
  {
    "body_html": "Let us die Fran, stop throwing the ball and let the clock run out",
    "created_utc": 1758403194.0
  },
  {
    "body_html": "RUN THE BALL",
    "created_utc": 1758403207.0
  },
  {
    "body_html": "Luckily it doesn't matter what Syracuse does because Clemson sucks so much",
    "created_utc": 1758403209.0
  },
  {
    "body_html": "God I don't like this offensive strategy. You need to burn clock or force Clemson to use their timeouts. What the fuck is Jeff Nixon thinking??? His strategy is atrocious.",
    "created_utc": 1758403216.0
  },
  {
    "body_html": "Can’t wait for Dabos press conference",
    "created_utc": 1758403301.0
  },
  {
    "body_html": "Can Syracuse just end this game please?",
    "created_utc": 1758403318.0
  },
  {
    "body_html": "Not to be that specific because I don’t wanna dox anyone, but I know a guy that played for Clemson last season and I used to watch his games with his family and they fckn hated the Clemson QB it was always so funny lmao (he was not from California so that won’t help you figure out the player)",
    "created_utc": 1758403321.0
  },
  {
    "body_html": "Syracuse is not running to give the Clemson Board more reasons…",
    "created_utc": 1758403329.0
  },
  {
    "body_html": "Wasn't there a game like this a couple of years ago where Syracuse had Clemson on the ropes and they came back to win it in the very, very end?",
    "created_utc": 1758403330.0
  },
  {
    "body_html": "8 years is insane, bro needs to hit LinkedIn",
    "created_utc": 1758403527.0
  },
  {
    "body_html": "Only saw before the rain delay. Wiiild.",
    "created_utc": 1758403580.0
  },
  {
    "body_html": "Walhburg on a Bruce Willis run with the b tier movies before he retires",
    "created_utc": 1758403667.0
  },
  {
    "body_html": "Now too many teams are ranked higher because of a bad Clemson team that is 1-3 lol",
    "created_utc": 1758403695.0
  },
  {
    "body_html": "Both teams would be in the locker room if Syracuse had any semblance of clock management",
    "created_utc": 1758403772.0
  },
  {
    "body_html": "Why doesn’t Clemson bring back tlaw, are they stupid?",
    "created_utc": 1758403790.0
  },
  {
    "body_html": "60 pass attempts is wild",
    "created_utc": 1758403798.0
  },
  {
    "body_html": "There’s only gonna be like 4 people left to meet at the paw lol",
    "created_utc": 1758403820.0
  },
  {
    "body_html": "[deleted]",
    "created_utc": 1758403826.0
  },
  {
    "body_html": "Why is it so empty in the stadium?",
    "created_utc": 1758403826.0
  },
  {
    "body_html": "Has Clemson replaced Texas as annual orange preseason top 10 team to fall out by the end of September?",
    "created_utc": 1758403868.0
  },
  {
    "body_html": "The dabo fever dream ends",
    "created_utc": 1758403890.0
  },
  {
    "body_html": "Sad lil Dabo",
    "created_utc": 1758403910.0
  },
  {
    "body_html": "pretty disastrous start to clemsons season",
    "created_utc": 1758403967.0
  },
  {
    "body_html": "Go for it.",
    "created_utc": 1758403975.0
  },
  {
    "body_html": "I understand the frustration of watching your team get a mud hole stomped in their ass, but don’t boo injuries. Come on.",
    "created_utc": 1758401992.0
  },
  {
    "body_html": "\"Rules analyst\"",
    "created_utc": 1758400331.0
  },
  {
    "body_html": "Correct call",
    "created_utc": 1758400347.0
  },
  {
    "body_html": "RIP GT’s quality win",
    "created_utc": 1758400865.0
  },
  {
    "body_html": "Dabo is Butch Jones without a Generational QB (Boyd, Watson, Lawrence)",
    "created_utc": 1758402336.0
  },
  {
    "body_html": "Good. That overrated QB needs another INT on his stat sheet",
    "created_utc": 1758402974.0
  },
  {
    "body_html": "In retrospect, Brian Kelly's gonna start executing players.",
    "created_utc": 1758402981.0
  },
  {
    "body_html": "Dabo said if Clemson doesn’t want to win anymore then they should fire him. But he’s still on the sideline right now.   I’m confused..",
    "created_utc": 1758403042.0
  },
  {
    "body_html": "THIS is the team that Georgia tech needed a fire drill field goal to beat?",
    "created_utc": 1758403472.0
  },
  {
    "body_html": "Why is Dabo so scared to always do what needs to be done with the personnel? When is someone going to tell him God doesn't have a favorite football team?",
    "created_utc": 1758403527.0
  },
  {
    "body_html": "Fuck ICE",
    "created_utc": 1758396275.0
  },
  {
    "body_html": "Furman is the only guarantee win. We might win 1-2 conference games, 3 conference wins would be a miracle. I predict anything from 3-9 to 5-7, and 2-10 is absolutely possible. 😂",
    "created_utc": 1758401624.0
  },
  {
    "body_html": "Still and incredibly poor throw by Cade",
    "created_utc": 1758402244.0
  },
  {
    "body_html": "17 YEARS OLD?!?!?!?!?!?!?!?!?!?!?!?!??",
    "created_utc": 1758403458.0
  },
  {
    "body_html": "Most coaches would take the post game a chance to apologize to the fanbase. Dabos head is so far up his own butt he will just throw people under the bus",
    "created_utc": 1758403717.0
  },
  {
    "body_html": "Watson was a dud, TLaw looks like a dud and now Klubnik looks like he was all hype. Clemson QBs on my perpetual do not draft list",
    "created_utc": 1758403863.0
  },
  {
    "body_html": "Wow where are the fans???",
    "created_utc": 1758401959.0
  },
  {
    "body_html": "Tiger Fans leaving in drovessss lol",
    "created_utc": 1758403082.0
  },
  {
    "body_html": "Swear the first weather delay game I can recall was the Virginia Tech vs Georgia Tech game in 2000",
    "created_utc": 1758392225.0
  },
  {
    "body_html": "Some say God was Icing Dabo Swinney.",
    "created_utc": 1758397770.0
  },
  {
    "body_html": "So is this the winning that Dabo was talking about in that interview?",
    "created_utc": 1758400078.0
  },
  {
    "body_html": "We’re officially back to Tommy Bowden-era Clemson",
    "created_utc": 1758400104.0
  },
  {
    "body_html": "damn the sprints worked",
    "created_utc": 1758400155.0
  },
  {
    "body_html": "👀",
    "created_utc": 1758400161.0
  },
  {
    "body_html": "It sounds like there are more Syracuse fans left in the stands than Clemson fans.   I hope Garret Riley has recently updated his resume.",
    "created_utc": 1758400249.0
  },
  {
    "body_html": "I’m apathetic, I think losing as much as posssible is best for the program",
    "created_utc": 1758400253.0
  },
  {
    "body_html": "Play the replay feed ESPN. Georgia Tech did it last week",
    "created_utc": 1758400267.0
  },
  {
    "body_html": "Clemson Florida State Seminoles Tigers",
    "created_utc": 1758400424.0
  },
  {
    "body_html": "Terrible call",
    "created_utc": 1758400550.0
  },
  {
    "body_html": "I'm not seeing the interference. He had a hand on the receiver but it didn't look like it moved him at all.",
    "created_utc": 1758400592.0
  },
  {
    "body_html": "Dink and dunk until the clock hits 0. Fucking pathetic",
    "created_utc": 1758400662.0
  },
  {
    "body_html": "Oh the boos are RAINING",
    "created_utc": 1758400688.0
  },
  {
    "body_html": "Clemson could bring a fan out of the stands and they’d call a better game",
    "created_utc": 1758400728.0
  },
  {
    "body_html": "Crazy what a difference it makes having Watson or Lawrence vs DJ or Klubnick",
    "created_utc": 1758400856.0
  },
  {
    "body_html": "Dabo looked defeated.",
    "created_utc": 1758401071.0
  },
  {
    "body_html": "I don’t even understand. It’s not like Clemson had a ton of turnover from last year… how tf did they get worse?",
    "created_utc": 1758401323.0
  },
  {
    "body_html": "obvious DPI",
    "created_utc": 1758401769.0
  },
  {
    "body_html": "Definitely dpi",
    "created_utc": 1758401775.0
  },
  {
    "body_html": "Bruh he was holding his arm down lol",
    "created_utc": 1758401794.0
  },
  {
    "body_html": "Wow.",
    "created_utc": 1758401903.0
  },
  {
    "body_html": "Get tristan smith on the field more",
    "created_utc": 1758401974.0
  },
  {
    "body_html": "Some would call that \"wide open\"",
    "created_utc": 1758402177.0
  },
  {
    "body_html": "It still feels like there’s no urgency lol Even the hurry up feels slow. I wish I could watch a practice because they can’t be practicing at game speed. This makes no sense. Cade can barely get the ball to a wide open guy in the end zone.",
    "created_utc": 1758402188.0
  },
  {
    "body_html": "Heldt got a kneck yall",
    "created_utc": 1758402382.0
  },
  {
    "body_html": "That Will Heldt transfer makes sense now. He looks like a walk on from Daniel HS in portrait.",
    "created_utc": 1758402384.0
  },
  {
    "body_html": "why the fuck are you snapping it with ~30 seconds left on the play clock",
    "created_utc": 1758402424.0
  },
  {
    "body_html": "STOP THROWING IT FOR FUCK SAKE",
    "created_utc": 1758402430.0
  },
  {
    "body_html": "Needed that tackle to keep the game alive lo",
    "created_utc": 1758402476.0
  },
  {
    "body_html": "my mom could have made that tackle",
    "created_utc": 1758402497.0
  },
  {
    "body_html": "This game started 5 hours ago.",
    "created_utc": 1758402510.0
  },
  {
    "body_html": "So who is going to be pulled out of the good ol' boy bin to replace Tom Allen",
    "created_utc": 1758402565.0
  },
  {
    "body_html": "That was bad. Rickie, gotta be a bit more decisive, dude.",
    "created_utc": 1758402611.0
  },
  {
    "body_html": "Literally the worst case scenario for Syracuse",
    "created_utc": 1758402685.0
  },
  {
    "body_html": "Prevent defense is so bad we might even benefit from it",
    "created_utc": 1758402762.0
  },
  {
    "body_html": "Another miss by our guy.",
    "created_utc": 1758402905.0
  },
  {
    "body_html": "That Syracuse blitz could not have been any less effective and Cade doesn’t make a throw",
    "created_utc": 1758402905.0
  },
  {
    "body_html": "LOL CLEMSON",
    "created_utc": 1758402943.0
  },
  {
    "body_html": "Phew thank goodness Cade is trash",
    "created_utc": 1758402944.0
  },
  {
    "body_html": "HELL YEAH",
    "created_utc": 1758402944.0
  },
  {
    "body_html": "Damn what a fucking pick",
    "created_utc": 1758402951.0
  },
  {
    "body_html": "Great play by the defender. That’s how you attack the ball",
    "created_utc": 1758402952.0
  },
  {
    "body_html": "Well whoever called that pick earlier.  Congrats.",
    "created_utc": 1758402955.0
  },
  {
    "body_html": "Klubnik’s deep ball is so bad",
    "created_utc": 1758402956.0
  },
  {
    "body_html": "That pick just gave me CFB 26 dynasty trauma",
    "created_utc": 1758402960.0
  },
  {
    "body_html": "Cade Klubnik is ass",
    "created_utc": 1758402960.0
  },
  {
    "body_html": "Price Is Right fail horn",
    "created_utc": 1758402961.0
  },
  {
    "body_html": "LETS GOOOOO",
    "created_utc": 1758402961.0
  },
  {
    "body_html": "Syracuse going to throw all 3 downs",
    "created_utc": 1758402966.0
  },
  {
    "body_html": "lol, lmao even",
    "created_utc": 1758402967.0
  },
  {
    "body_html": "Can't believe this team was picked by so many talking heads as a natty favorite.",
    "created_utc": 1758402996.0
  },
  {
    "body_html": "That’s Cades career",
    "created_utc": 1758403004.0
  },
  {
    "body_html": "The 10 Clemson fans left are starting to think it’s over",
    "created_utc": 1758403007.0
  },
  {
    "body_html": "I don't care who falls for Klubnik so long as it ain't the browns",
    "created_utc": 1758403047.0
  },
  {
    "body_html": "Fran is for real",
    "created_utc": 1758403120.0
  },
  {
    "body_html": "Now why are you throwing that?",
    "created_utc": 1758403173.0
  },
  {
    "body_html": "What in the absolute fuck are we doing throwing? There is still enough time to comeback now.",
    "created_utc": 1758403181.0
  },
  {
    "body_html": "So how are Clemson fans feeling about the coaching staff? Dabo seems like he's being stubborn which is costing him but I don't follow closely enough to know if I'm just basing it on headlines or a good take?",
    "created_utc": 1758403181.0
  },
  {
    "body_html": "Will Dabo's presser be on youtube?  That's a must see.",
    "created_utc": 1758403186.0
  },
  {
    "body_html": "Fran needs to answer for the terrible clock management.",
    "created_utc": 1758403240.0
  },
  {
    "body_html": "Why does every pass take 3-4 seconds to develop",
    "created_utc": 1758403258.0
  },
  {
    "body_html": "Did the commentator already forgot about the interception? It was essentially a turnover on downs, but still.",
    "created_utc": 1758403275.0
  },
  {
    "body_html": "I think this win means that Fran is now Mr. 17.5. Sorry Jeezy!",
    "created_utc": 1758403323.0
  },
  {
    "body_html": "Clubnik not doing well under pressure it seems lol",
    "created_utc": 1758403332.0
  },
  {
    "body_html": "Does clock not stop on 1st downs anymore?",
    "created_utc": 1758403387.0
  },
  {
    "body_html": "lol",
    "created_utc": 1758403420.0
  },
  {
    "body_html": "Can we even do deep passing plays anymore or do they all have to be line of scrimmage?",
    "created_utc": 1758403481.0
  },
  {
    "body_html": "Well, at least we still have enough prestige that our opponents will rush the field (when playing at our stadium at least)",
    "created_utc": 1758403518.0
  },
  {
    "body_html": "Were so bad I would take Cole 3 and out stoudt right now",
    "created_utc": 1758403570.0
  },
  {
    "body_html": "Mark Wahlberg is Mark Wahlberg in “Another Mark Wahlberg Caper”",
    "created_utc": 1758403620.0
  },
  {
    "body_html": "Orange team bad.",
    "created_utc": 1758403658.0
  },
  {
    "body_html": "LMAO",
    "created_utc": 1758403742.0
  },
  {
    "body_html": "<h1>1 was like .. dafuq?</h1>",
    "created_utc": 1758403743.0
  },
  {
    "body_html": "If Clemson continues to start Klubnik moving forward, Dabo might lose the locker room.",
    "created_utc": 1758403773.0
  },
  {
    "body_html": "God I hope there’s 1 brave media soul who asks Dabo the hard question",
    "created_utc": 1758403784.0
  },
  {
    "body_html": "Holy shit!!! Klubnik looks total fucking ass.",
    "created_utc": 1758403786.0
  },
  {
    "body_html": "Defensive masterclass",
    "created_utc": 1758403791.0
  },
  {
    "body_html": "Can't wait to hear Dabo's comments after this one",
    "created_utc": 1758403842.0
  },
  {
    "body_html": "the worst thing to happen so far",
    "created_utc": 1758403854.0
  },
  {
    "body_html": "Wow. Announcer is going hard on poor Dabo",
    "created_utc": 1758403862.0
  },
  {
    "body_html": "Woof clemson.",
    "created_utc": 1758403974.0
  },
  {
    "body_html": "He has it pinned between his legs. That's a catch. Overturning that is bullshit.",
    "created_utc": 1758400283.0
  },
  {
    "body_html": "Eat shit booth ref.",
    "created_utc": 1758400355.0
  },
  {
    "body_html": "Clemson picked to pick to be one of the best teams is country starts out 1-3…. Pikachu face lol",
    "created_utc": 1758403666.0
  },
  {
    "body_html": "Stop feeling sorry for them, refs",
    "created_utc": 1758400574.0
  },
  {
    "body_html": "Dabo on the sideline googling where the nearest beach is",
    "created_utc": 1758400627.0
  },
  {
    "body_html": "If it's any consolation to the Clempson bros, you can watch Carolina get booty blasted in a few hours with abysmal offensive play calling.",
    "created_utc": 1758400834.0
  },
  {
    "body_html": "Clemsons scheme to trick kids from being a South Carolina fan by winning for a decade before inserting them into a life time of being a 90’s - 00’s Clemson fan is chefs kiss.",
    "created_utc": 1758400865.0
  },
  {
    "body_html": "Leave the game before the game leaves you, Dabo",
    "created_utc": 1758401251.0
  },
  {
    "body_html": "2025 Clemson = 2024 FSU",
    "created_utc": 1758401609.0
  },
  {
    "body_html": "if Syracuse loses this its officially seppuku time",
    "created_utc": 1758402179.0
  },
  {
    "body_html": "will clemson fall to 1-3? people are asking",
    "created_utc": 1758402506.0
  },
  {
    "body_html": "That doesn't look too bad on the QB.  Looked like everyone was covered and he just tried to make a throw.  Still 51 attempts by the QB is just crazy bad balance.",
    "created_utc": 1758403079.0
  },
  {
    "body_html": "All that offseason of hype just to be eliminated from the playoff conversation in September",
    "created_utc": 1758403167.0
  },
  {
    "body_html": "Ok, but how does this performance affect Tua’s legacy?",
    "created_utc": 1758403199.0
  },
  {
    "body_html": "Kinda feel for Clemson fans. They know things aren’t going in the right direction but they can’t call for a coaching change.",
    "created_utc": 1758403752.0
  },
  {
    "body_html": "Good lord in heaven Clemson is ass",
    "created_utc": 1758403757.0
  },
  {
    "body_html": "Syracuse &gt;&gt;&gt; LSU",
    "created_utc": 1758403840.0
  },
  {
    "body_html": "Ha ha clemson suck it!  <em>You have your turn on us tonight</em>",
    "created_utc": 1758403880.0
  },
  {
    "body_html": "Now that the SEC has moved to 9 games, I think Clemson would fit in well in the conference. We still want to have a late November cupcake on the schedule",
    "created_utc": 1758402142.0
  },
  {
    "body_html": "People blaming Klubnik for this game are idiots. He’s actually playing pretty well. Our problems offensively go way deeper than QB play",
    "created_utc": 1758400909.0
  },
  {
    "body_html": "Shoutout to #1 preseason best team in America Clemson for going 1-3",
    "created_utc": 1758403813.0
  },
  {
    "body_html": "Tech rushed the field last week haha",
    "created_utc": 1758400864.0
  },
  {
    "body_html": "2025 Clemson = 2024 FSU",
    "created_utc": 1758402968.0
  },
  {
    "body_html": "This Clemson QB is the one people were saying would win the Heisman??? LMFAOOOO",
    "created_utc": 1758402975.0
  },
  {
    "body_html": "Clemson downgraded to non life threatening injury valley",
    "created_utc": 1758403165.0
  },
  {
    "body_html": "Haha Clemson. Imagine being ranked top 5 in the preseason rankings and having an enormously disappointing QB who nevertheless inexplicably has NFL draft hype. Couldn’t be me right 😬",
    "created_utc": 1758403289.0
  },
  {
    "body_html": "You held a three man rush? Lol lol lol",
    "created_utc": 1758403399.0
  },
  {
    "body_html": "I dont know if yall just saw that allstate commercial but the georgia fan barking at his boss in the meeting had me wheezing it was so hilarious",
    "created_utc": 1758403620.0
  },
  {
    "body_html": "And that's pretty much it folks. The fall of Clemson needs to be studied. Dabo might actually get his wish.",
    "created_utc": 1758403771.0
  },
  {
    "body_html": "Is this Clemsoning v 2.0?",
    "created_utc": 1758402531.0
  },
  {
    "body_html": "Hell yeah, patented Dabo \"just throw the ball up and hope your guy comes up with it\" offense.",
    "created_utc": 1758403420.0
  },
  {
    "body_html": "I’m starting to think Clemson can no longer claim “Death Valley”",
    "created_utc": 1758403046.0
  },
  {
    "body_html": "Dude in the back really flexing those calves with the Khaki shorts",
    "created_utc": 1758392155.0
  },
  {
    "body_html": "has anyone heard what channel we will be on after the delay?",
    "created_utc": 1758396297.0
  },
  {
    "body_html": "JOHNTAY!!!",
    "created_utc": 1758398250.0
  },
  {
    "body_html": "Is his FG range that close to the 20 lol",
    "created_utc": 1758398387.0
  },
  {
    "body_html": "these syracuses injuries are brutal",
    "created_utc": 1758399339.0
  },
  {
    "body_html": "2 5-star QB whiffs in a row",
    "created_utc": 1758399772.0
  },
  {
    "body_html": "Not like that...",
    "created_utc": 1758399782.0
  },
  {
    "body_html": "I think he broke his leg",
    "created_utc": 1758399846.0
  },
  {
    "body_html": "When it rains",
    "created_utc": 1758400017.0
  },
  {
    "body_html": "so is clemson this year’s FSU?",
    "created_utc": 1758400103.0
  },
  {
    "body_html": "“Bob, they just need to get some more commercials in.”",
    "created_utc": 1758400215.0
  },
  {
    "body_html": "Damn Angeli",
    "created_utc": 1758400488.0
  },
  {
    "body_html": "GUNDY, DABO, MCDANIELS  FMK??",
    "created_utc": 1758400561.0
  },
  {
    "body_html": "Klubnik might be the best worst qb ever",
    "created_utc": 1758400646.0
  },
  {
    "body_html": "Why. the fuck. aren’t we running",
    "created_utc": 1758400650.0
  },
  {
    "body_html": "what the fuck Cade",
    "created_utc": 1758400678.0
  },
  {
    "body_html": "That's the call? Shheesyut",
    "created_utc": 1758400727.0
  },
  {
    "body_html": "What's ThatBoy's contract looking like?  Didn't they just re-up him?",
    "created_utc": 1758401036.0
  },
  {
    "body_html": "So if and when Dabo departs who's up for the job?",
    "created_utc": 1758401250.0
  },
  {
    "body_html": "Our ST look so much better than previous years",
    "created_utc": 1758401496.0
  },
  {
    "body_html": "No way Clemson is this bad.",
    "created_utc": 1758401496.0
  },
  {
    "body_html": "I am now not too impressed with Georgia techs win",
    "created_utc": 1758401677.0
  },
  {
    "body_html": "Trampled By Turtles on at Farm Aid 40. Always good….",
    "created_utc": 1758401711.0
  },
  {
    "body_html": "Perfect spiral.",
    "created_utc": 1758401953.0
  },
  {
    "body_html": "They’re lettin these boys play on the outside damn",
    "created_utc": 1758401964.0
  },
  {
    "body_html": "I'd imagine they're just deciding they'll take the DPI rather than a completion but they're not getting called for it lol",
    "created_utc": 1758402064.0
  },
  {
    "body_html": "They are probably going to need Collins to make a few plays at this point.",
    "created_utc": 1758402141.0
  },
  {
    "body_html": "Horrible coverage there",
    "created_utc": 1758402195.0
  },
  {
    "body_html": "Sheesh.",
    "created_utc": 1758402445.0
  },
  {
    "body_html": "Ooof that missed tackle",
    "created_utc": 1758402483.0
  },
  {
    "body_html": "Syracuse don’t screw this up just burn some of the clock",
    "created_utc": 1758402486.0
  },
  {
    "body_html": "Really needed to make that tackle smh",
    "created_utc": 1758402499.0
  },
  {
    "body_html": "I can’t imagine dudes named jontay being anything but awesome",
    "created_utc": 1758402523.0
  },
  {
    "body_html": "Jaedyn lukas is a terrorist",
    "created_utc": 1758402545.0
  },
  {
    "body_html": "Even if we get the ball it'll take us 5 minutes of game clock to score (if we do)",
    "created_utc": 1758402618.0
  },
  {
    "body_html": "Hmm. Interesting strategy Cuse.",
    "created_utc": 1758402665.0
  },
  {
    "body_html": "I thought Syracuse would have a down year with Collins and thought they got way better when Angeli transferred there. Brutal",
    "created_utc": 1758402668.0
  },
  {
    "body_html": "The issue is that Clemson has looked much better on the ground",
    "created_utc": 1758402746.0
  },
  {
    "body_html": "Come on oranges, your juice is my favorite pull this out",
    "created_utc": 1758402770.0
  },
  {
    "body_html": "dude just go for the first",
    "created_utc": 1758402874.0
  },
  {
    "body_html": "Klubnik has 300 yards and 3 td’s…I have not watched any of this game is that misleading or is he actually playing well",
    "created_utc": 1758402889.0
  },
  {
    "body_html": "Please punt here Dabo. I want to hear the boos",
    "created_utc": 1758402896.0
  },
  {
    "body_html": "I would like to point out games that started after this are reaching halftime or are in the 3rd quarter",
    "created_utc": 1758402898.0
  },
  {
    "body_html": "That was an ugly toss",
    "created_utc": 1758402921.0
  },
  {
    "body_html": "PICKED",
    "created_utc": 1758402929.0
  },
  {
    "body_html": "Incredible",
    "created_utc": 1758402930.0
  },
  {
    "body_html": "YESO",
    "created_utc": 1758402936.0
  },
  {
    "body_html": "LOL. lmao, even",
    "created_utc": 1758402944.0
  },
  {
    "body_html": "There it is!",
    "created_utc": 1758402945.0
  },
  {
    "body_html": "<h1>LMAO</h1>",
    "created_utc": 1758402950.0
  },
  {
    "body_html": "Cade really regressed over the summer. Sigh.",
    "created_utc": 1758402962.0
  },
  {
    "body_html": "Gorgeous INT",
    "created_utc": 1758402968.0
  },
  {
    "body_html": "That wasn’t good",
    "created_utc": 1758402971.0
  },
  {
    "body_html": "That'll be game, boys.",
    "created_utc": 1758402981.0
  },
  {
    "body_html": "game",
    "created_utc": 1758402987.0
  },
  {
    "body_html": "It wasn’t necessary but a pick fits Klubnik’s day",
    "created_utc": 1758402996.0
  },
  {
    "body_html": "Get off your knees, Cade",
    "created_utc": 1758402997.0
  },
  {
    "body_html": "Oh thank you phew",
    "created_utc": 1758403003.0
  },
  {
    "body_html": "How many games are we going to let this bum ass qb lose for us",
    "created_utc": 1758403006.0
  },
  {
    "body_html": "Few things in sports are more demoralizing as playing on a bad football team, except being a bad football team that begins a program tailspin",
    "created_utc": 1758403034.0
  },
  {
    "body_html": "Oh god the 1/8th of the fans left are getting out of here",
    "created_utc": 1758403039.0
  },
  {
    "body_html": "Not the best throw but i dont think anyone was really open anyway. Maybe the slant from the right but i think the lb was picking it up.",
    "created_utc": 1758403051.0
  },
  {
    "body_html": "In Fran we trust!",
    "created_utc": 1758403065.0
  },
  {
    "body_html": "They gotta stop calling for teams to cover against clemson, it's clearly a massive curse",
    "created_utc": 1758403128.0
  },
  {
    "body_html": "Why are they throwing the ball?",
    "created_utc": 1758403161.0
  },
  {
    "body_html": "GIVE ME JOHN GRUDEN",
    "created_utc": 1758403167.0
  },
  {
    "body_html": "Welcome to Clemson Mike Gundy",
    "created_utc": 1758403176.0
  },
  {
    "body_html": "I am very excited for this post game press conference.",
    "created_utc": 1758403182.0
  },
  {
    "body_html": "Time management is Cristobalian",
    "created_utc": 1758403183.0
  },
  {
    "body_html": "Finally found a stream to watch this game.",
    "created_utc": 1758403214.0
  },
  {
    "body_html": "Syracuse giving Clemson so many opportunities to come back",
    "created_utc": 1758403223.0
  },
  {
    "body_html": "Bro. Run the fucking ball. Fucking Christ.",
    "created_utc": 1758403225.0
  },
  {
    "body_html": "I can confidently say, Mario would have ran the ball every single down the last 6 times lol.",
    "created_utc": 1758403272.0
  },
  {
    "body_html": "Nebraska better be scared. We are coming for their “most one score losses in a season” record",
    "created_utc": 1758403306.0
  },
  {
    "body_html": "If Dabo ends up retiring/leaving within the next couple of years I can’t think of a better guy to bring in to keep the program in a good spot",
    "created_utc": 1758403312.0
  },
  {
    "body_html": "I do like how they keep blitzing. Not running the last 2 drives is wild though",
    "created_utc": 1758403318.0
  },
  {
    "body_html": "That arm isn't beating anybody.",
    "created_utc": 1758403326.0
  },
  {
    "body_html": "Obviously part of it is prevent defense giving stuff up but our offense is so much better when we're actually moving with a little bit of tempo and can get in a rhythm. The playcalling holds us back so much and has for years",
    "created_utc": 1758403601.0
  },
  {
    "body_html": "What happened to Cade? He looks like he took a few hits that broke his confidence.<br/> He has nervous feet, like a QB who was thrown to the wolves.",
    "created_utc": 1758403790.0
  },
  {
    "body_html": "Over/under number of Clemson players headed to the portal",
    "created_utc": 1758403797.0
  },
  {
    "body_html": "Garrett riley even looked disgusted",
    "created_utc": 1758403801.0
  },
  {
    "body_html": "Hell yeah, Orange Stanford!",
    "created_utc": 1758403801.0
  },
  {
    "body_html": "So is this rock bottom for Dabo?",
    "created_utc": 1758403806.0
  },
  {
    "body_html": "WTF was that throw.",
    "created_utc": 1758403807.0
  },
  {
    "body_html": "Maybe the big ten is on to something about punting. This whole going for it on 4th down isn’t working out",
    "created_utc": 1758403809.0
  },
  {
    "body_html": "Dabo better call thunder down from heaven in this post conference talk",
    "created_utc": 1758403854.0
  },
  {
    "body_html": "Nixon at speed is a goddamn bulldozer",
    "created_utc": 1758403890.0
  },
  {
    "body_html": "Heh",
    "created_utc": 1758403901.0
  },
  {
    "body_html": "I blame this on Ian Scheffilen",
    "created_utc": 1758403910.0
  },
  {
    "body_html": "Nah I’m not paying 30 for that espn, fuck off",
    "created_utc": 1758403910.0
  },
  {
    "body_html": "I may have read the rules wrong, but I'm relatively sure that if Syracuse holds on (looking increasingly likely after that pick), Clemson has to give up the color orange.   That's why Syracuse is mainly wearing white, you see, as they had lost the last time they played.",
    "created_utc": 1758403011.0
  },
  {
    "body_html": "Made decent money betting on Syracuse to cover. Didn’t think they would win, but knew the line was way too big seeing Clemson is pathetic. I just need USC to cover and my parlay will be good for this week",
    "created_utc": 1758403044.0
  },
  {
    "body_html": "Yall yelling  about Cuse throwing the ball. They’re trying to get their backup reps. And Cade hasn’t done jack shit. This game is over",
    "created_utc": 1758403218.0
  },
  {
    "body_html": "Can someone loop me in on what a Clemson is? Why the school named that",
    "created_utc": 1758400353.0
  },
  {
    "body_html": "Does Clemson even finish 500?",
    "created_utc": 1758400441.0
  },
  {
    "body_html": "I think Clemson was a little overrated in the preseason rankings.",
    "created_utc": 1758401357.0
  },
  {
    "body_html": "Just not gonna call that holding, eh?",
    "created_utc": 1758402211.0
  },
  {
    "body_html": "Hand it off!",
    "created_utc": 1758402657.0
  },
  {
    "body_html": "The emptiness in the stands is kind of jarring. The game is definitely not over. Wild",
    "created_utc": 1758402724.0
  },
  {
    "body_html": "YES!",
    "created_utc": 1758402953.0
  },
  {
    "body_html": "Sucks we probably won't win another game considering we now have no QB",
    "created_utc": 1758403021.0
  },
  {
    "body_html": "Finally! The return of Clemsoning!",
    "created_utc": 1758403031.0
  },
  {
    "body_html": "Look just know when your coach starts answering with his decades long accomplishments to a question that was never asked, you’re on the descent.",
    "created_utc": 1758403071.0
  },
  {
    "body_html": "How is the world is this game still going on????",
    "created_utc": 1758403489.0
  },
  {
    "body_html": "I love the barking commercial",
    "created_utc": 1758403568.0
  },
  {
    "body_html": "How long do programs gotta keep guys like Gundy and Dabo around? Like, thanks for everything but also how long do you let the guy who built the program actually tear it back down?",
    "created_utc": 1758403636.0
  },
  {
    "body_html": "Clemson is an acc bottomfeeder, always has been, no I will not look at the last 12 years of football history",
    "created_utc": 1758401967.0
  },
  {
    "body_html": "Dabo a fraud",
    "created_utc": 1758402992.0
  },
  {
    "body_html": "So which big program do we think is gonna hire Fran Brown after this season?",
    "created_utc": 1758400783.0
  },
  {
    "body_html": "Poor Syracuse, despite taking us to the cleaners, seems to have some serious issues with conditioning. How many injuries have they had now?",
    "created_utc": 1758402030.0
  },
  {
    "body_html": "Waiting for FSU - Clemson tickets to drop so I can go see a good team play in South Carolina for once",
    "created_utc": 1758403478.0
  },
  {
    "body_html": "Just goes to show how quickly you can go from top 10 program to an empty stadium at Home when you coach is a stubborn boomer",
    "created_utc": 1758403496.0
  },
  {
    "body_html": "Just smacked the DB in the face mask lmao",
    "created_utc": 1758400291.0
  },
  {
    "body_html": "That might be the quietest crowd i’ve ever seen. It’s dead silent.",
    "created_utc": 1758400484.0
  },
  {
    "body_html": "lmao holding his arm and no flag",
    "created_utc": 1758401805.0
  },
  {
    "body_html": "why wasnt syracuse tackling him?",
    "created_utc": 1758401952.0
  },
  {
    "body_html": "Too little too late",
    "created_utc": 1758402338.0
  },
  {
    "body_html": "I see the I formation and I jizz my shorts. Can’t help it. Wont apologize for it.",
    "created_utc": 1758403026.0
  },
  {
    "body_html": "just saw this, is dabo getting fired",
    "created_utc": 1758403046.0
  },
  {
    "body_html": "Kirby Smart disciple Fran Brown 😎",
    "created_utc": 1758403127.0
  },
  {
    "body_html": "Have to wonder if Angeli's condition is why they are giving the backup some reps throwing",
    "created_utc": 1758403293.0
  },
  {
    "body_html": "this mf is so ass 😭",
    "created_utc": 1758403309.0
  },
  {
    "body_html": "Holding.",
    "created_utc": 1758403403.0
  },
  {
    "body_html": "Clemson has a couple easy games coming up at least. No way they lose to UNC or BC",
    "created_utc": 1758403486.0
  },
  {
    "body_html": "So, when Bama inevitably runs Deboer out of town, is Fran Brown the new favorite for the job?",
    "created_utc": 1758403598.0
  },
  {
    "body_html": "Lmao. That’s the worst offensive holding non-call I’ve ever seen.",
    "created_utc": 1758401865.0
  },
  {
    "body_html": "We're definitely losing this game",
    "created_utc": 1758402704.0
  },
  {
    "body_html": "CFB fans and hyping up a mediocre QB. Name a better duo. Yall do not know ball at all",
    "created_utc": 1758403040.0
  },
  {
    "body_html": "Block in the backs legal now?",
    "created_utc": 1758402520.0
  },
  {
    "body_html": "Come on Clempson. Fire him.",
    "created_utc": 1758403077.0
  },
  {
    "body_html": "LFG!!!!!",
    "created_utc": 1758398890.0
  },
  {
    "body_html": "so if worst case scenario angeli is out for the season can he redshirt?",
    "created_utc": 1758400067.0
  },
  {
    "body_html": "Dabo needs to put in Ian schifflein",
    "created_utc": 1758400253.0
  },
  {
    "body_html": "Upheld!",
    "created_utc": 1758400379.0
  },
  {
    "body_html": "tom allen is your issue. your welcome",
    "created_utc": 1758400604.0
  },
  {
    "body_html": "I say it again: because that’s all we’ve done is win…",
    "created_utc": 1758400969.0
  },
  {
    "body_html": "Is belfor the replacement for fema???",
    "created_utc": 1758401647.0
  },
  {
    "body_html": "Let Tyler from Spartanburg cook",
    "created_utc": 1758401783.0
  },
  {
    "body_html": "They do know you're supposed to grab them not give them back pats? lol",
    "created_utc": 1758402000.0
  },
  {
    "body_html": "i’m scared",
    "created_utc": 1758402173.0
  },
  {
    "body_html": "[deleted]",
    "created_utc": 1758402182.0
  },
  {
    "body_html": "Rickie Collins is not good so this will be interesting how Syracuse tries to ice this one",
    "created_utc": 1758402388.0
  },
  {
    "body_html": "To think 90% of the pre season mock drafts had Arch, Cade and Allar as top 5 picks lol",
    "created_utc": 1758402429.0
  },
  {
    "body_html": "Did Syracuse’s 2nd string qb get injured?",
    "created_utc": 1758402682.0
  },
  {
    "body_html": "That doesn’t stop the clock at all anymore",
    "created_utc": 1758402751.0
  },
  {
    "body_html": "yeah clemson isn’t scoring through the air anyway.",
    "created_utc": 1758402905.0
  },
  {
    "body_html": "Catch if sapp doesnt just stop running for some reason",
    "created_utc": 1758402910.0
  },
  {
    "body_html": "it's over",
    "created_utc": 1758402931.0
  },
  {
    "body_html": "Now run the ball",
    "created_utc": 1758402950.0
  },
  {
    "body_html": "Alright, Orange. 3 more pass plays?",
    "created_utc": 1758402956.0
  },
  {
    "body_html": "Lmao",
    "created_utc": 1758402967.0
  },
  {
    "body_html": "Well, then there’s that.",
    "created_utc": 1758402970.0
  },
  {
    "body_html": "GO ORANGE!!!",
    "created_utc": 1758402973.0
  },
  {
    "body_html": "OH MY GOD!!!!!!!!",
    "created_utc": 1758402974.0
  },
  {
    "body_html": "holy shit",
    "created_utc": 1758402976.0
  },
  {
    "body_html": "That was pretty nasty damn",
    "created_utc": 1758402979.0
  },
  {
    "body_html": "Someone called that earlier.. Identify yourself and give me powerball numbers, you beautiful bastard!!",
    "created_utc": 1758402979.0
  },
  {
    "body_html": "No passes  Only runs  Do not fuck this up",
    "created_utc": 1758402993.0
  },
  {
    "body_html": "Game over",
    "created_utc": 1758402995.0
  },
  {
    "body_html": "i think u have to throw it here if ur syracuse",
    "created_utc": 1758402998.0
  },
  {
    "body_html": "RIP",
    "created_utc": 1758403020.0
  },
  {
    "body_html": "Kade’s face was perfect",
    "created_utc": 1758403023.0
  },
  {
    "body_html": "Run the ball, drain clock, play defense",
    "created_utc": 1758403024.0
  },
  {
    "body_html": "What game do i watch now? :/ Michigan?",
    "created_utc": 1758403107.0
  },
  {
    "body_html": "Honestly Cade just sails the ball in crucial moments",
    "created_utc": 1758403119.0
  },
  {
    "body_html": "Idk if I’m crazy or just cynical but it feels like the QB draft class for the next couple years are in a terrible, terrible position. Like backup NFL material at best",
    "created_utc": 1758403135.0
  },
  {
    "body_html": "I am very happy with this",
    "created_utc": 1758403148.0
  },
  {
    "body_html": "I don’t understand. Why not run the ball? Is syracuse fucking braindead",
    "created_utc": 1758403174.0
  },
  {
    "body_html": "Great punt",
    "created_utc": 1758403222.0
  },
  {
    "body_html": "Come on get a safety!",
    "created_utc": 1758403287.0
  },
  {
    "body_html": "The fucking balls on cuse",
    "created_utc": 1758403312.0
  },
  {
    "body_html": "The creative blitzing and pressure on the QB has been something to watch this game.",
    "created_utc": 1758403318.0
  },
  {
    "body_html": "Deep ball incoming",
    "created_utc": 1758403415.0
  },
  {
    "body_html": "Keys to victory lol",
    "created_utc": 1758403659.0
  },
  {
    "body_html": "woof",
    "created_utc": 1758403794.0
  },
  {
    "body_html": "Sharpen the axe Neff, theres changes afoot!",
    "created_utc": 1758403799.0
  },
  {
    "body_html": "This is a crazy timeline",
    "created_utc": 1758403810.0
  },
  {
    "body_html": "Wesco will transfer to LSU",
    "created_utc": 1758403812.0
  },
  {
    "body_html": "Who do Clemson fans have in mind for their next coach?",
    "created_utc": 1758403818.0
  },
  {
    "body_html": "At least Randall was gonna get tackled short so i cant be that mad at it. I dont know how theres that many people coming through unblocked that quick",
    "created_utc": 1758403835.0
  },
  {
    "body_html": "Damn straight buns",
    "created_utc": 1758403836.0
  },
  {
    "body_html": "Klubnik has thrown 60 passes",
    "created_utc": 1758403845.0
  },
  {
    "body_html": "lol what was that",
    "created_utc": 1758403892.0
  },
  {
    "body_html": "(Cries) “Go Toros…”",
    "created_utc": 1758403939.0
  },
  {
    "body_html": "What kind of man goes by \"Dabo\". I mean seriously  Edit: Y'all can downvote me all you want. He has a weird ass name",
    "created_utc": 1758400984.0
  },
  {
    "body_html": "Clemson fans are pathetic. I'm a Georgia alum but I almost want them to win just so he 80k fans who left early can have the shame they deserve",
    "created_utc": 1758401912.0
  },
  {
    "body_html": "Dabo Swinney, go ahead and start shopping for properties in Thailand or South America. You will be retiring pal.",
    "created_utc": 1758401689.0
  },
  {
    "body_html": "Are Clemson fans tired of all the winning yet?",
    "created_utc": 1758403515.0
  },
  {
    "body_html": "I’m wheezing 😭😭😭 this is like a movie bro",
    "created_utc": 1758402977.0
  },
  {
    "body_html": "Does Dabo get Tarmac’d at home?",
    "created_utc": 1758402977.0
  },
  {
    "body_html": "Those stands empty   They have no faith in the home team lmao (i know there was a huge delay)",
    "created_utc": 1758403230.0
  },
  {
    "body_html": "You would think getting your butt whooped by a coach from a Kirby coaching tree that started 10 years after you when your coaching tree has been a disaster would humble you but…probably not",
    "created_utc": 1758403295.0
  },
  {
    "body_html": "Klubnik's pocket presence has been pretty nice in Q4 tbh",
    "created_utc": 1758403430.0
  },
  {
    "body_html": "Thats dpi dude come on. His left arm is being held the whole time",
    "created_utc": 1758401808.0
  },
  {
    "body_html": "I don't understand why there's not some sort of review booth that watches all plays for missed penalties. Pretty sure ufl does it",
    "created_utc": 1758401917.0
  },
  {
    "body_html": "I cannot wait for Dabo’s postgame life lesson after this one.",
    "created_utc": 1758402198.0
  },
  {
    "body_html": "Using those timeouts would've been incompetent if Syracuse had good coaches but",
    "created_utc": 1758402755.0
  },
  {
    "body_html": "I hate the new clock rules",
    "created_utc": 1758402830.0
  },
  {
    "body_html": "Selfish play - just knock it down on 4th.",
    "created_utc": 1758402957.0
  },
  {
    "body_html": "It's never been more Dabover",
    "created_utc": 1758402973.0
  },
  {
    "body_html": "Props to the homie that totally called that Klubnik int like 2 mins ago",
    "created_utc": 1758402997.0
  },
  {
    "body_html": "SYRACUSE -17.5 LIVE???",
    "created_utc": 1758402997.0
  },
  {
    "body_html": "This is like watching the last 3 minutes of a basketball game",
    "created_utc": 1758403298.0
  },
  {
    "body_html": "I know this is completely not the right place to bring this up but I cut my ear (tragus). No idea how and it's bleeding like when you cut yourself shaving. I'm almost considering going to urgent care lol.",
    "created_utc": 1758403767.0
  },
  {
    "body_html": "Damn…gonna be a lot of Confederate flags at 1/2 mast today.",
    "created_utc": 1758403072.0
  },
  {
    "body_html": "People downvoting the fake injury claims like Syracuse didnt do the same shit against tennessee and these injuries all have super convinient timing",
    "created_utc": 1758402221.0
  },
  {
    "body_html": "CLEMSON LMAAAAOOOOOOOO",
    "created_utc": 1758401197.0
  },
  {
    "body_html": "The fucking worst pass protection I’ve ever seen",
    "created_utc": 1758402018.0
  },
  {
    "body_html": "Two hamstrings cramp at the same time, huh?",
    "created_utc": 1758401981.0
  },
  {
    "body_html": "[removed]",
    "created_utc": 1758402105.0
  },
  {
    "body_html": "lol these refs",
    "created_utc": 1758403446.0
  },
  {
    "body_html": "I hate to be that guy but 3-4 of syracuses stops for injuries have halted drives that had momentum",
    "created_utc": 1758401991.0
  },
  {
    "body_html": "Eh, he didn’t have control",
    "created_utc": 1758400270.0
  },
  {
    "body_html": "Take the points wtf are you doing",
    "created_utc": 1758400717.0
  },
  {
    "body_html": "Game",
    "created_utc": 1758403000.0
  },
  {
    "body_html": "Is dabo getting fired if he misses a bowl game?",
    "created_utc": 1758403007.0
  },
  {
    "body_html": "Iv been watching Michigan and Nebraska. Has Dabo and Clemson been just as bad this half as they were in the first? I mean obviously the score.. but how’s it been? Iv missed so much shit talking",
    "created_utc": 1758403109.0
  },
  {
    "body_html": "Good",
    "created_utc": 1758403290.0
  },
  {
    "body_html": "Clempson gon win",
    "created_utc": 1758402188.0
  },
  {
    "body_html": "that throw was fine, he was just locked down",
    "created_utc": 1758399561.0
  },
  {
    "body_html": "[removed]",
    "created_utc": 1758401652.0
  }
]